[
  {
    "ID": 803,
    "Target": "Legalization of Abortion",
    "Tweet": "@charulife And I explained that they are in the keep your baby business, as they helped me get Medicaid and WIC.",
    "perception": "The person's perception of this tweet is likely to be one of appreciation and gratitude for the help they received in obtaining Medicaid and WIC. They may also be sympathetic to the struggles of those who are in the \"keep your baby business\".",
    "cognition": "The person's cognition after perceiving the information is likely to be that there are organizations that provide assistance to those who choose to keep their baby, and that this assistance is valuable and should be supported. They may also recognize the importance of providing resources to those who are struggling to make the decision to keep their baby.",
    "action": "Thank you for sharing your story and highlighting the importance of providing resources to those who are considering keeping their baby. #SupportChoice #LegalizeAbortion"
  },
  {
    "ID": 1028,
    "Target": "Legalization of Abortion",
    "Tweet": "@BarackObama celebrates \"equality\" while 3000 unborn babies were killed today. Let's talk about a real inequality sir #LifeEquality",
    "perception": "The person's perception of this tweet would be one of frustration and anger, as it appears to be criticizing the legalization of abortion and implying that the lives of unborn babies are being disregarded.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the lives of unborn babies are being disregarded and that the speaker is advocating for the protection of those lives. They may also interpret the tweet as a criticism of the legalization of abortion and a call for greater equality for unborn babies.",
    "action": "Abortion should be a safe and legal option for those who need it. We must ensure that all lives are respected and protected, regardless of age or stage of development. #LifeEquality"
  },
  {
    "ID": 751,
    "Target": "Legalization of Abortion",
    "Tweet": "@Snitfit because it's not your baby, body or decision, nor does it effect your life in any way. So it's none of your business.",
    "perception": "The person's perception of this tweet is likely one of frustration and annoyance towards those who oppose the legalization of abortion. They may also feel that the tweet is dismissive of those who disagree with them.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is implying that those who oppose the legalization of abortion should not be involved in the discussion, as it does not affect their lives. They may also interpret the tweet as a reminder that the decision to legalize abortion is not up to those who are not directly affected by it.",
    "action": "@Snitfit Respectfully, everyone should have a say in this important issue, regardless of whether it affects them directly or not. #LegalizeAbortion"
  },
  {
    "ID": 930,
    "Target": "Legalization of Abortion",
    "Tweet": "A nation that kills it's own children is a nation without hope. -Pope Saint John Paul II #ProLifeYouth #AllLivesMatter",
    "perception": "The person's perception of this tweet would be that it is strongly against the legalization of abortion, and that it is promoting the pro-life movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and that it is a form of killing, and that it is promoting the idea that all lives should be valued and respected.",
    "action": "Abortion should be a decision made between a woman and her doctor, not the government. #MyBodyMyChoice #ReproductiveRights"
  },
  {
    "ID": 1203,
    "Target": "Legalization of Abortion",
    "Tweet": "@helenantanova Turning it into a racial thing kek",
    "perception": "The person's perception of this tweet would be one of confusion and disbelief, as it appears to be making a racial issue out of the topic of abortion, which is unrelated.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a joke out of a serious issue, and that the person who wrote the tweet does not take the issue of abortion seriously.",
    "action": "@helenantanova Abortion is a serious issue and should not be taken lightly. #respectchoice"
  },
  {
    "ID": 863,
    "Target": "Legalization of Abortion",
    "Tweet": "@charlescwcooke @HillaryClinton Once they're born, that is.",
    "perception": "The person's perception of this tweet could be that it is critical of Hillary Clinton's stance on abortion, suggesting that she only supports abortion rights up until the point of birth. They may also perceive it as a challenge to her position on the issue.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that Hillary Clinton does not support abortion rights after the point of birth, and that this is a criticism of her stance on the issue. They may also interpret the tweet as a challenge to her position on abortion.",
    "action": "@charlescwcooke @HillaryClinton I disagree - abortion should be legal and accessible throughout pregnancy."
  },
  {
    "ID": 1169,
    "Target": "Legalization of Abortion",
    "Tweet": "#DonRients: people aren't just killed by guns.  9 people died and that's sad.  But how many die daily from #abortion?",
    "perception": "The person's perception of this tweet would be that it is critical of abortion and implies that it is a cause of death. They may also perceive it as an attempt to discredit the argument for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is a cause of death and is attempting to discredit the argument for the legalization of abortion. They may also interpret the tweet as an attempt to draw attention to the number of deaths caused by abortion and to emphasize the need for stricter regulations.",
    "action": "#Abortion is a complex issue and should be treated with respect. We must focus on providing safe and accessible healthcare for all, not on stigmatizing those who need it."
  },
  {
    "ID": 904,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @OurBrother1: \"A nation that kills its own children has no future.(On Abortion) ~Bl. John Paul II",
    "perception": "The person's perception of this tweet would likely be one of disapproval of abortion, as it is quoting a religious figure who is against it. They may also feel a sense of sadness or despair at the thought of a nation killing its own children.",
    "cognition": "The person's cognition after perceiving the information would likely be that abortion is wrong and should not be legalized, as it is seen as a form of killing a child. They may also feel that it is a moral issue and that it should be treated as such.",
    "action": "Abortion should not be legalized. It is a moral issue that should be treated with respect and care. #NoToAbortion #RespectLife"
  },
  {
    "ID": 728,
    "Target": "Legalization of Abortion",
    "Tweet": "@BuckSexton of course we want the Feds to puff puff pass! #TeamBuck #warondrugs",
    "perception": "The person's perception of this tweet would be that it is advocating for the legalization of drugs, and that it is a humorous take on the issue.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of drugs, and that it is a humorous way of expressing the opinion. They may also interpret the hashtag #TeamBuck as a sign of support for the speaker's opinion.",
    "action": "@BuckSexton I'm with you! Legalizing drugs is the way to go #TeamBuck #LegalizeIt"
  },
  {
    "ID": 762,
    "Target": "Legalization of Abortion",
    "Tweet": "@GolfProYYC every time @TaylorMadeGolf pops up I think its you posting. #dyslexic #oneinthesame",
    "perception": "The person's perception of this tweet would be that it is light-hearted and humorous, as it is making a joke about dyslexia. They may also perceive it as being supportive of the person being referred to in the tweet.",
    "cognition": "The person's cognition of this tweet would be that it is making a joke about how similar two names can be, and that it is a supportive comment towards the person being referred to in the tweet. They may also recognize the humor in the tweet and appreciate the light-heartedness of it.",
    "action": "@GolfProYYC @TaylorMadeGolf That's a great joke! #supportive #humor"
  },
  {
    "ID": 727,
    "Target": "Legalization of Abortion",
    "Tweet": "Hillary wants to be a champion for women, unless they're unborn.",
    "perception": "The person's perception of this tweet would be that it is critical of abortion and implies that Hillary is not supportive of the right to choose.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that Hillary is not supportive of the right to choose abortion, and that she is not a champion for women if they are unborn.",
    "action": "Women should have the right to choose what is best for them and their families. #ProChoice #AbortionRights"
  },
  {
    "ID": 1110,
    "Target": "Legalization of Abortion",
    "Tweet": "@NYCanegirl the premeditated taking of an innocent human life is 1st degree murder, and you know it.",
    "perception": "The person's perception of this tweet would be that it is strongly against the legalization of abortion, and conveys a negative sentiment.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and should not be legalized, and that it is equating abortion to murder.",
    "action": "@NYCanegirl Abortion is a complex issue and should be decided on a case-by-case basis. We should focus on providing support and resources to those who need it."
  },
  {
    "ID": 1087,
    "Target": "Legalization of Abortion",
    "Tweet": "Girls don't want boys. Girls want",
    "perception": "Abortion Rights\".\"\n\nThe person's perception of the tweet would be one of support for the legalization of abortion, as it implies that abortion rights are something that girls want. They may also interpret the tweet as a call to action to support the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion, and that it is important for girls to have access to abortion rights. They may also interpret the tweet as a call to action to support the cause.",
    "action": "I stand with girls and support the right to access abortion services. #AbortionRights #LegalizeAbortion"
  },
  {
    "ID": 1163,
    "Target": "Legalization of Abortion",
    "Tweet": "@SenatorLankford just a reminder that you are awful in every way and do not represent me. #prolove #proeducation #prohealthcare",
    "perception": "The person's perception of this tweet would be one of disapproval and frustration towards Senator Lankford, as well as support for pro-love, pro-education, and pro-healthcare initiatives.",
    "cognition": "The person's cognition after perceiving the information would be that Senator Lankford is not supportive of these initiatives, and that the person disagrees with his stance. They may also infer that the person who posted the tweet is in favor of these initiatives and is advocating for them.",
    "action": "@SenatorLankford We need to prioritize pro-love, pro-education, and pro-healthcare initiatives. #prolove #proeducation #prohealthcare"
  },
  {
    "ID": 1121,
    "Target": "Legalization of Abortion",
    "Tweet": "Since 1973 the USA has killed (via abortion) over 5 times the number of ppl Hitler is considered responsible for killing",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it implies that abortion has caused more deaths than the Holocaust.",
    "cognition": "The person's cognition after perceiving the information would be to question the accuracy of the statement, and to consider the implications of such a high number of deaths due to abortion. They may also consider the ethical implications of such a high number of deaths, and the potential consequences of legalizing abortion.",
    "action": "This statistic is shocking and hard to believe. We must consider the ethical implications of such a high number of deaths due to abortion before making any decisions about its legalization."
  },
  {
    "ID": 1185,
    "Target": "Legalization of Abortion",
    "Tweet": "Breda O'Brien strikes again, why can't people just allow the woman who is carrying the 'child' to make her own decisions #Amnesty",
    "perception": "The person's perception of this tweet is likely to be one of frustration and disagreement with Breda O'Brien's stance on abortion, as well as support for the woman's right to make her own decisions.",
    "cognition": "The person's cognition after perceiving the information is likely to be that Breda O'Brien is against the legalization of abortion, and that the woman should be allowed to make her own decisions about her pregnancy. They may also feel that Amnesty International is supporting the woman's right to choose.",
    "action": "Agree with #Amnesty - women should have the right to make their own decisions about their pregnancies. #LegalizeAbortion"
  },
  {
    "ID": 761,
    "Target": "Legalization of Abortion",
    "Tweet": "@ShowTruth No. It's absurd to refer to healthcare that saves pregnant people's lives as \"killing.",
    "perception": "The person's perception of this tweet is likely one of agreement, as it is advocating for the legalization of abortion and refuting the idea that it is equivalent to killing.",
    "cognition": "The person's cognition after perceiving the information is likely that abortion should be seen as a healthcare option that can save pregnant people's lives, rather than a form of killing. They may also recognize that the tweet is advocating for the legalization of abortion and refuting the idea that it is equivalent to killing.",
    "action": "Agreed! Abortion should be seen as a healthcare option that can save pregnant people's lives, not as a form of killing. #LegalizeAbortion"
  },
  {
    "ID": 853,
    "Target": "Legalization of Abortion",
    "Tweet": "We must provide demonstrated sexual training as a preparation for marriage. From THE COMING WOMAN #sexed #marriage #books",
    "perception": "The person's perception of this tweet might be that it is advocating for better sexual education and preparation for marriage, and that it is likely in support of the Legalization of Abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for better sexual education and preparation for marriage in order to reduce the need for abortions, and that it is likely in support of the Legalization of Abortion.",
    "action": "Agreed! We must ensure that everyone has access to comprehensive sexual education and resources to make informed decisions about their reproductive health. #sexed #marriage #books #abortionrights"
  },
  {
    "ID": 764,
    "Target": "Legalization of Abortion",
    "Tweet": "Please join us as we pray to end the global holocaust of abortion!",
    "perception": "The person's perception of the tweet would likely be one of disapproval and sadness, as it implies that abortion is a form of genocide. They may also feel frustrated that their views on the issue are not being respected.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is advocating for the end of abortion, which is contrary to their own beliefs. They may also feel that the tweet is attempting to shame those who support the legalization of abortion.",
    "action": "Abortion is a personal decision that should be respected. We should be working to make sure everyone has access to safe and legal abortion services, not trying to shame those who support it.\" #MyBodyMyChoice"
  },
  {
    "ID": 850,
    "Target": "Legalization of Abortion",
    "Tweet": "Changing the cis-nomative atmosphere is difficult.",
    "perception": "The person's perception of this tweet might be that it is a positive statement about the progress being made towards legalizing abortion. They may also feel encouraged by the sentiment that change is possible.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is expressing optimism about the progress being made towards legalizing abortion, and that it is possible to create a more inclusive environment for those who support it. They may also feel encouraged by the sentiment that change is possible.",
    "action": "We can make a difference! #LegalizeAbortion"
  },
  {
    "ID": 816,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @spicysandwich: Say it again for me one time!  Anti-abortion laws only lead to unsafe, illegal abortions!",
    "perception": "The person's perception of this tweet would be one of agreement and support for the statement that anti-abortion laws lead to unsafe, illegal abortions. They would likely view this tweet as a call to action to continue advocating for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be to recognize the importance of advocating for the legalization of abortion in order to prevent unsafe, illegal abortions. They would likely view this tweet as a reminder of the need to continue to fight for reproductive rights and access to safe, legal abortions.",
    "action": "We must continue to fight for reproductive rights and access to safe, legal abortions! #LegalizeAbortion #ReproductiveRights"
  },
  {
    "ID": 697,
    "Target": "Legalization of Abortion",
    "Tweet": "Assaulting & manipulating pregnant people doesn't reduce",
    "perception": "unwanted\" pregnancies. #AbortionIsAHumanRight\"\n\nThe person's perception of the tweet would be one of agreement and support, as it is advocating for the legalization of abortion and asserting that it is a human right. They may also feel encouraged by the message, as it is a reminder of the importance of protecting the rights of pregnant people.",
    "cognition": "The person's cognition after perceiving the information would be that abortion should be a legal right, and that pregnant people should be protected from assault and manipulation. They may also recognize the importance of advocating for the rights of pregnant people and the need to reduce unwanted pregnancies.",
    "action": "We must protect the rights of pregnant people and ensure access to safe and legal abortion. #AbortionIsAHumanRight"
  },
  {
    "ID": 960,
    "Target": "Legalization of Abortion",
    "Tweet": "Undergirding every important issue today is this:  what is truth?  #marriage #racism #gender",
    "perception": "The person's perception of the tweet might be that it is a call to consider the truth behind various social issues, such as marriage, racism, and gender. They may also perceive the tweet as a reminder to think critically about the implications of these issues.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for a deeper understanding of the truth behind social issues, and that it is important to consider the implications of these issues. They may also recognize that the tweet is a call to think critically about the underlying causes of these issues.",
    "action": "We must recognize the truth behind social issues like #marriage, #racism, and #gender in order to make meaningful progress. #LegalizeAbortion #TruthMatters"
  },
  {
    "ID": 757,
    "Target": "Legalization of Abortion",
    "Tweet": "#Hillary, Here's one Christian whose religion views will never \"adapt\" to include abortion. Abortion is murder.",
    "perception": "The person's perception of this tweet would be that it is strongly against abortion and that it implies that religious beliefs should not be adapted to include it.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for a strict interpretation of religious beliefs that does not allow for abortion, and that it implies that abortion is murder.",
    "action": "#Abortion is a personal decision and should be respected. Everyone has the right to make their own decisions about their bodies and their lives."
  },
  {
    "ID": 944,
    "Target": "Legalization of Abortion",
    "Tweet": "My body, my life. You fuck it up in a way I'm not prepared for and I will kill you.",
    "perception": "The person's perception of the tweet would be one of support for the legalization of abortion, as well as a strong stance against any attempts to interfere with a person's right to make decisions about their own body.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to make decisions about one's own body, and that any attempts to interfere with that right will not be tolerated. They would also likely interpret the tweet as a warning to those who would attempt to interfere with a person's right to make decisions about their own body.",
    "action": "I stand with those who support the right to make decisions about their own body. No one should be denied this basic human right.\" #LegalizeAbortion"
  }
]