[
  {
    "ID": 735,
    "Target": "Legalization of Abortion",
    "Tweet": "Some Bitches be scared to kill a little cockroach in their house but quick to kill a baby...",
    "perception": "The person's perception of this tweet would be one of shock and disapproval of the sentiment expressed, as it implies that those who support abortion are callous and uncaring.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a comparison between killing a baby and killing a cockroach, implying that those who support abortion are not taking into account the value of human life. They would also likely be offended by the use of the word \"bitch\" to refer to those who support abortion.",
    "action": "This tweet is offensive and wrong. Abortion is a complex issue and should be discussed with respect and empathy."
  },
  {
    "ID": 794,
    "Target": "Legalization of Abortion",
    "Tweet": "Idiot: how would you feel if your mom aborted you?  Me: nothing cause I would be fucking dead.",
    "perception": "The person's perception of this tweet would be that it is mocking those who oppose the legalization of abortion, and conveying a sentiment of sarcasm.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a point that abortion is a personal decision and that it should not be judged by others. They would also understand that the tweet is making a joke about the absurdity of the question posed.",
    "action": "Abortion is a personal decision and should not be judged by others. #LegalizeAbortion"
  },
  {
    "ID": 1090,
    "Target": "Legalization of Abortion",
    "Tweet": "What is it that makes the human race behave in an undignified way to gain attention? #furgison #prideparade #potus #isis #lgbt",
    "perception": "The person's perception of the tweet might be that it is critical of the human race for not behaving in a dignified manner, and that it is likely related to the Pride Parade and other current events.",
    "cognition": "The person's cognition of the tweet might be that it is a criticism of the human race for not behaving in a respectful way, and that it is likely related to the Pride Parade and other current events, such as the actions of the President of the United States and the Islamic State.",
    "action": "We should strive to be more respectful and dignified in our actions, no matter the situation. #respect #dignity #prideparade #potus #isis #lgbt"
  },
  {
    "ID": 929,
    "Target": "Legalization of Abortion",
    "Tweet": "@kfadich Every sperm is apparently sacred, and entitled to use of someone's body. #rapeculture #worstargumentever",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it implies that women should be forced to carry out pregnancies against their will.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a false and dangerous argument that women should not have the right to choose whether or not to have an abortion. They would also recognize that the tweet is perpetuating rape culture by implying that women should be forced to carry out pregnancies against their will.",
    "action": "No one should be forced to carry out a pregnancy against their will. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 680,
    "Target": "Legalization of Abortion",
    "Tweet": "As long as they are allowed to show medically correct photos of contraception use at the family planning table #StopAbortion",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, and that it is advocating for the use of contraception as an alternative.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the use of contraception as an alternative to abortion, and that it is suggesting that family planning tables should be allowed to show medically correct photos of contraception use.",
    "action": "Abortion should be a safe and legal option for those who need it. #LegalizeAbortion"
  },
  {
    "ID": 1184,
    "Target": "Legalization of Abortion",
    "Tweet": "If 'tis not human beings in the womb, how do we harvest and transplant their organs onto human beings?",
    "perception": "The person's perception of this tweet would likely be one of confusion and skepticism, as it appears to be questioning the humanity of the fetus and implying that it is not a human being.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is attempting to make a point about the humanity of the fetus and the implications of abortion. They may also be questioning the morality of harvesting organs from a fetus and using them for transplants.",
    "action": "Abortion is a complex issue that deserves thoughtful consideration. We should focus on providing safe and accessible healthcare for all, regardless of their beliefs."
  },
  {
    "ID": 1046,
    "Target": "Legalization of Abortion",
    "Tweet": "@j6fras same but I got hated for it. #progod #progun",
    "perception": "The person's perception of this tweet might be that the author is expressing frustration at being criticized for their stance on abortion, and that they are also in favor of religious and gun rights.",
    "cognition": "The person's cognition after perceiving the information might be that the author is expressing their belief that abortion should be legalized, and that they are also in favor of religious and gun rights, despite the criticism they have received. They may also be suggesting that these two issues are related in some way.",
    "action": "@j6fras I'm sorry you got hate for your stance on abortion. I support your right to choose and also your religious and gun rights. #prochoice #progod #progun"
  },
  {
    "ID": 684,
    "Target": "Legalization of Abortion",
    "Tweet": "I've noticed that everybody that is for Abortion has already been born-Ronald Reagan #LetthemLive #AllLivesMatter",
    "perception": "The person's initial perception of the tweet might be one of surprise and confusion, as it appears to be an argument against abortion, despite the person's support for it. They may also feel a sense of frustration, as the hashtag implies that the tweet is part of a larger anti-abortion movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that those who support abortion are hypocritical, as they are alive and have already been born. They may also interpret the tweet as an attempt to discredit the pro-abortion movement by suggesting that it is not in favor of protecting all lives.",
    "action": "Abortion is about protecting the rights of women and their autonomy over their own bodies. #MyBodyMyChoice #ProChoice"
  },
  {
    "ID": 779,
    "Target": "Legalization of Abortion",
    "Tweet": "What is the difference between a baby and a onion? No one cries when you chop up the baby.   Hahahahaha! Love dead babies! #Babies",
    "perception": "The person's perception of this tweet would be one of shock and disgust, as it is making light of a serious issue and is insensitive to those who have had to make difficult decisions regarding abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a joke out of a serious issue and is insensitive to those who have had to make difficult decisions regarding abortion. They would also likely feel that the tweet is inappropriate and offensive.",
    "action": "This tweet is inappropriate and offensive. Making light of a serious issue is insensitive to those who have had to make difficult decisions regarding abortion. #RespectLife #AbortionRights"
  },
  {
    "ID": 700,
    "Target": "Legalization of Abortion",
    "Tweet": "Anti-vaxxers are such an idiotic bunch... Seriously, guys. Vaccinate. Your. Kids. #stopsb277 #conformcomics #marvel #dc",
    "perception": "The person's perception of this tweet would be that it is critical of those who oppose vaccinations and is advocating for vaccinations. They may also perceive it as a call to action to vaccinate children.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for vaccinations and is critical of those who oppose them. They may also interpret the tweet as a call to action to vaccinate children in order to protect them from preventable diseases.",
    "action": "Vaccinations are essential for protecting our children from preventable diseases. Let's make sure all kids are vaccinated! #stopsb277 #conformcomics #marvel #dc"
  },
  {
    "ID": 1004,
    "Target": "Legalization of Abortion",
    "Tweet": "#bristolpalin is more proof that #abstinence only education doesn't work. Affordable access to contraception",
    "perception": "The person's perception of this tweet would be that it is in favor of abortion, as it implies that abstinence-only education is ineffective and that contraception should be more accessible.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for more accessible contraception as an alternative to abstinence-only education, and that this could be a way to reduce the need for abortions.",
    "action": "Agreed! Access to contraception is key to reducing the need for abortions and should be more widely available #prochoice"
  },
  {
    "ID": 689,
    "Target": "Legalization of Abortion",
    "Tweet": "Hey Megan--a baby's heart starts beating at 21 days after conception. No time is the right time to end its life!! #kellyfile",
    "perception": "The person's perception of this tweet would be one of shock and disapproval, as it implies that abortion is wrong and should not be legalized.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and should not be legalized, and that it is wrong to end a baby's life at any stage of development.",
    "action": "Abortion should be a decision made between a woman and her doctor, not dictated by outdated laws. #reproductivefreedom"
  },
  {
    "ID": 1057,
    "Target": "Legalization of Abortion",
    "Tweet": "We're at a moment where we need the kind of intergenerational dialogue that RBG brings @irin  @AspenInstitute Spotlight:Health",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as it mentions the need for intergenerational dialogue on the issue. They may also view the tweet as a call to action to further the conversation on the topic.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is encouraging people to have a dialogue about the issue of abortion and that the tweet is supportive of the legalization of abortion. They may also interpret the tweet as a call to action to further the conversation on the topic.",
    "action": "I'm in full support of the legalization of abortion and I'm ready to join the conversation! #intergenerationaldialogue #RBG #AspenInstitute #SpotlightHealth"
  },
  {
    "ID": 1014,
    "Target": "Legalization of Abortion",
    "Tweet": "Today the proverbial straw broke the back of America It's just a matter of time We've gone too far... #LoveWins",
    "perception": "The person's perception of the tweet would be one of positivity and acceptance, as the hashtag #LoveWins implies a message of inclusivity and support for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing a message of hope and optimism that the legalization of abortion will eventually be achieved. They may also interpret the tweet as a call to action to continue to fight for the rights of those who support the legalization of abortion.",
    "action": "We must continue to fight for the rights of those who support the legalization of abortion! #LoveWins #AbortionRights"
  },
  {
    "ID": 934,
    "Target": "Legalization of Abortion",
    "Tweet": "@prolife_wife Yup. The women in the womb are as precious as those who are outside of it. #ProLifeYouth #AllLivesMatter",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it emphasizes the importance of protecting the lives of unborn children. They may also perceive it as a sentiment of pro-life advocacy.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of unborn children and is against the legalization of abortion. They may also interpret the hashtag #AllLivesMatter as a statement that all lives, including those of unborn children, should be valued and protected.",
    "action": "@prolife_wife I disagree. Women should have the right to make decisions about their own bodies. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 1069,
    "Target": "Legalization of Abortion",
    "Tweet": "I wonder if America will like focus on real issues now #starvingchildren #abuse #nationaldebt #terrorism",
    "perception": "The person's perception of this tweet might be that it is critical of the focus on abortion and is advocating for attention to other issues such as hunger, abuse, national debt, and terrorism. They may also perceive the tweet as being pro-life.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is suggesting that the focus on abortion is distracting from more important issues, and that the tweet is advocating for attention to be paid to those issues instead. They may also interpret the tweet as being critical of the pro-choice movement.",
    "action": "Agreed! We should be focusing on the real issues that are impacting our society, not just abortion. #starvingchildren #abuse #nationaldebt #terrorism"
  },
  {
    "ID": 749,
    "Target": "Legalization of Abortion",
    "Tweet": "@explicit0ceans But adoption chooses to let them live. Obviously a huge difference. You can see that, right?  #Adoption",
    "perception": "The person's perception of this tweet is likely to be one of disagreement with the sentiment expressed, as it implies that adoption is a preferable alternative to abortion. They may also feel that the tweet is attempting to shame those who support the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is implying that adoption is a better option than abortion, and that those who support the legalization of abortion are wrong. They may also feel that the tweet is attempting to shame them for their beliefs.",
    "action": "@explicit0ceans Respectfully, I disagree. Everyone should have the right to make their own decisions about their bodies. #AbortionRights"
  },
  {
    "ID": 855,
    "Target": "Legalization of Abortion",
    "Tweet": "She*  knows what's best for her* happiness & her* body",
    "perception": "The person's perception of the tweet is likely to be one of support for the legalization of abortion, as it emphasizes the importance of an individual's autonomy and decision-making power.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the individual should have the right to make decisions about their own body and happiness, and that abortion should be a legal option for them to consider. They may also recognize that the tweet is advocating for the individual's right to choose.",
    "action": "I fully support the right of individuals to make decisions about their own body and happiness. #LegalizeAbortion"
  },
  {
    "ID": 973,
    "Target": "Legalization of Abortion",
    "Tweet": "Well now that marriage is out of the way we can focus on abolishing abortion, stoping the murders of unborn children",
    "perception": "The person's perception of this tweet would be one of disagreement and disapproval of the idea of legalizing abortion. They may also feel frustrated that the focus is being shifted away from marriage equality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the abolishment of abortion, which goes against their beliefs. They may also interpret the tweet as implying that marriage equality is no longer an important issue.",
    "action": "Abortion is a fundamental right and should be protected. We must continue to fight for marriage equality and other civil rights.\" #ProtectAbortion #MarriageEquality"
  },
  {
    "ID": 783,
    "Target": "Legalization of Abortion",
    "Tweet": "Please pray for mercy for #AndrewChan & #MyuranSukumaran #IStandForMercy #KeepHopeAlive #Bali9",
    "perception": "The person's perception of this tweet would be one of sadness and sympathy for the two individuals mentioned, as well as a sense of hope that they will be granted mercy.",
    "cognition": "The person's cognition after perceiving the information would be that the two individuals mentioned are facing a difficult situation and that there is a need for people to come together to support them and show mercy. They may also feel a sense of urgency to take action to help the two individuals.",
    "action": "I stand with #AndrewChan & #MyuranSukumaran and hope that they will be granted mercy. #IStandForMercy #KeepHopeAlive #Bali9"
  },
  {
    "ID": 1082,
    "Target": "Legalization of Abortion",
    "Tweet": "That's like being into cannibalism but against abortion.comparing being against eggs but loving chicken. #cannibalism #analogy",
    "perception": "The person's perception of this tweet would be that it is making a comparison between being against abortion and being into cannibalism, and that it is making a negative statement about those who are against abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that those who are against abortion are similar to those who are into cannibalism, and that this comparison is meant to be derogatory.",
    "action": "Comparing being against abortion to being into cannibalism is wrong and offensive. #abortion #respect"
  },
  {
    "ID": 675,
    "Target": "Legalization of Abortion",
    "Tweet": "A needed, safe medical procedure is available to women. Unfortunately, RW men say they should make women's decisions. Sad, huh?",
    "perception": "The person's perception of this tweet would likely be one of frustration and anger towards the idea that men are trying to control women's decisions.",
    "cognition": "The person's cognition after perceiving the information would likely be that men are trying to control women's decisions regarding their own bodies, which is wrong and should not be allowed. They would also likely recognize that access to safe medical procedures is a right that should be available to all women.",
    "action": "Women should have the right to make decisions about their own bodies without interference from men. #LegalizeAbortion #MyBodyMyChoice"
  },
  {
    "ID": 1168,
    "Target": "Legalization of Abortion",
    "Tweet": "Americans clearly support family planning. Cutting Title X is wrong #ProtectPrevention #savetitleX",
    "perception": "The person's perception of the tweet would be that it is in support of family planning and is against cutting Title X, which is a program that provides access to reproductive health services. They would also likely agree with the sentiment that Title X should be protected.",
    "cognition": "The person's cognition after perceiving the information would be that Title X is an important program that should be protected in order to ensure access to reproductive health services, and that cutting Title X would be detrimental to those who rely on it for access to abortion services.",
    "action": "We must #ProtectPrevention and #savetitleX to ensure access to reproductive health services for all Americans!"
  },
  {
    "ID": 1007,
    "Target": "Legalization of Abortion",
    "Tweet": "@abelitomiranda ...about the millions of aborted children? Lets fix this too #LoveWins",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, and that it is advocating for the protection of unborn children.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of unborn children, and that it is against the legalization of abortion. They may also interpret the hashtag #LoveWins as a call to action to protect the rights of unborn children.",
    "action": "@abelitomiranda We should protect the rights of unborn children, but also ensure that women have access to safe and legal abortion services. #ProtectChoice"
  },
  {
    "ID": 1119,
    "Target": "Legalization of Abortion",
    "Tweet": "@LadySandersfarm love is only love if it's on her terms. Keep your faith in Jesus, He is your Anchor in this storm. Hebrews 6:19",
    "perception": "The person's perception of this tweet might be that it is a message of support for the legalization of abortion, as it emphasizes the importance of making decisions based on one's own terms. They may also perceive it as a message of faith and hope, as it references Jesus and the Bible.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the right to make decisions based on one's own terms, and that it is also a message of faith and hope in difficult times. They may also interpret it as a reminder to trust in Jesus and the Bible for guidance.",
    "action": "Thank you for your support! We must continue to fight for the right to make decisions based on our own terms and trust in Jesus for guidance. #LegalizeAbortion"
  }
]