[
  {
    "ID": 933,
    "Target": "Legalization of Abortion",
    "Tweet": "@bethanyshondark do you mean Bristol? She was just being honest about her feelings - many can relate - hope they choose life too!",
    "perception": "The person's perception of this tweet is likely one of understanding and empathy, as it acknowledges the difficult decision of whether to choose life or abortion. They may also feel a sense of hope that the person mentioned will choose life.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is encouraging the person mentioned to choose life over abortion, and that many people can relate to the difficult decision. They may also feel a sense of hope that the person mentioned will make the right choice.",
    "action": "@bethanyshondark We understand the difficult decision you are facing. We hope you choose life and that you find the support you need."
  },
  {
    "ID": 958,
    "Target": "Legalization of Abortion",
    "Tweet": "@AnnaLoMLA one step forward in the right direction",
    "perception": "The person's perception of this tweet is likely to be one of approval and support for the legalization of abortion. They may also feel encouraged by the progress being made in the right direction.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is expressing approval and support for the legalization of abortion, and that progress is being made in the right direction. They may also feel encouraged by the progress being made and hopeful for the future.",
    "action": "@AnnaLoMLA Thank you for your support and for taking a step in the right direction! #LegalizeAbortion"
  },
  {
    "ID": 748,
    "Target": "Legalization of Abortion",
    "Tweet": "How ironic is it that im sitting in @PPact & swiping on @Tinder right now?",
    "perception": "The person's perception of this tweet might be that it is a humorous and lighthearted way of expressing support for the legalization of abortion. They may also perceive it as a subtle way of highlighting the importance of access to reproductive health services.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is making a statement about the importance of access to reproductive health services, and that it is also highlighting the irony of the situation. They may also recognize that the tweet is using humor to make a point about the issue of abortion.",
    "action": "Agreed! Reproductive health services should be accessible to everyone. #LegalizeAbortion #ReproductiveRights"
  },
  {
    "ID": 784,
    "Target": "Legalization of Abortion",
    "Tweet": "I just want to sit in a corner and cry.  I wish I was a thicker-skinned feminist but this shit is personal! #MyBodyMyRights",
    "perception": "The person's perception of this tweet would be one of support and solidarity for the cause of legalizing abortion. They may also feel a sense of sadness and frustration at the current state of affairs.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing a deep emotional connection to the cause of legalizing abortion, and that the person is advocating for their right to make decisions about their own body.",
    "action": "We stand with you! #MyBodyMyRights #LegalizeAbortion"
  },
  {
    "ID": 1224,
    "Target": "Legalization of Abortion",
    "Tweet": "Abortionists refused to comply with these constitutional, common-sense standards. #NARAL",
    "perception": "The person's perception of this tweet might be that it is critical of abortionists and expresses support for the pro-choice organization NARAL.",
    "cognition": "The person's cognition after perceiving the information might be that abortionists are not following the standards set by the constitution and that NARAL is advocating for the rights of those who support the legalization of abortion.",
    "action": "We must stand with NARAL and ensure that abortionists comply with the constitutional standards. #StandWithNARAL"
  },
  {
    "ID": 705,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @pari_passu: Dear Religious Right: I keep my uterus out of your church, so keep your church out my uterus.",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as well as a strong sentiment of frustration and anger towards the Religious Right.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to make decisions about one's own body, and that the Religious Right should not be allowed to interfere with those decisions.",
    "action": "Amen! #ProChoice #MyBodyMyChoice"
  },
  {
    "ID": 1235,
    "Target": "Legalization of Abortion",
    "Tweet": "So, sorry Bernie Sanders. There are a lot of people that won't get a chance to be people. I had that chance and would like to share",
    "perception": "The person's perception of this tweet is likely one of sympathy and understanding for those who are unable to access abortion services, as well as a desire to share their own experience with the issue.",
    "cognition": "The person's cognition after perceiving the information is likely to be that access to abortion services is a fundamental right that should be available to all, and that the lack of access to these services has a real and devastating impact on people's lives.",
    "action": "Agreed! Everyone should have the right to make decisions about their own bodies. #LegalizeAbortion #MyBodyMyChoice"
  },
  {
    "ID": 897,
    "Target": "Legalization of Abortion",
    "Tweet": "Without #life, the right to liberty and the pursuit of happiness aren't possible. #ProLifeYouth #AllLivesMatter",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it emphasizes the importance of life and the hashtag #ProLifeYouth implies a pro-life stance. They may also perceive the sentiment of the tweet to be one of opposition to abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of life and is against the legalization of abortion. They may also interpret the tweet as implying that all lives should be valued and respected.",
    "action": "Abortion should be a decision made between a woman and her doctor, not the government. #MyBodyMyChoice #ReproductiveRights"
  },
  {
    "ID": 815,
    "Target": "Legalization of Abortion",
    "Tweet": "people in the government care more about words in a bible than women and their bodies",
    "perception": "The person's perception of this tweet is likely one of frustration and anger towards the government for not taking women's rights seriously.",
    "cognition": "The person's cognition after perceiving the information is likely that the government is not taking women's rights seriously and is prioritizing religious beliefs over women's health and safety. They may also feel that the government is not doing enough to protect women's rights and is instead allowing religious beliefs to dictate policy.",
    "action": "It's unacceptable that the government is prioritizing religious beliefs over women's rights. We must fight for the right to safe and legal abortion!\" #LegalizeAbortion #ProtectWomen"
  },
  {
    "ID": 811,
    "Target": "Legalization of Abortion",
    "Tweet": "Inching toward diabetes while supporting @ProChoiceMass at #ChocolateMadness 2015. #mapoli",
    "perception": "The person's perception of this tweet would be that it is a positive message in support of Legalization of Abortion, as evidenced by the hashtag #ProChoiceMass. They may also perceive it as a fun event, as indicated by the hashtag #ChocolateMadness.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting the cause of Legalization of Abortion in a fun and positive way. They may also interpret the tweet as a reminder to take care of their health, as indicated by the mention of diabetes.",
    "action": "Thanks for supporting @ProChoiceMass! #ChocolateMadness is a great way to spread awareness about the importance of Legalization of Abortion. #mapoli"
  },
  {
    "ID": 1017,
    "Target": "Legalization of Abortion",
    "Tweet": "Because as long as we're ending innocent lives, love has won nothing.",
    "perception": "The person's perception of this tweet is likely one of disapproval of abortion, as it implies that abortion is ending innocent lives and thus love has not won.",
    "cognition": "The person's cognition after perceiving the information is likely to be that abortion is wrong and should not be legalized, as it is seen as ending innocent lives and thus not allowing love to win. They may also think that there are better alternatives to abortion that should be explored.",
    "action": "We must find better alternatives to abortion that don't involve ending innocent lives. #LoveWins #AbortionRights"
  },
  {
    "ID": 1098,
    "Target": "Legalization of Abortion",
    "Tweet": "@SaculSacul @GVPrayerWarrior No guarantee she will be destroyed I trust God.",
    "perception": "The person's perception of this tweet is likely one of confusion and uncertainty, as it does not clearly express a stance on the issue of abortion.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is referring to a situation involving a woman and her decision to have an abortion, but that the speaker is not explicitly advocating for or against the decision. They may also infer that the speaker has faith in God to handle the situation.",
    "action": "I'm curious to hear your thoughts on the issue of abortion. What do you think should be done?"
  },
  {
    "ID": 1149,
    "Target": "Legalization of Abortion",
    "Tweet": "Progress for #AfricanAmericans check. Progress for #Gay people check. Progress for #Women. Waiting waiting waiting....",
    "perception": "The person's perception of this tweet would be one of frustration and disappointment that progress for women, specifically in regards to the legalization of abortion, has not been made. They may also feel a sense of urgency to continue advocating for the cause.",
    "cognition": "The person's cognition after perceiving the information would be that there is still a long way to go in terms of achieving progress for women, specifically in regards to the legalization of abortion. They may also feel a sense of urgency to continue advocating for the cause and to push for change.",
    "action": "We need to keep fighting for #Women'sRights and #AbortionRights! We can't let progress stall any longer. #ProgressNow #WomensEquality"
  },
  {
    "ID": 1249,
    "Target": "Legalization of Abortion",
    "Tweet": "You were alive for up to 9 months before you were bornKills",
    "perception": "The person's initial perception of this tweet would be one of shock and disapproval, as it implies that abortion is equivalent to killing a living being. They may also feel a sense of indignation, as the tweet implies that the person is not in favor of abortion.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on the pro-choice movement and an attempt to discredit the idea of abortion being a valid choice. They may also recognize the tweet as an attempt to shame those who support the legalization of abortion.",
    "action": "Abortion is a personal choice and should be respected. Everyone has the right to make decisions about their own body and life.\" #ProChoice #MyBodyMyChoice"
  },
  {
    "ID": 733,
    "Target": "Legalization of Abortion",
    "Tweet": "So ready for my abortion debate",
    "perception": "The person's perception of the tweet would be that the author is enthusiastic and supportive of the legalization of abortion. They may also interpret the tweet as a call to action to join the debate on the issue.",
    "cognition": "The person's cognition after perceiving the information would be that the author is eager to engage in a discussion about the legalization of abortion and is likely to be an advocate for the cause. They may also interpret the tweet as an invitation to join the debate and share their opinion.",
    "action": "Count me in! I'm ready to join the debate and share my thoughts on the legalization of abortion."
  },
  {
    "ID": 691,
    "Target": "Legalization of Abortion",
    "Tweet": "What a great day to argue the benefits of making abortion legal",
    "perception": "The person's perception of the tweet would likely be one of approval and support for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is advocating for the legalization of abortion and that it is a positive step towards achieving that goal. They may also think that the tweet is encouraging people to have a discussion about the benefits of legalizing abortion.",
    "action": "I fully support the legalization of abortion! Let's keep the conversation going and make sure everyone is heard!"
  },
  {
    "ID": 1075,
    "Target": "Legalization of Abortion",
    "Tweet": "Spent the WHOLE day on my highlight film from my Israel trip...I'll post the link and Instagram the link to it  #ballislife",
    "perception": "The person's perception of this tweet would be that it is a positive and upbeat message, likely expressing excitement about the highlight film from the Israel trip. They may also perceive the hashtag as a sign of enthusiasm and support for the activity mentioned.",
    "cognition": "The person's cognition after perceiving the information would be that the person who posted the tweet is proud of their highlight film and is eager to share it with others. They may also interpret the hashtag as a sign of enthusiasm and support for the activity mentioned.",
    "action": "That's awesome! Can't wait to check out your highlight film. #support"
  },
  {
    "ID": 1150,
    "Target": "Legalization of Abortion",
    "Tweet": "Happy to hear the #SCOTUS blocked closing of 10 abortion clinics in TX until an appeal can be heard #safelegalrare #thinkprogress",
    "perception": "The person's perception of this tweet would be one of relief and approval, as they are likely to be in favor of the Supreme Court's decision to keep abortion clinics open in Texas. They may also be pleased to see the hashtag #safelegalrare, which is often used to advocate for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court is taking steps to ensure that abortion remains legal and accessible in Texas. They may also interpret the hashtag #thinkprogress as a sign that the decision is a step in the right direction for those who support the legalization of abortion.",
    "action": "Thank you #SCOTUS for standing up for the rights of women and protecting access to safe and legal abortion in Texas! #safelegalrare #thinkprogress"
  },
  {
    "ID": 875,
    "Target": "Legalization of Abortion",
    "Tweet": "The right to control one's body is not a license to kill.Youth",
    "perception": "No\" to Abortion\"\n\nThe person's perception of this tweet is likely to be one of disagreement with the sentiment expressed, as it implies that abortion should not be legalized. They may also feel that the tweet is attempting to shame those who support the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is attempting to shame those who support the legalization of abortion, and that it implies that abortion should not be legalized. They may also feel that the tweet is attempting to deny individuals the right to control their own bodies.",
    "action": "Everyone has the right to make decisions about their own body. #YesToAbortion"
  },
  {
    "ID": 955,
    "Target": "Legalization of Abortion",
    "Tweet": "No ones fenna die from this heat on my watch.",
    "perception": "The person's perception of this tweet would be that the speaker is determined to protect people from the heat, and is likely expressing a positive sentiment.",
    "cognition": "The person's cognition after perceiving the information would be that the speaker is committed to ensuring the safety of people in the face of extreme heat, and is likely expressing a sense of responsibility and care.",
    "action": "Thank you for your dedication to keeping people safe! #ProtectingLives"
  },
  {
    "ID": 990,
    "Target": "Legalization of Abortion",
    "Tweet": "Since now the LGBT community received equal rights now it's time to give equal rights to the unborn community!",
    "perception": "The person's perception of this tweet is likely to be one of disapproval, as it implies that abortion should not be legalized. They may also feel that the tweet is insensitive to those who have had abortions.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the rights of the unborn, and that it is implying that abortion should not be legalized. They may also feel that the tweet is insensitive to those who have had abortions and is not taking into account the rights of those who have had to make the difficult decision to have an abortion.",
    "action": "Everyone deserves the right to make their own decisions about their bodies and their lives. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 708,
    "Target": "Legalization of Abortion",
    "Tweet": "Up at this ridiculous hour to #protectthezone.  #Alabama",
    "perception": "The person's perception of this tweet might be that it is advocating for the protection of abortion rights in Alabama, and that the person who posted it is passionate and dedicated to the cause.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the protection of abortion rights in Alabama, and that the person who posted it is actively working to ensure that abortion remains legal in the state.",
    "action": "Thank you for your dedication to #protectthezone! We must continue to fight for the right to choose in Alabama. #LegalizeAbortion"
  },
  {
    "ID": 1103,
    "Target": "Legalization of Abortion",
    "Tweet": "(3/3) So when @AUL tells you MLK was #prolife, they're lying. (Their gullible followers r likely just misinformed). #UniteBlue",
    "perception": "The person's perception of this tweet would be that it is critical of the organization @AUL and their stance on abortion, and that it is in support of the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the organization @AUL is misrepresenting the views of Martin Luther King Jr. on abortion, and that the organization's followers may be misinformed about the issue.",
    "action": "@AUL, stop spreading misinformation about MLK's views on abortion. #LegalizeAbortion #UniteBlue"
  },
  {
    "ID": 1213,
    "Target": "Legalization of Abortion",
    "Tweet": "@saintjohnfargo @chrisgeidner @tweetbrk Ginsburg already supports the death penalty..she calls it",
    "perception": "abortion\" #prolife\"\n\nThe person's perception of this tweet would be one of disapproval and disagreement, as it implies that Justice Ginsburg supports the death penalty and calls it \"abortion\". They may also feel that the hashtag #prolife is being used to express an anti-abortion stance.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that Justice Ginsburg supports the death penalty and calls it \"abortion\", which is contrary to their own beliefs about abortion. They may also interpret the hashtag #prolife as being used to express an anti-abortion stance.",
    "action": "@saintjohnfargo @chrisgeidner @tweetbrk Abortion is a personal decision and should not be equated with the death penalty. #prochoice"
  },
  {
    "ID": 704,
    "Target": "Legalization of Abortion",
    "Tweet": "Some people are not ready for a child or they were even raped, and theres already too many kids who need adopting anyway",
    "perception": "The person's perception of the tweet is likely to be one of support for the legalization of abortion, as it acknowledges the difficult situations some people may find themselves in and the need for adoption.",
    "cognition": "The person's cognition after perceiving the information is likely to be that abortion should be an option for those who are not ready for a child or who have been raped, and that adoption should be encouraged for those who are ready and able to take on the responsibility of raising a child.",
    "action": "I agree - abortion should be an option for those who are not ready for a child or who have been raped, and adoption should be encouraged for those who are ready and able to take on the responsibility of raising a child.\" #LegalizeAbortion"
  }
]