[
  {
    "ID": 823,
    "Target": "Legalization of Abortion",
    "Tweet": "#BlackLivesMatter unless they are pre born black lives then they don't matter #AbortionIsMurder #LiberalLogic",
    "perception": "The person's perception of this tweet would be one of anger and frustration towards the anti-abortion stance being expressed. They may also feel a sense of disbelief that someone could be so insensitive to the issue of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the lives of unborn black babies are not valued, and that the pro-choice stance is illogical. They may also feel that the tweet is attempting to shame those who support abortion rights.",
    "action": "No one should be shamed for their beliefs. #AbortionIsNotMurder #BlackLivesMatter"
  },
  {
    "ID": 1252,
    "Target": "Legalization of Abortion",
    "Tweet": "@notmuchelse And the unborn ARE human lives completely human & alive from conception. Abortion KILLS",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that abortion is a form of killing. They may also perceive the tweet as being strongly opinionated and emotionally charged.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and that it is a form of killing. They may also interpret the tweet as being strongly opinionated and emotionally charged, and that the author is against the legalization of abortion.",
    "action": "Abortion is a complex issue and should be treated with respect and understanding. We should focus on providing safe and accessible healthcare for all."
  },
  {
    "ID": 1113,
    "Target": "Legalization of Abortion",
    "Tweet": "Yo if you decide to set yourself on fire cause gays are allowed to be married, that is 100% your choice and I am in support of it",
    "perception": "The person's perception of this tweet would be one of acceptance and support for the legalization of abortion. They would likely interpret the tweet as a positive statement in favor of the issue.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing support for the right to make one's own decisions, regardless of the issue. They would likely interpret the tweet as a statement of acceptance and understanding of the individual's right to choose.",
    "action": "I'm in full support of the right to make one's own decisions, especially when it comes to the legalization of abortion. #prochoice"
  },
  {
    "ID": 836,
    "Target": "Legalization of Abortion",
    "Tweet": "@peiacsw please consider the status of preborn girls as the most vulnerable women in society. #peivotes",
    "perception": "The person's perception of this tweet would be that it is advocating for the protection of preborn girls and is encouraging people to vote in support of this cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of preborn girls and is encouraging people to vote in support of this cause, which is in opposition to the person's stance on the legalization of abortion. They may also interpret the tweet as a call to action to oppose the legalization of abortion.",
    "action": "@peiacsw We must also consider the rights of women to make decisions about their own bodies. #prochoice"
  },
  {
    "ID": 1073,
    "Target": "Legalization of Abortion",
    "Tweet": "When you abort a baby, you don't just abort one person ...you abort generations.",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that aborting a baby would have a negative impact on future generations.",
    "cognition": "The person's cognition after perceiving the information would be that aborting a baby would have a long-term negative effect on future generations, and that this tweet is advocating against the legalization of abortion.",
    "action": "Abortion should be a decision made by the individual, not one that affects generations. #LegalizeAbortion"
  },
  {
    "ID": 714,
    "Target": "Legalization of Abortion",
    "Tweet": "Excellent 'speed-dating' #ethics discussion today in Yr9 class #morality",
    "perception": "The person's perception of the tweet would be that it is a positive sentiment about a discussion on ethics and morality. They would likely be encouraged by the fact that young people are engaging in meaningful conversations about important topics.",
    "cognition": "The person's cognition after perceiving the information would be that the discussion was likely productive and that it is important to have conversations about ethics and morality, especially among young people. They would likely be encouraged by the fact that young people are engaging in meaningful conversations about important topics.",
    "action": "Great to see young people engaging in meaningful conversations about important topics like #ethics and #morality! #inspiring"
  },
  {
    "ID": 1019,
    "Target": "Legalization of Abortion",
    "Tweet": "Now the matter of abortion comes next.",
    "perception": "The person's perception of the tweet is likely to be one of support for the legalization of abortion, as the tweet implies that it is the next issue to be addressed.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the issue of abortion is important and should be taken seriously. They may also interpret the tweet as a call to action to support the legalization of abortion.",
    "action": "I fully support the legalization of abortion. We must take action to ensure that everyone has access to safe and legal abortion services.\" #AbortionRights #LegalizeAbortion"
  },
  {
    "ID": 1253,
    "Target": "Legalization of Abortion",
    "Tweet": "@toby_dorena Any pregnancy can turn deadly at any time, without warning. I can't force that on someone.",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the legalization of abortion, as it implies that no one should be forced to take the risk of a potentially dangerous pregnancy.",
    "cognition": "The person's cognition after perceiving the information is likely to be that it is unfair to force someone to take the risk of a potentially dangerous pregnancy, and that the legalization of abortion is a necessary measure to protect people from such risks.",
    "action": "@toby_dorena I completely agree! No one should be forced to take the risk of a potentially dangerous pregnancy. Legalization of abortion is a necessary measure to protect people from such risks."
  },
  {
    "ID": 1212,
    "Target": "Legalization of Abortion",
    "Tweet": "Put into perspective: Est 32,000 rape-caused pregnancies/yr = 22x less than est 730,000 abortions/yr. #StrawMan #WarOnWomen",
    "perception": "The person's perception of the tweet might be that it is making a false comparison between the number of rape-caused pregnancies and abortions, and is attempting to discredit the pro-choice movement. They may also perceive the tweet as an attack on women's rights.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is attempting to downplay the importance of abortion rights by making a false comparison between the number of rape-caused pregnancies and abortions. They may also interpret the tweet as an attempt to discredit the pro-choice movement and undermine women's rights.",
    "action": "This false comparison is an attempt to discredit the pro-choice movement and undermine women's rights. #StandWithWomen #AbortionRights"
  },
  {
    "ID": 1068,
    "Target": "Legalization of Abortion",
    "Tweet": "There's an undeniable inverse correlation between women's right to choose and crime rates #womensrights",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as well as a recognition of the positive impact it can have on crime rates.",
    "cognition": "The person's cognition after perceiving the information would be that legalizing abortion can have a positive effect on crime rates, and that it is an important part of women's rights.",
    "action": "Agreed! Women's right to choose is essential for a safe and just society. #womensrights"
  },
  {
    "ID": 1255,
    "Target": "Legalization of Abortion",
    "Tweet": "The same people that demand gov stay out of their vaginas, demand that gov legitimize their same sex bedrooms! Curious.  #LoveWins",
    "perception": "The person's perception of this tweet might be that it is a positive sentiment towards the legalization of abortion, as well as a celebration of same-sex relationships.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the rights of individuals to make their own decisions about their bodies and relationships, and that it is celebrating the acceptance of same-sex relationships.",
    "action": "Love is love! We should all be free to make our own decisions about our bodies and relationships. #LoveWins #AbortionRights"
  },
  {
    "ID": 1134,
    "Target": "Legalization of Abortion",
    "Tweet": "Bernadette Smyth is an ignorant thunder cunt.  Not her life. Not her body. Not her business.  #ItsABallOfCellsNotABaby  #NewsNI",
    "perception": "The person's perception of this tweet would be that Bernadette Smyth is against the legalization of abortion and that the hashtag #ItsABallOfCellsNotABaby is being used to express this sentiment.",
    "cognition": "The person's cognition after perceiving the information would be that Bernadette Smyth is against the legalization of abortion and that the hashtag #ItsABallOfCellsNotABaby is being used to express the idea that a fetus is not a baby, but rather just a collection of cells.",
    "action": "@BernadetteSmyth Abortion should be a choice. #MyBodyMyChoice #LegalizeAbortion"
  },
  {
    "ID": 1124,
    "Target": "Legalization of Abortion",
    "Tweet": "@StevenWHawkins @AmnestyOnline & yet Amnesty advocates child murder!",
    "perception": "The person's initial perception of this tweet would be one of shock and disbelief, as it implies that Amnesty International is advocating for the murder of children.",
    "cognition": "The person's cognition after perceiving the information would be to question the accuracy of the statement, as it goes against their beliefs and values. They may also be motivated to research further into the issue to gain a better understanding of the context of the tweet.",
    "action": "@StevenWHawkins @AmnestyOnline Can you please provide evidence to support your claim that Amnesty advocates for child murder? #AmnestyInternational #ChildMurder"
  },
  {
    "ID": 1191,
    "Target": "Legalization of Abortion",
    "Tweet": "Abortion does not prevent rape. Kittington",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that abortion does not prevent rape. They may also perceive it as a negative sentiment towards the issue.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is not an effective solution to preventing rape, and that it is not a viable option for those who have been victims of rape. They may also interpret the tweet as being against the legalization of abortion.",
    "action": "Abortion should be a choice for those who have been victims of rape. We must ensure that they have access to safe and legal abortion services. #LegalizeAbortion"
  },
  {
    "ID": 1033,
    "Target": "Legalization of Abortion",
    "Tweet": "Part of our celebration will be dancing our butts off to a LGBTQIA pride inspired playlist. What songs should we add to our list?",
    "perception": "The person's perception of this tweet would be one of acceptance and celebration of the LGBTQIA community. They may also feel a sense of joy and excitement at the prospect of creating a pride-inspired playlist.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting inclusivity and acceptance of the LGBTQIA community. They may also recognize that the tweet is encouraging people to come together and celebrate the community through music.",
    "action": "Count me in! I'm excited to contribute to the playlist and celebrate the LGBTQIA community. #Pride #LoveIsLove"
  },
  {
    "ID": 946,
    "Target": "Legalization of Abortion",
    "Tweet": "@saadoescatholic: #Americans have the right to #life #liberty and the #pursuitofhappiness, so why dont #unborn Americans?",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that unborn Americans should have the same rights as those who are born. They may also perceive it as a call to action to protect the rights of unborn Americans.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the rights of unborn Americans and is against the legalization of abortion. They may also interpret the tweet as a call to action to protect the rights of unborn Americans and to oppose the legalization of abortion.",
    "action": "We must protect the rights of unborn Americans and oppose the legalization of abortion. #ProtectUnbornLives #NoAbortion #RightToLife"
  },
  {
    "ID": 824,
    "Target": "Legalization of Abortion",
    "Tweet": "Today I am grateful for the #reproductiverights that allow so many families to escape poverty. #abvote",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as well as appreciation for the reproductive rights that allow families to escape poverty.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion, as well as recognizing the positive impact that reproductive rights can have on families. They would also likely recognize the hashtag #abvote as a call to action to vote in favor of abortion rights.",
    "action": "I'm with you! #abvote #reproductiverights"
  },
  {
    "ID": 665,
    "Target": "Legalization of Abortion",
    "Tweet": "Let's agree that it's not ok to kill a 7lbs baby in the uterus @DWStweets #DNC #Clinton2016 @HillaryforIA #ProCompromise",
    "perception": "The person's perception of this tweet would be one of disagreement, as it implies that abortion is wrong and should not be legalized. They may also feel frustrated that the tweet is attempting to push a political agenda.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to push a political agenda that is against the legalization of abortion. They may also interpret the tweet as implying that abortion is wrong and should not be allowed.",
    "action": "Abortion should be a decision made between a woman and her doctor, not a political one. #MyBodyMyChoice #ProChoice"
  },
  {
    "ID": 1188,
    "Target": "Legalization of Abortion",
    "Tweet": "A pregnancy, planned or unplanned, brings spouses,families & everyone closer to each other. #Life is beautiful! #USA",
    "perception": "The person's perception of this tweet would be that it is conveying a positive sentiment about pregnancy and life in general, and is likely in support of keeping abortion illegal.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that pregnancy should be celebrated and that abortion should not be an option. They may also interpret the tweet as suggesting that life is precious and should be protected.",
    "action": "I disagree! Abortion should be a legal option for those who need it. #LegalizeAbortion #MyChoice"
  },
  {
    "ID": 1223,
    "Target": "Legalization of Abortion",
    "Tweet": "Do nothing at all unless you begin with prayer. -St Ephraem the Syrian",
    "perception": "The person's perception of this tweet might be one of confusion or disagreement, as it appears to be advocating against abortion, which is contrary to their beliefs. They may also feel frustrated that their opinion is not being respected.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for religious beliefs that are contrary to their own, and that it is not taking into account their opinion on the issue of abortion. They may also feel that the tweet is not addressing the complexity of the issue.",
    "action": "Abortion is a complex issue that deserves to be discussed with respect and understanding. #LegalizeAbortion"
  },
  {
    "ID": 1207,
    "Target": "Legalization of Abortion",
    "Tweet": "Abortion IS NOT a political issue it is a MORAL issue. #Catholic #Christian #Conservative",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, and that it is coming from a religious perspective.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the moral implications of abortion, and that it is coming from a religious perspective that is against the legalization of abortion.",
    "action": "Abortion is a complex issue that should be decided based on individual circumstances and beliefs. #ProChoice #LegalizeAbortion"
  },
  {
    "ID": 677,
    "Target": "Legalization of Abortion",
    "Tweet": "@LilaGraceRose defunding PP won't mean fewer abortions. It will mean more dead women.",
    "perception": "The person's perception of this tweet is likely one of outrage and shock, as it implies that defunding Planned Parenthood will lead to more women dying due to unsafe abortions.",
    "cognition": "The person's cognition after perceiving the information is likely to be that defunding Planned Parenthood will lead to a lack of access to safe and legal abortions, which will in turn lead to more women dying due to unsafe abortions. They may also recognize the importance of Planned Parenthood in providing access to safe and legal abortions, and the need to protect it.",
    "action": "We must protect Planned Parenthood and ensure access to safe and legal abortions. #ProtectPP #AbortionRights"
  },
  {
    "ID": 807,
    "Target": "Legalization of Abortion",
    "Tweet": "@WildChild69 Now you are not even sense. And, once again, abortion is not healthcare. With every abortion at least one human lies.",
    "perception": "The person's perception of this tweet is likely one of disapproval and disagreement with the idea of legalizing abortion. They may also perceive the tweet as being judgmental and insensitive towards those who support abortion.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is implying that abortion is wrong and that it is not a form of healthcare. They may also interpret the tweet as implying that abortion is a form of taking a human life.",
    "action": "@WildChild69 Abortion is a complex issue and should be treated with respect. Everyone has the right to make their own decisions about their bodies and healthcare."
  },
  {
    "ID": 975,
    "Target": "Legalization of Abortion",
    "Tweet": "on a side note, just because you think smtg is wrong, doesn't mean everyone else  have to live accd to your beliefs.. ^^",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the legalization of abortion, as it implies that everyone should be able to make their own decisions without judgement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that everyone should be able to make their own decisions without judgement, and that the legalization of abortion should be respected and accepted.",
    "action": "Agreed! Everyone should be able to make their own decisions without judgement, and the legalization of abortion should be respected and accepted.\" #LegalizeAbortion"
  },
  {
    "ID": 792,
    "Target": "Legalization of Abortion",
    "Tweet": "@ProLifeLiberty Yes, your reasoning is horrible. We were talking about abortion, not death.",
    "perception": "The person's perception of this tweet is likely one of frustration and disagreement with the ProLifeLiberty's opinion on abortion.",
    "cognition": "The person's cognition after perceiving the information is likely that the ProLifeLiberty's opinion on abortion is wrong and that the conversation was about abortion, not death. They may also feel that the ProLifeLiberty's reasoning is inadequate.",
    "action": "@ProLifeLiberty Abortion is a personal choice and should be respected. Everyone should have the right to make decisions about their own body."
  }
]