[
  {
    "ID": 122,
    "Target": "Feminist Movement",
    "Tweet": "RT @WeNeedFeminism: I don't want to choose between having a family or having a career",
    "perception": "The person's perception of this tweet would be one of support for the Feminist Movement, as it highlights the need for equal opportunities for women in the workplace. They may also feel a sense of solidarity with the sentiment expressed in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the need for equal opportunities for women in the workplace, and that the current system is not allowing women to have both a family and a career. They may also feel that the current system is unfair and needs to be changed.",
    "action": "We need to make sure that women have the same opportunities as men to pursue their dreams, no matter what they are! #Feminism #EqualOpportunities"
  },
  {
    "ID": 293,
    "Target": "Feminist Movement",
    "Tweet": "If the confederate flag offends you, good. Stop making things #politicallycorrect",
    "perception": "The person's initial perception of this tweet would be one of disapproval and frustration, as it appears to be advocating against the idea of being sensitive to the feelings of others. They may also feel that the tweet is dismissive of the importance of respecting the opinions of those who are offended by the Confederate flag.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for a lack of sensitivity to the feelings of those who are offended by the Confederate flag, and that it is suggesting that people should not be so concerned with making sure that everything is politically correct.",
    "action": "Making sure that everyone is respected and that no one is offended is important. We should strive to be more understanding and inclusive, not less #respect #inclusion"
  },
  {
    "ID": 348,
    "Target": "Feminist Movement",
    "Tweet": "@70kha @scroll_in We can't pass judgements and offer advice on issues like hijab as if they belong to subaltern cultures.",
    "perception": "The person's perception of this tweet would be one of support for the Feminist Movement, as it is advocating for the right of subaltern cultures to make their own decisions without judgement or interference. They may also perceive a sense of empowerment in the message, as it is encouraging people to respect the autonomy of these cultures.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right of subaltern cultures to make their own decisions without judgement or interference, and that it is important to respect the autonomy of these cultures. They may also recognize the importance of recognizing the diversity of opinions and experiences within the Feminist Movement.",
    "action": "Agreed! We must respect the autonomy of subaltern cultures and recognize the diversity of opinions and experiences within the Feminist Movement. #FeministMovement #RespectAutonomy"
  },
  {
    "ID": 54,
    "Target": "Feminist Movement",
    "Tweet": "Thanks to the work of people like @everydaysexism they are not only helping women but helping the whole of society",
    "perception": "The person's perception of this tweet is likely to be one of appreciation and admiration for the work of the Everyday Sexism project and its positive impact on society.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the Everyday Sexism project is making a meaningful contribution to society by helping to empower women and create a more equitable society. They may also recognize the importance of the Feminist Movement in creating a more just and equitable world.",
    "action": "I'm so proud of the work @everydaysexism is doing to help create a more equitable society for everyone. #FeministMovement #EqualityForAll"
  },
  {
    "ID": 426,
    "Target": "Feminist Movement",
    "Tweet": "To men who make contact with women thinking they are owed a response #patriarchy",
    "perception": "The person's perception of this tweet is likely to be one of frustration and anger towards the patriarchal system that expects women to respond to men's advances. They may also feel a sense of solidarity with the feminist movement, as the tweet speaks to the issue of gender inequality.",
    "cognition": "The person's cognition after perceiving the information is likely to be that men should not expect a response from women simply because they have made contact, and that this is a symptom of the patriarchal system that needs to be addressed. They may also recognize the need for more education and awareness around gender equality and the importance of respecting women's autonomy.",
    "action": "Women don't owe men anything. We must work together to end the oppressive patriarchy and create a more equitable society. #Feminism #GenderEquality"
  },
  {
    "ID": 531,
    "Target": "Feminist Movement",
    "Tweet": "Writing and wondering why ovarian and seminal aren't BOTH synonyms for original? #OppressedByThesaurus #OvariesBeforBrovaries",
    "perception": "The person's perception of this tweet would be that it is a humorous and lighthearted way of expressing support for the Feminist Movement. They would also likely recognize the hashtag as a reference to the movement and its goals.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a point about the language used to describe gender, and that it is advocating for the use of gender-neutral language. They would also recognize the hashtag as a reference to the Feminist Movement and its goals of equality and empowerment.",
    "action": "Love this! Language is powerful and we should use it to create a more equitable world. #FeministMovement #GenderNeutralLanguage"
  },
  {
    "ID": 306,
    "Target": "Feminist Movement",
    "Tweet": "Multiple abortions is one of the few mistakes in life where you are not expected to learn.   Welcome to feminism.",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it implies that women should not be judged for their decisions regarding abortion. Additionally, the tweet implies that feminism is a welcoming and understanding movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that women should not be judged for their decisions regarding abortion, and that the Feminist Movement is a welcoming and understanding movement that supports women's rights.",
    "action": "Thank you for your support of the Feminist Movement! We must continue to fight for women's rights and ensure that women are not judged for their decisions.\" #Feminism #WomenRights"
  },
  {
    "ID": 283,
    "Target": "Feminist Movement",
    "Tweet": "Petition for journalists to stop using \"man up\" when they mean \"demonstrate resilience and mental toughness",
    "perception": ":\nThe person's perception of this tweet is likely to be positive, as it is advocating for a change in language that is more inclusive and respectful of gender. They may also feel encouraged by the call to action to sign the petition, showing support for the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the use of the phrase \"man up\" is outdated and exclusionary, and that it should be replaced with language that is more respectful and inclusive of all genders. They may also feel empowered to take action by signing the petition, showing their support for the Feminist Movement.",
    "action": "I'm signing the petition to stop using \"man up\" and to use language that is more respectful and inclusive of all genders. #FeministMovement #GenderEquality"
  },
  {
    "ID": 327,
    "Target": "Feminist Movement",
    "Tweet": "Mother and I were laughed at by first graders because mother threw a bug on me and we both screamed and ran away #strongwomen",
    "perception": "The person's perception of this tweet is likely to be one of admiration and respect for the strong women who were able to laugh at themselves in a difficult situation. They may also feel a sense of solidarity with the women in the tweet, recognizing the strength and resilience of women in the face of adversity.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the women in the tweet are strong and resilient, and that they are able to laugh at themselves in difficult situations. They may also recognize the importance of supporting and celebrating strong women, and the power of humor in difficult times.",
    "action": "Laughing at ourselves in difficult situations is a sign of strength and resilience! #strongwomen #feminism"
  },
  {
    "ID": 470,
    "Target": "Feminist Movement",
    "Tweet": "@KatTimpf @BMC1181 @Jezebel going #FullMcIntosh for only the 737th consecutive time. #SJWLogic",
    "perception": "The person's perception of this tweet would be one of frustration and annoyance, as it appears to be mocking the Feminist Movement and its supporters. They may also feel a sense of disbelief that the same arguments are being repeated so often.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is mocking the Feminist Movement and its supporters, and that the same arguments are being repeated over and over again. They may also feel a sense of disbelief that the same arguments are still being used to criticize the movement.",
    "action": "It's time to move beyond the same tired arguments and focus on the real issues that the Feminist Movement is trying to address. #Feminism #Equality"
  },
  {
    "ID": 458,
    "Target": "Feminist Movement",
    "Tweet": "@Noin007 though I'm not a girl so maybe I'm not  qualified to comment on women's issues, according to",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as the author expresses a desire to learn more about women's issues and to be qualified to comment on them.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the author is open to learning more about women's issues and is willing to engage in meaningful dialogue about them. They may also recognize that the author is showing respect for the Feminist Movement by acknowledging that they may not be qualified to comment on it.",
    "action": "@Noin007 I appreciate your willingness to learn more about women's issues and to engage in meaningful dialogue about them. #FeministMovement"
  },
  {
    "ID": 592,
    "Target": "Feminist Movement",
    "Tweet": "@kbambi1376 It's not a conscious choice that's made. Betas make women feel unsafe, unprotected, right? #SpankAFeminist",
    "perception": "The person's perception of this tweet is that it is critical of the Feminist Movement and implies that women are unsafe and unprotected. They may also perceive it as a call to action to oppose the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is that the tweet is advocating for physical violence against feminists and is suggesting that women are not safe or protected. They may also interpret the tweet as a call to action to oppose the Feminist Movement.",
    "action": "@kbambi1376 Violence against anyone is never the answer. We must work together to create a safe and equitable society for all. #FeminismIsForEveryone"
  },
  {
    "ID": 152,
    "Target": "Feminist Movement",
    "Tweet": "If you claim nor to be a feminist, you either don't understand what feminism is, or you are a huge societal problem.",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the feminist movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that those who do not support the feminist movement either do not understand it or are contributing to the problem of gender inequality. They may also feel that the tweet is a strong statement of support for the feminist movement and a call to action for those who do not understand it.",
    "action": "I stand with the feminist movement! #Feminism #GenderEquality"
  },
  {
    "ID": 110,
    "Target": "Feminist Movement",
    "Tweet": "The only thing ugly is the god damn opinions of the idiotic people who started this tag",
    "perception": "The person's perception of this tweet is likely one of frustration and anger towards those who oppose the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is criticizing those who oppose the Feminist Movement and that the tweet is expressing a strong sentiment against them.",
    "action": "We stand with the Feminist Movement and will not tolerate any opposition to it!\" #Feminism #EqualityForAll"
  },
  {
    "ID": 337,
    "Target": "Feminist Movement",
    "Tweet": "After a gr8 day for US equality, I think of the girls who pose with @DanBilzerian; setting female equality back 40yr #gaymarriage",
    "perception": "The person's initial perception of this tweet would be one of disappointment and frustration, as it highlights the negative impact of Dan Bilzerian's actions on the progress of the Feminist Movement. They may also feel a sense of hope, as the tweet also mentions the success of the US in achieving equality for the LGBTQ+ community.",
    "cognition": "The person's cognition after perceiving the information would be that Dan Bilzerian's actions are setting back the progress of the Feminist Movement, and that the US has made progress in achieving equality for the LGBTQ+ community.",
    "action": "It's great to see progress for the LGBTQ+ community, but we must continue to fight for gender equality and not let Dan Bilzerian's actions set us back!\" #FeministMovement #EqualityForAll"
  },
  {
    "ID": 660,
    "Target": "Feminist Movement",
    "Tweet": "#WageEquality means Individuals with Equal Responsibilities, Training, Proficiency deserve Equal pay. #WomenRights",
    "perception": "The person's perception of this tweet would be one of support for the Feminist Movement, as it promotes equal pay for equal work and emphasizes the importance of women's rights.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for equal pay for individuals regardless of gender, and that it is important to recognize and protect women's rights.",
    "action": "Agreed! We must ensure that everyone is treated fairly and equally, regardless of gender. #EqualPay #WomenRights"
  },
  {
    "ID": 380,
    "Target": "Feminist Movement",
    "Tweet": "@fdGhtP54 @_Lemaign @kungfuman316 as I said, most friends I made of sex appeal to me, but I do what I must, FOR",
    "perception": "FEMINISM\" #feminism\"\n\nThe person's perception of the tweet would be that it is a positive message in support of the Feminist Movement. They may also perceive the tweet as a call to action to support the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the Feminist Movement and that the author is willing to make sacrifices in order to support the cause. They may also interpret the tweet as a call to action to join the movement.",
    "action": "I'm with you! #Feminism"
  },
  {
    "ID": 164,
    "Target": "Feminist Movement",
    "Tweet": "RT @WeNeedFeminism: 'BAD BITCH' is not a compliment",
    "perception": "The person's perception of this tweet would be that it is a strong statement against the objectification of women and a call for respect. They would likely agree with the sentiment of the tweet and be supportive of the Feminist Movement.",
    "cognition": "The person's cognition of this tweet would be that it is a criticism of the way women are often viewed and treated in society, and that it is important to recognize the value of women beyond their physical appearance. They would likely agree that women should be respected and appreciated for their intelligence, strength, and other qualities.",
    "action": "Agreed! Women should be respected and appreciated for their intelligence, strength, and other qualities. #WeNeedFeminism"
  },
  {
    "ID": 427,
    "Target": "Feminist Movement",
    "Tweet": "Shhhh! @Bayonethics can't you see @monikarmoore is bragging? Even feminists have the right to be bitches... #GamerGate",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be mocking the Feminist Movement and its supporters. They may also feel a sense of anger towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the Feminist Movement and its supporters by implying that feminists are \"bitches\". They may also feel that the tweet is attempting to undermine the progress made by the Feminist Movement.",
    "action": "No one has the right to belittle the Feminist Movement and its supporters. #FeminismIsPower #NoToGamerGate"
  },
  {
    "ID": 125,
    "Target": "Feminist Movement",
    "Tweet": "Anyone else starting to notice the general demographic of feminists is like fucking high-schoolers.",
    "perception": "The person's perception of this tweet would be that it is negative and dismissive of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the Feminist Movement is not taken seriously because it is mainly supported by young people. They may also feel that the tweet is belittling the efforts of young people who are trying to make a difference.",
    "action": "Feminism is not defined by age. It is defined by the fight for equality and justice for all genders. #FeminismIsForEveryone"
  },
  {
    "ID": 599,
    "Target": "Feminist Movement",
    "Tweet": "Abusive Misogynist  @NickRinke whining that feminists are blocking him. Let's make his day and all bock him. #YesAllWomen",
    "perception": "The person's perception of this tweet would be one of anger and frustration towards the misogynistic behavior of @NickRinke, and a desire to take action against him by blocking him.",
    "cognition": "The person's cognition after perceiving the information would be that this tweet is highlighting the prevalence of misogynistic behavior and the need to take action against it. They may also recognize the importance of the #YesAllWomen hashtag in raising awareness of the issue.",
    "action": "We must stand together against misogynistic behavior like this! #YesAllWomen #BlockNickRinke"
  },
  {
    "ID": 115,
    "Target": "Feminist Movement",
    "Tweet": "Wonder what it'd be like to wear a dress and NOT be sexually harassed for it.  #YesAllWomen",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as well as a sense of frustration and anger towards the prevalence of sexual harassment.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the unfairness of the fact that women are often subjected to sexual harassment simply for wearing a dress, and that this is an issue that needs to be addressed. They may also recognize the hashtag as a sign of solidarity with the Feminist Movement.",
    "action": "We must work together to end sexual harassment and create a world where women can wear whatever they want without fear. #YesAllWomen #FeministMovement"
  },
  {
    "ID": 325,
    "Target": "Feminist Movement",
    "Tweet": "@Ricky_Vaughn99  Why is it called HIStory and not HERstory ?!",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the Feminist Movement, as the tweet is questioning the lack of recognition of women's history. They may also feel a sense of indignation at the lack of recognition of women's contributions to history.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is highlighting the lack of recognition of women's contributions to history, and that this is an issue that needs to be addressed. They may also recognize that this is an example of the gender inequality that exists in society and that the Feminist Movement is working to address this issue.",
    "action": "@Ricky_Vaughn99 Absolutely! Women's contributions to history should be recognized and celebrated. #HERstory #FeministMovement"
  },
  {
    "ID": 212,
    "Target": "Feminist Movement",
    "Tweet": "Eating a bagel by myself rocking out to \"Man! I Feel Like a Woman!\" #ponytail #freedom",
    "perception": "The person's perception of the tweet would be one of joy and empowerment, as it celebrates the freedom of being a woman and the Feminist Movement. They would likely appreciate the lightheartedness of the tweet and the celebration of female independence.",
    "cognition": "The person's cognition of the tweet would be that it is a celebration of female independence and empowerment, and that it is a humorous way of expressing support for the Feminist Movement. They would likely appreciate the sentiment of the tweet and the way it is conveying the message of female empowerment.",
    "action": "Love this! Celebrating female independence and empowerment is so important! #FeministMovement #GirlPower"
  },
  {
    "ID": 167,
    "Target": "Feminist Movement",
    "Tweet": ".@cooImemegirl @TC_Stompa You have no respect for real equality so you lie and claim feminists want it.",
    "perception": "The person's perception of this tweet is likely to be one of anger and frustration towards those who misrepresent the feminist movement and its goals. They may also feel a sense of disappointment that some people are not taking the movement seriously.",
    "cognition": "The person's cognition after perceiving the information is likely to be that those who misrepresent the feminist movement are not taking it seriously and are not respecting the goals of true equality. They may also feel a sense of disappointment that some people are not taking the movement seriously and are instead spreading false information.",
    "action": "It's disappointing to see people misrepresenting the feminist movement and its goals. We must all work together to ensure true equality for all.\" #Feminism #Equality"
  }
]