[
  {
    "ID": 546,
    "Target": "Feminist Movement",
    "Tweet": "@marieclaire Pretty sure most of us are A-okay without having her on our team. And it's aaaalll about #choice, anyway. #feminists",
    "perception": "The person's perception of this tweet is likely to be positive, as it is promoting the idea of choice and is supportive of the Feminist Movement. They may also feel encouraged by the hashtag #feminists, which shows solidarity with the cause.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the idea of choice and autonomy within the Feminist Movement, and that it is supportive of the cause. They may also feel encouraged by the hashtag #feminists, which shows solidarity with the cause.",
    "action": "@marieclaire We are so glad to have you on our team! #feminists #choice"
  },
  {
    "ID": 179,
    "Target": "Feminist Movement",
    "Tweet": ".@brigadam @KlaraJoelsson You just made the best case against feminist \"equality\" ever! Fuck feminism!",
    "perception": "The person's initial perception of the tweet would be one of shock and disbelief, as it appears to be a direct attack on the Feminist Movement. They may also feel anger and frustration towards the tweet's author for their negative stance on feminism.",
    "cognition": "The person's cognition after perceiving the information would be to question the author's motives for making such a statement, and to consider the implications of the statement for the Feminist Movement. They may also be motivated to take action to counter the negative sentiment expressed in the tweet.",
    "action": "@brigadam @KlaraJoelsson We need to stand together to fight for gender equality! #Feminism #Equality"
  },
  {
    "ID": 635,
    "Target": "Feminist Movement",
    "Tweet": "if women didn't have double standards then they would have no standards. #MagicMikeXXL #YesAllWomen",
    "perception": "The person's perception of this tweet is likely to be one of frustration and disappointment, as it implies that women are held to a lower standard than men. They may also feel that the hashtag is being used to trivialize the feminist movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is perpetuating a double standard between men and women, and that the hashtag is being used to undermine the feminist movement. They may also feel that the tweet is reinforcing gender stereotypes and is dismissive of the progress that has been made in gender equality.",
    "action": "Women should be held to the same standards as men. #Feminism #EqualityForAll"
  },
  {
    "ID": 278,
    "Target": "Feminist Movement",
    "Tweet": "@njaniboy99 @omercayir1 @Sahil_Handa_ i don't ever need a man #YesAllWomen",
    "perception": "The person's perception of this tweet is likely to be one of support and solidarity for the Feminist Movement, as it expresses a sentiment of not needing a man and uses the hashtag #YesAllWomen.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is expressing a sentiment of female empowerment and independence, and that it is advocating for the rights of women.",
    "action": "@njaniboy99 @omercayir1 @Sahil_Handa_ I stand with you in support of the Feminist Movement! #YesAllWomen"
  },
  {
    "ID": 641,
    "Target": "Feminist Movement",
    "Tweet": "#sex male caste general religion Hindu. None of these were in my hand!!! Gurrr  #feminazis pseudo",
    "perception": "The person's initial perception of the tweet might be that it is expressing frustration and anger towards the Feminist Movement, and that it is coming from a place of prejudice.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the Feminist Movement is unfairly targeting certain groups of people, and that it is using the term \"feminazis\" in a derogatory way.",
    "action": "Feminism is about equality and justice for all, regardless of gender, caste, religion, or any other factor. Let's work together to create a more equitable society."
  },
  {
    "ID": 393,
    "Target": "Feminist Movement",
    "Tweet": "Feminism is a fashionable form of narcissism because personal trauma & personal retribution is what drives feminists.",
    "perception": "The person's perception of this tweet is likely to be one of anger and frustration, as it implies that the Feminist Movement is driven by selfish motives.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is dismissive of the Feminist Movement and its goals, and that it is perpetuating a negative stereotype of feminists.",
    "action": "Feminism is about equality and justice, not personal trauma and retribution. #FeminismIsNotNarcissism"
  },
  {
    "ID": 32,
    "Target": "Feminist Movement",
    "Tweet": "@Yaahnemba Have you ever thought that maybe \"blue jeans\" hates you? Not everyone in the world is made for each other.",
    "perception": "The person's initial perception of this tweet would be one of confusion and suspicion, as it appears to be implying that not everyone is meant to be together, which could be interpreted as a criticism of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as a criticism of the Feminist Movement, and to question the motives of the person who posted it. They may also consider the implications of the tweet and how it could be interpreted by others.",
    "action": "@Yaahnemba Your tweet implies a criticism of the Feminist Movement. Please explain your point of view and why you think this way."
  },
  {
    "ID": 648,
    "Target": "Feminist Movement",
    "Tweet": "I guess what I am begging for at this point, is like, some really sexist views.. I know they are out there#FeministsAreUgly",
    "perception": "The person's perception of the tweet is likely to be one of confusion and disbelief, as the tweet appears to be advocating for sexist views while also criticizing feminists.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is attempting to make a point about the prevalence of sexism in society, and that the author is attempting to criticize feminists for not doing enough to combat it.",
    "action": "Sexism is wrong and should not be tolerated. We must all work together to combat it, regardless of our views on feminism #EndSexism"
  },
  {
    "ID": 112,
    "Target": "Feminist Movement",
    "Tweet": "These SJWs are so homogenous and blur together so well it's like dealing with one giant,rainbow-headed monster. #GamerGate",
    "perception": "The person's perception of this tweet would be one of anger and frustration towards the feminist movement. They may also feel that the tweet is dismissive and disrespectful of the movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the feminist movement by implying that its members are all the same and that they are a unified force. They may also interpret the tweet as an attempt to delegitimize the movement and its members.",
    "action": "#GamerGate is not an excuse to disrespect and delegitimize the feminist movement. We must recognize and celebrate the diversity of voices within the movement. #Feminism"
  },
  {
    "ID": 654,
    "Target": "Feminist Movement",
    "Tweet": "Spanish Civil War publishing cookbooks & author gender points to women's lack of access to education, ind wealth #osfc15",
    "perception": "The person's perception of this tweet would be that it is highlighting the inequality faced by women in terms of access to education and wealth, as evidenced by the publishing of cookbooks and the gender of the author. They would likely view this as a sign of the need for further progress in the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the publishing of cookbooks and the gender of the author point to the lack of access to education and wealth that women have historically faced. This tweet serves as a reminder of the need for further progress in the Feminist Movement to ensure that women have equal access to education and wealth.",
    "action": "We must continue to fight for gender equality and ensure that women have access to education and wealth. #FeministMovement #osfc15"
  },
  {
    "ID": 463,
    "Target": "Feminist Movement",
    "Tweet": "Pussy Riot: A Punk Prayer  I highly suggest you watch it. Such an amazing documentary.",
    "perception": "The person's perception of the tweet is likely to be positive, as it is recommending a documentary about the Feminist Movement. They may also feel inspired by the message, as it is encouraging them to watch the documentary.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the documentary is an important source of information about the Feminist Movement, and that it is worth watching. They may also feel encouraged to learn more about the movement and to take action in support of it.",
    "action": "Thanks for the suggestion! I'm definitely going to watch #PussyRiot: A Punk Prayer. #FeministMovement"
  },
  {
    "ID": 312,
    "Target": "Feminist Movement",
    "Tweet": "@THOSEGOODVlBES wtf what about single fathers",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be dismissive of the Feminist Movement and its goals. They may also feel that the tweet is insensitive to single fathers and their struggles.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to undermine the Feminist Movement by suggesting that single fathers are not being taken into consideration. They may also feel that the tweet is attempting to distract from the issues that the Feminist Movement is trying to address.",
    "action": "@THOSEGOODVlBES Single fathers are just as important as mothers and should be included in the conversation about gender equality. #FeminismForAll"
  },
  {
    "ID": 602,
    "Target": "Feminist Movement",
    "Tweet": "I am really proud to be a @HeforShe and I want to thank @EmWatson for being such a powerful feminist #HeForShe",
    "perception": "The person's perception of this tweet is likely one of admiration and appreciation for the HeForShe movement and Emma Watson's involvement in it. They may also feel a sense of solidarity with the cause and the people involved.",
    "cognition": "The person's cognition after perceiving the information is likely that the HeForShe movement is an important cause that deserves support, and that Emma Watson is a powerful advocate for the cause. They may also feel inspired to take action in support of the movement.",
    "action": "I'm proud to stand with @HeforShe and @EmWatson in support of gender equality! #HeForShe #FeministMovement"
  },
  {
    "ID": 42,
    "Target": "Feminist Movement",
    "Tweet": "RT @rossansguil: Nothing like dudes joking about molesting me right to my face...",
    "perception": "The person's perception of this tweet would be one of shock and anger, as it is clearly a violation of the person's rights and a demonstration of the sexism that the Feminist Movement is fighting against.",
    "cognition": "The person's cognition after perceiving the information would be that this is an example of the type of sexism and misogyny that the Feminist Movement is fighting against, and that it is unacceptable and must be addressed.",
    "action": "This is unacceptable and must be addressed! #FeministMovement #NoToSexism"
  },
  {
    "ID": 4,
    "Target": "Feminist Movement",
    "Tweet": "YOU'RE A GIRL AND HAVE A SEX DRIVE!? YOU MUST BE A SLUT! #feminist",
    "perception": "The person's perception of this tweet would be one of shock and anger, as it is a derogatory statement that undermines the feminist movement. They would likely feel that the tweet is offensive and disrespectful.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of sexism and misogyny, and that it is an attempt to shame and belittle women for having a sex drive. They would likely feel that this type of attitude is unacceptable and should not be tolerated.",
    "action": "Sexism and misogyny have no place in the feminist movement. #feminist #respectwomen"
  },
  {
    "ID": 186,
    "Target": "Feminist Movement",
    "Tweet": "This always infuriates me. If I was male would I be asked these questions? would I be stereotyped as a 'bitch', 'cold hearted' or",
    "perception": "bossy\"?\"\nThe person's perception of this tweet is likely one of frustration and anger, as it highlights the unfairness of gender-based stereotypes and double standards.",
    "cognition": "The person's cognition after perceiving the information is likely to be that gender-based stereotypes and double standards are unfair and need to be challenged. They may also recognize the need for greater gender equality and the importance of supporting the Feminist Movement.",
    "action": "We must challenge gender-based stereotypes and double standards. We must fight for gender equality and support the Feminist Movement!\" #Feminism #GenderEquality"
  },
  {
    "ID": 354,
    "Target": "Feminist Movement",
    "Tweet": "@gelijkis my hat is seriously off to all those who made Beijing such a breakthrough. We don't say thank you enough! #womensrights",
    "perception": "The person's perception of this tweet is likely to be one of admiration and appreciation for the progress made in the Feminist Movement. They may also feel a sense of gratitude towards those who have worked hard to make this progress possible.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the Beijing Declaration and Platform for Action was a major milestone in the Feminist Movement, and that it is important to recognize and thank those who have contributed to its success.",
    "action": "Thank you to everyone who has worked hard to make the Beijing Declaration and Platform for Action a success! #FeministMovement #WomensRights"
  },
  {
    "ID": 392,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS  The evidence of your closeted hate is your refusal to address man-hate in feminism.   #GamerGate",
    "perception": "The person's initial perception of this tweet would be one of confusion and frustration, as it appears to be accusing feminists of hating men, which goes against the values of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be to question the validity of the statement, as it appears to be an unfounded accusation. They may also be concerned about the implications of this statement, and how it could be used to discredit the Feminist Movement.",
    "action": "Feminism is about equality and respect for all genders, not hate. #FeminismIsLove #GamerGate"
  },
  {
    "ID": 443,
    "Target": "Feminist Movement",
    "Tweet": "Or maybe I'm just cross because I'm hungry... hmmmm",
    "perception": "The person's perception of this tweet could be that the author is feeling frustrated and possibly annoyed. They may also be feeling a bit hungry, which could be causing their mood.",
    "cognition": "The person's cognition after perceiving the information could be that the author is feeling overwhelmed and is trying to find a way to cope with their emotions. They may also be trying to distract themselves from their hunger by focusing on something else.",
    "action": "It's ok to take a break and take care of yourself. You deserve it!"
  },
  {
    "ID": 161,
    "Target": "Feminist Movement",
    "Tweet": "@sammikluber I'm just stating the facts",
    "perception": "The person's perception of this tweet is that the author is confident in their opinion and is presenting facts in support of the Feminist Movement. They likely view the tweet as a positive statement in support of the cause.",
    "cognition": "The person's cognition after perceiving the information is that the author is knowledgeable and passionate about the Feminist Movement, and is using facts to support their opinion. They likely view the tweet as a strong statement of support for the cause.",
    "action": "@sammikluber I appreciate your support for the Feminist Movement and your use of facts to back up your opinion!"
  },
  {
    "ID": 625,
    "Target": "Feminist Movement",
    "Tweet": "Patriarchy Theory - designed to project the prejudice and insecurity of feminists onto men",
    "perception": "The person's initial perception of this tweet would be one of frustration and anger, as it appears to be a criticism of the Feminist Movement. They may also feel that the tweet is dismissive of the struggles faced by feminists.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the Feminist Movement by suggesting that its theories are based on prejudice and insecurity. They may also feel that the tweet is attempting to invalidate the experiences of feminists and their struggles for equality.",
    "action": "Feminism is about equality and justice, not prejudice and insecurity. We must continue to fight for the rights of all genders.\" #Feminism #Equality #Justice"
  },
  {
    "ID": 68,
    "Target": "Feminist Movement",
    "Tweet": "@amin86660132 @justsoshelby  Very nice work. I'm happy to hear your autistic friend is able to express himself this way",
    "perception": "The person's perception of this tweet is likely one of admiration and support for the work being done to empower autistic individuals, as well as for the Feminist Movement. They may also feel a sense of pride in the progress being made towards greater acceptance and understanding of those with disabilities.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the work being done to empower autistic individuals is an important part of the Feminist Movement, and that it is important to create an inclusive and understanding environment for those with disabilities.",
    "action": "@amin86660132 @justsoshelby This is amazing! We need to continue to create an inclusive and understanding environment for those with disabilities and empower them to express themselves. #FeministMovement #AutismAcceptance"
  },
  {
    "ID": 612,
    "Target": "Feminist Movement",
    "Tweet": "The retarded tantrums of #GamerGate feminists show the effects of a lifetime of never facing intellectual challenge.",
    "perception": "The person's perception of this tweet is likely to be negative, as it implies that feminists are not intellectually capable. They may also feel that the tweet is dismissive of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is dismissive of the Feminist Movement and implies that feminists are not intellectually capable. They may also feel that the tweet is disrespectful and belittling of the Feminist Movement.",
    "action": "The #GamerGate feminists are just as capable of intellectual challenge as anyone else. Respect and support the Feminist Movement!"
  },
  {
    "ID": 230,
    "Target": "Feminist Movement",
    "Tweet": "Whether you label yourself a feminist or not I think it's important that we address equal rights.-Taylor Swift.",
    "perception": "The person's perception of this tweet is likely to be one of support and agreement with Taylor Swift's message of advocating for equal rights. They may also feel encouraged by the fact that a prominent figure is speaking out in favor of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that Taylor Swift is advocating for equal rights regardless of whether someone identifies as a feminist or not. They may also interpret the tweet as a call to action to address the issue of gender inequality.",
    "action": "Thank you @TaylorSwift for speaking out in favor of equal rights! We must continue to fight for gender equality and justice for all."
  },
  {
    "ID": 1,
    "Target": "Feminist Movement",
    "Tweet": "Sometimes I overheat and want to take off my shirt but can't because of social expectations of people with breasts. ;n;",
    "perception": "The person's perception of this tweet is likely one of empathy and understanding of the struggles faced by those who identify as female. They may also feel a sense of solidarity with the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information is likely to be that gender expectations can be oppressive and that there is a need for greater gender equality. They may also recognize the importance of creating a society where people of all genders can express themselves freely without fear of judgement or discrimination.",
    "action": "It's not fair that anyone should be held back from expressing themselves because of gender expectations. We need to work together to create a more equal society for all genders #FeministMovement"
  }
]