[
  {
    "ID": 403,
    "Target": "Feminist Movement",
    "Tweet": "Like, feminism isn't just about 'gender' it's about so much more than that you ignorant toad.",
    "perception": "The person's perception of this tweet is likely one of frustration and annoyance towards the person who is not understanding the complexities of the feminist movement.",
    "cognition": "The person's cognition after perceiving the information is likely that the person who wrote the tweet is trying to educate the other person on the complexities of the feminist movement and that the tweet is expressing frustration and annoyance towards the lack of understanding.",
    "action": "Feminism is about so much more than just gender. Let's have a conversation about it so we can better understand the complexities of the movement."
  },
  {
    "ID": 213,
    "Target": "Feminist Movement",
    "Tweet": "Well maybe if more men learned to take \"no\" as an answer, women wouldn't have to say as much #fnm231",
    "perception": "The person's perception of this tweet is likely one of agreement and support for the Feminist Movement, as it implies that men should be more respectful of women's boundaries. They may also feel encouraged by the hashtag, as it suggests that the message is being shared widely.",
    "cognition": "The person's cognition after perceiving the information is likely that men should be more respectful of women's boundaries and that the Feminist Movement is gaining traction and support. They may also feel empowered by the message, as it suggests that their beliefs are being shared and accepted.",
    "action": "Amen to that! #FeminismIsPower #FNM231"
  },
  {
    "ID": 374,
    "Target": "Feminist Movement",
    "Tweet": "RT @LeexxxW: So #SpankAFeminist is sooooo horrible but #killallmen is perfectly fine ! I see how it is!!",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it appears to be promoting violence against men. They may also feel anger towards the person who posted the tweet for their apparent disregard for equality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting a double standard, where violence against men is seen as acceptable, while violence against women is not. They may also feel that the tweet is perpetuating a culture of misogyny and sexism, which is antithetical to the goals of the Feminist Movement.",
    "action": "This kind of rhetoric is unacceptable and does not reflect the values of the Feminist Movement. We must stand together to promote equality and respect for all genders.\" #Feminism #EqualityForAll"
  },
  {
    "ID": 144,
    "Target": "Feminist Movement",
    "Tweet": "I met my first radical feminist today. Holy shit. Amazing how much can go wrong in a brain #wtf",
    "perception": "The person's perception of this tweet is likely one of admiration and awe, as they recognize the power of the feminist movement and the potential for transformation. They may also be surprised by the implications of the hashtag, as it suggests a sense of confusion or disbelief.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the feminist movement is powerful and can lead to great change, but also that there is still a lot of work to be done in terms of understanding and accepting the movement. They may also be struck by the complexity of the issues surrounding feminism and the need for further education and discussion.",
    "action": "So inspiring to see the power of the feminist movement! We must continue to educate ourselves and work together to create a more equitable society #Feminism"
  },
  {
    "ID": 532,
    "Target": "Feminist Movement",
    "Tweet": "The representation goal of Feminism has gone from  \"Invent more female characters\"  to  \"Replace all male characters",
    "perception": "The person's perception of this tweet would likely be one of support for the Feminist Movement, as it is advocating for more representation of female characters in media.",
    "cognition": "The person's cognition after perceiving the information would likely be that the Feminist Movement is making progress in its goal of increasing representation of female characters in media, and that this progress is a positive step towards gender equality.",
    "action": "This is great progress for the Feminist Movement! We must continue to strive for gender equality in all forms of media!\" #Feminism #GenderEquality"
  },
  {
    "ID": 328,
    "Target": "Feminist Movement",
    "Tweet": ".@GloriaSteinem said, \"Women are not going to be equal outside the home until men are equal in it.\" Do you agree? #antifeminism",
    "perception": "The person's perception of the tweet could be that it is a negative sentiment towards the Feminist Movement, as it implies that men and women should be equal in the home before women can be equal outside of it. They may also perceive the hashtag #antifeminism as further evidence of the tweet's negative sentiment.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that men and women should be equal in the home before women can be equal outside of it, and that the hashtag #antifeminism is further evidence of the tweet's negative sentiment towards the Feminist Movement.",
    "action": "No! We should strive for gender equality everywhere, not just in the home. #feminism #equalityforall"
  },
  {
    "ID": 133,
    "Target": "Feminist Movement",
    "Tweet": "Because heckling #YesAllWomen & screaming \"LOOK AT ME!\" all day is an excellent way to show us you are a serious individual",
    "perception": "The person's perception of this tweet is likely to be one of disapproval and frustration, as it appears to be mocking the Feminist Movement. They may also feel that the tweet is disrespectful and undermines the importance of the cause.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is mocking the Feminist Movement and is not taking it seriously. They may also feel that the tweet is dismissive of the importance of the cause and is not respectful of the people involved.",
    "action": "We won't be silenced! #YesAllWomen deserve respect and to be taken seriously. #FeministMovement"
  },
  {
    "ID": 560,
    "Target": "Feminist Movement",
    "Tweet": "Never settle for anything less than your are worth.",
    "perception": "The person's perception of this tweet is likely to be positive, as it encourages people to stand up for their rights and not accept anything less than they deserve.",
    "cognition": "The person's cognition of this tweet is likely to be that it is a message of empowerment, encouraging people to fight for their rights and not accept anything less than they deserve. They may also interpret it as a call to action to support the Feminist Movement and its goals.",
    "action": "Thank you for this empowering message! We must continue to fight for our rights and support the Feminist Movement. #Feminism #Equality"
  },
  {
    "ID": 142,
    "Target": "Feminist Movement",
    "Tweet": "They want equality but what they're doing is overpowering men. #feminazi",
    "perception": "The person's perception of this tweet would be one of disapproval and frustration, as it implies that the Feminist Movement is unfairly overpowering men.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the Feminist Movement is unfairly overpowering men, and that this is not an acceptable way to achieve equality.",
    "action": "Equality should be achieved through respect and understanding, not by overpowering one another. #feminism"
  },
  {
    "ID": 258,
    "Target": "Feminist Movement",
    "Tweet": "@Fashionopolis You just gained a new follower! The #misogynist #maritalrapedebate views has got me outraged!",
    "perception": "The person's perception of the tweet would be one of shock and anger, as they are likely to be appalled by the misogynistic and marital rape debate views expressed. They may also feel a sense of solidarity with the person who posted the tweet, as they share the same values and beliefs.",
    "cognition": "The person's cognition after perceiving the information would be to recognize the injustice of the views expressed and to understand the need to take action against them. They may also feel a sense of urgency to spread awareness and to fight for the rights of those affected by such views.",
    "action": "@Fashionopolis I'm so sorry to hear about the #misogynist #maritalrapedebate views. We must stand together to fight for justice and equality for all!"
  },
  {
    "ID": 310,
    "Target": "Feminist Movement",
    "Tweet": "I only ever see \"meritocracy is a myth\" being pushed by people with no skills trying to buddy-buddy their way to the top. Hmm.",
    "perception": "The person's perception of this tweet is likely one of frustration and disbelief, as it implies that those who support the Feminist Movement are not competent and are only trying to gain favor.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is implying that those who support the Feminist Movement are not competent and are only trying to gain favor. They may also feel that the tweet is dismissive of the movement and its supporters, and that it is perpetuating a false narrative about the movement.",
    "action": "Meritocracy is not a myth. It's a reality that we must strive for. #FeministMovement"
  },
  {
    "ID": 59,
    "Target": "Feminist Movement",
    "Tweet": "I NEED FEMINISM BECAUSE- A man in a room full of women is ecstatic. A woman in a room full of men is terrified.",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the Feminist Movement, as it highlights the unequal power dynamics between men and women in society.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is highlighting the unequal power dynamics between men and women in society, and that this is an example of why the Feminist Movement is necessary.",
    "action": "I stand with the Feminist Movement! We need to continue to fight for gender equality and justice for all.\" #Feminism #GenderEquality"
  },
  {
    "ID": 7,
    "Target": "Feminist Movement",
    "Tweet": "So you support unequal pricing based on gender @CamilleBogrand?  Don't you normally call that sexism?  #EqualPayDay",
    "perception": "The person's perception of this tweet would be one of confusion and disbelief, as it appears to be criticizing the Feminist Movement for supporting unequal pricing based on gender. They may also feel frustrated that the tweet is using the hashtag #EqualPayDay to make this point.",
    "cognition": "The person's cognition after perceiving the information would be to question the motives of the person who posted the tweet, as it appears to be an attempt to discredit the Feminist Movement. They may also be questioning the validity of the statement, as it appears to be a false accusation.",
    "action": "@CamilleBogrand We support equal pay for equal work, not unequal pricing based on gender. #EqualPayForAll"
  },
  {
    "ID": 76,
    "Target": "Feminist Movement",
    "Tweet": "Ok armchair feminists got their panties wet. If you're a social justice warrior go out and do something. Get off tumblr.",
    "perception": "The person's perception of this tweet is likely to be negative, as it implies that those who support the Feminist Movement are not taking action and are instead just talking about it online. They may also feel that the tweet is dismissive of the movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is dismissive of the Feminist Movement and its supporters, and that it implies that those who support the movement should take action instead of just talking about it online.",
    "action": "Feminism is about taking action and making a difference. Let's work together to create a more equitable society for everyone.\" #FeminismMatters"
  },
  {
    "ID": 372,
    "Target": "Feminist Movement",
    "Tweet": "@sass_unicorn lol! Young male children for",
    "perception": "housework\" and \"childcare\" - what a joke! #Feminism\"\n\nThe person's perception of this tweet would be that it is mocking the idea of men doing traditionally female roles, and that it is in support of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a statement about gender roles and that it is advocating for gender equality. They would also understand that the hashtag #Feminism is being used to show support for the Feminist Movement.",
    "action": "@sass_unicorn Absolutely! We need to break down gender stereotypes and create a more equal society. #Feminism"
  },
  {
    "ID": 75,
    "Target": "Feminist Movement",
    "Tweet": "Strict gender roles in the context of a true marriage devoted to raising children will always be the ideal. No substitutes. #tcot",
    "perception": "The person's perception of this tweet might be that it is promoting traditional gender roles and is against the Feminist Movement. They may also perceive it as being critical of alternative family structures.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for traditional gender roles and is against the Feminist Movement. They may also interpret it as being critical of alternative family structures and as a rejection of the idea of gender equality.",
    "action": "Gender roles should not be imposed on anyone. We should strive for gender equality and respect all family structures. #Feminism"
  },
  {
    "ID": 614,
    "Target": "Feminist Movement",
    "Tweet": "CREATIONIST OK, you clearly don't know what the word of God is!  FEMINIST OK you clearly don't know what feminism is!",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it implies that those who support the Feminist Movement do not understand what it is. They may also feel that the tweet is dismissive of their beliefs.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is dismissive of the Feminist Movement and implies that those who support it do not understand what it stands for. They may also feel that the tweet is invalidating their beliefs and experiences.",
    "action": "Feminism is about equality and respect for all genders. Dismissing it implies that you don't understand the movement and its goals."
  },
  {
    "ID": 538,
    "Target": "Feminist Movement",
    "Tweet": "there's someone once told me - girls have to be quiet -, i've told him: really? . and i never been quiet since then.",
    "perception": "The person's perception of this tweet is likely to be one of admiration and support for the feminist movement, as it conveys a message of empowerment and strength.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is conveying a message of standing up for oneself and not allowing anyone to dictate how one should behave. Additionally, the person may also interpret the tweet as a call to action for other women to speak up and fight for their rights.",
    "action": "Amen! We must all stand together and fight for our rights. #FeministMovement #Empowerment"
  },
  {
    "ID": 522,
    "Target": "Feminist Movement",
    "Tweet": "Mind you, if your grandmother was cremated you could give yourself an enema with her ashes @beauschopstick  #GamerGate",
    "perception": "The person's perception of this tweet would be one of shock and disbelief. They would likely be appalled by the offensive and insensitive nature of the tweet.",
    "cognition": "The person's cognition of this tweet would be that it is an example of the kind of toxic behavior that the Feminist Movement is trying to combat. They would likely be angered by the lack of respect for the deceased and the misogynistic implications of the tweet.",
    "action": "This kind of behavior is unacceptable and disrespectful. #FeministMovement #RespectTheDead"
  },
  {
    "ID": 563,
    "Target": "Feminist Movement",
    "Tweet": "Can't find it in me to be friends with people who throw around the word 'slut' or judge women for being sexual beings. #Equality",
    "perception": "The person's perception of this tweet is likely to be one of support for the feminist movement, as it speaks out against the judgement of women for being sexual beings and promotes equality. They may also feel a sense of solidarity with the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the respect of women and their right to express their sexuality without judgement. They may also recognize that the tweet is promoting gender equality and the idea that women should not be judged for their sexual behavior.",
    "action": "I'm with you! #Feminism #Equality"
  },
  {
    "ID": 429,
    "Target": "Feminist Movement",
    "Tweet": "@PennyRed you realise that you have just painted \"all\" men with the same brush. So \"wilfully ignorant\" could describe you! #fail",
    "perception": "The person's perception of this tweet could be that it is critical of the Feminist Movement and dismissive of its supporters. They may also perceive it as an attack on the idea of gender equality.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that the Feminist Movement is painting all men with the same brush and that its supporters are willfully ignorant. They may also interpret the tweet as an attempt to discredit the idea of gender equality.",
    "action": "@PennyRed We should all strive for gender equality, regardless of gender. Let's work together to create a more equitable society for everyone."
  },
  {
    "ID": 628,
    "Target": "Feminist Movement",
    "Tweet": "Half victims, half accomplices, like everyone else' Simone De Beavoir",
    "perception": "The person's perception of this tweet would be that it is a thought-provoking statement that acknowledges the complexity of gender roles and the need for a feminist movement. They may also interpret it as a call to action to challenge the status quo and strive for gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that gender roles are not as simple as they may seem, and that everyone has a role to play in the feminist movement. They may also recognize the need to challenge traditional gender roles and strive for gender equality.",
    "action": "We must all work together to challenge traditional gender roles and strive for gender equality. #FeministMovement #GenderEquality"
  },
  {
    "ID": 399,
    "Target": "Feminist Movement",
    "Tweet": "CEOs apologizing to feminists pressure only awards Feminism with its sought-after intellectual immunity. #GamerGate",
    "perception": "The person's perception of this tweet is likely to be one of skepticism and criticism of the idea that feminism is being given special treatment. They may also feel that the hashtag #GamerGate is being used to discredit the feminist movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is implying that feminism is being given preferential treatment and that the hashtag #GamerGate is being used to discredit the feminist movement. They may also feel that the tweet is attempting to undermine the legitimacy of the feminist movement.",
    "action": "Feminism should not be given special treatment or be discredited. We should all be treated equally and fairly. #EqualityForAll"
  },
  {
    "ID": 246,
    "Target": "Feminist Movement",
    "Tweet": "Pope Francis: Christians should support equal pay for equal work #popefrancis #worldnews #society #women",
    "perception": "The person's perception of this tweet would likely be one of approval and admiration for Pope Francis' stance on equal pay for equal work. They may also feel encouraged by the Pope's support of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would likely be that Pope Francis is advocating for equal pay for equal work, which is a key component of the Feminist Movement. They may also recognize the importance of this message being shared on a global platform, and the potential impact it could have on society.",
    "action": "Thank you @PopeFrancis for your support of the Feminist Movement and advocating for equal pay for equal work! #popefrancis #worldnews #society #women"
  },
  {
    "ID": 44,
    "Target": "Feminist Movement",
    "Tweet": "@FudgieeBuddiee ARE YOU SAYING ALL GIRLS ARE SENSITIVE BECAUSE OF GENDER ROLES? YOU SEXIST SWINE",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it appears to be a derogatory comment about gender roles and the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a negative statement about gender roles and the Feminist Movement, and that the person who wrote the tweet is being sexist.",
    "action": "@FudgieeBuddiee Gender roles are not an excuse for sexism. We should all strive for equality and respect for all genders. #FeministMovement"
  }
]