[
  {
    "ID": 363,
    "Target": "Feminist Movement",
    "Tweet": "Men want women to take their name in marriage for male pride. Because female pride doesn't matter. #genderequality",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards the inequality between genders. They would likely view the tweet as a reminder of the need for gender equality and the importance of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the traditional practice of women taking their husband's name in marriage is a symbol of male dominance and reinforces the idea that female pride is not valued. They would likely view this as an example of the gender inequality that still exists in society and the need for further progress in the Feminist Movement.",
    "action": "We must continue to fight for #genderequality and challenge the outdated notion that female pride doesn't matter. #feminism"
  },
  {
    "ID": 425,
    "Target": "Feminist Movement",
    "Tweet": "Feminists tend to get upset & leave comedy clubs because humor is a form of intelligence they lack.  #GamerGate",
    "perception": "The person's perception of this tweet would be one of anger and frustration, as it implies that feminists are not intelligent and are not able to appreciate comedy.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a negative and derogatory statement about feminists, and that it is perpetuating a stereotype that feminists are not intelligent.",
    "action": "This tweet is offensive and perpetuates a harmful stereotype about feminists. #Feminism #StopMisogyny"
  },
  {
    "ID": 572,
    "Target": "Feminist Movement",
    "Tweet": "#HowToSpotAFeminist?->  10 Feminists struggle to control their lives and try to micromanage other women's lives.",
    "perception": "The person's perception of this tweet would be that it is critical of the Feminist Movement and its supporters, suggesting that they are overly controlling and intrusive.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists are trying to control and dictate the lives of other women, which is a negative portrayal of the Feminist Movement. They may also feel that the tweet is attempting to discredit the movement and its supporters.",
    "action": "#HowToSpotAFeminist? -> Feminists are not trying to control or dictate the lives of other women. They are fighting for equality and respect for all genders. #FeminismIsEquality"
  },
  {
    "ID": 567,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS & SJWs  I am a proud Troll. Make sure I am not proud of what you want to shame me for.  #GamerGate",
    "perception": "The person's initial perception of the tweet would be one of confusion and frustration, as it appears to be mocking the Feminist Movement and Social Justice Warriors. They may also feel a sense of anger towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an attempt to discredit the Feminist Movement and Social Justice Warriors, and that the person who posted the tweet is likely a supporter of the Gamergate movement.",
    "action": "Your attempt to discredit the Feminist Movement and Social Justice Warriors is misguided and wrong. #Feminism #SJW"
  },
  {
    "ID": 632,
    "Target": "Feminist Movement",
    "Tweet": "#LikeAFeminist if you don't identify as a feminist, clearly you don't love yourself sweetie.",
    "perception": "The person's perception of this tweet is likely one of encouragement and support for the Feminist Movement, as well as a reminder to love oneself.",
    "cognition": "The person's cognition after perceiving the information is likely that it is important to identify as a feminist in order to show love for oneself, and that the Feminist Movement is a positive and empowering movement.",
    "action": "#LikeAFeminist I'm proud to identify as a feminist and to show my love for myself and others!"
  },
  {
    "ID": 198,
    "Target": "Feminist Movement",
    "Tweet": "We are actually watching a video on radical feminism in history this is the funniest movie ive ever seen",
    "perception": "The person's perception of the tweet could be that the video is humorous and that the person is supportive of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information could be that the video is a lighthearted way to learn about the history of the Feminist Movement, and that the person finds it entertaining.",
    "action": "I'm so glad to see that we can learn about the history of the Feminist Movement in a fun and entertaining way!"
  },
  {
    "ID": 88,
    "Target": "Feminist Movement",
    "Tweet": "Just give me the attention you never gave anyone else. #ExtremeRules #NepalEarthquake #FreddieGray #RHOAReunion",
    "perception": "The person's perception of this tweet could be that it is a call for attention and recognition of various social issues, such as the Nepal Earthquake, Freddie Gray, and the RHOAReunion. Additionally, the hashtag #ExtremeRules could suggest a call for more extreme measures to be taken to address these issues.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is advocating for more attention and recognition to be given to social issues, and that more extreme measures should be taken to address them. Additionally, the person may recognize the tweet as a call to action for the Feminist Movement.",
    "action": "We must take action to address the social issues mentioned in this tweet. #FeministMovement #ExtremeRules #NepalEarthquake #FreddieGray #RHOAReunion"
  },
  {
    "ID": 488,
    "Target": "Feminist Movement",
    "Tweet": "men suck. women suck. everybody sucks",
    "perception": "The person's perception of the tweet could be that it is a negative sentiment towards all genders, and that it is not supportive of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is expressing a general sentiment of negativity towards all genders, and that it is not supportive of the Feminist Movement. They may also interpret the tweet as a statement of frustration with the current state of gender relations.",
    "action": "Gender equality is something we should all strive for. Let's work together to create a more equitable society for everyone!"
  },
  {
    "ID": 69,
    "Target": "Feminist Movement",
    "Tweet": "WTF LITEraL FUCK AM I EVAN SSEING THIS THING ABOUT.",
    "perception": "The person's perception of the tweet is likely one of confusion and disbelief, as the language used is aggressive and hostile.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is expressing frustration and anger towards the Feminist Movement. They may also interpret the tweet as a sign of opposition to the movement.",
    "action": "We must continue to fight for gender equality and the rights of all people. #FeministMovement"
  },
  {
    "ID": 138,
    "Target": "Feminist Movement",
    "Tweet": "@foreigncorrespo And just because you can quote Simone doesn't mean you understand her. Modern femmie-nism is just whining.",
    "perception": "The person's perception of this tweet is likely to be one of disbelief and frustration, as it appears to be dismissive of the Feminist Movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is dismissive of the Feminist Movement and its supporters, and that the author of the tweet does not understand the true meaning of feminism.",
    "action": "@foreigncorrespo Feminism is about equality and empowerment, not whining. Let's have a conversation about it and learn from each other."
  },
  {
    "ID": 446,
    "Target": "Feminist Movement",
    "Tweet": "feminists be like: don' judge a book by its cover! unless the cover is a straight white male.",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the feminist movement, as it is making a joke about the judgement of straight white males. They may also find the tweet humorous.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is making a joke about the judgement of straight white males, and that it is a humorous way of expressing the idea that feminists should not judge people based on their appearance.",
    "action": "LOL! Love it! #FeministMovement"
  },
  {
    "ID": 619,
    "Target": "Feminist Movement",
    "Tweet": "DEAR LYING FEMINIST JOURNALISTS  If candy crush saga is \"hard core gaming\" then masturbation is marriage.  #GamerGate",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it appears to be mocking the Feminist Movement and its supporters. They may also feel frustrated and insulted by the tweet's dismissive tone.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the Feminist Movement and its supporters by comparing it to a trivial game. They may also interpret the tweet as an attempt to belittle the movement and its supporters by implying that their beliefs are not valid.",
    "action": "This tweet is offensive and dismissive of the Feminist Movement and its supporters. #FeminismMatters #RespectWomen"
  },
  {
    "ID": 364,
    "Target": "Feminist Movement",
    "Tweet": "I think it's okay for a woman to take a mans name if she wants to. #genderequality",
    "perception": "The person's perception of this tweet is likely to be positive, as it promotes gender equality and supports the idea of a woman taking a man's name if she wishes to.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for gender equality and that it is acceptable for a woman to take a man's name if she wishes to. This is a progressive stance that supports the Feminist Movement.",
    "action": "I fully support this! #FeministMovement #GenderEquality"
  },
  {
    "ID": 525,
    "Target": "Feminist Movement",
    "Tweet": "If the sexes had equal intellectual abilities the collective inferiority complex of feminism would not be necessary.",
    "perception": "The person's perception of this tweet would be that it is critical of the feminist movement and implies that it is unnecessary.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the feminist movement is not needed because men and women have equal intellectual abilities. They may also interpret the tweet as implying that the feminist movement is based on an inferiority complex.",
    "action": "Feminism is about more than just intellectual abilities. It's about creating a society where everyone is treated equally and with respect, regardless of gender.\" #Feminism #Equality"
  },
  {
    "ID": 545,
    "Target": "Feminist Movement",
    "Tweet": "MyVagina kicked the Shit out of HisCock /",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it is a crude and offensive way of expressing support for the Feminist Movement. They may also feel a sense of anger and frustration at the language used.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an inappropriate and offensive way of expressing support for the Feminist Movement. They may also feel that the language used is disrespectful and demeaning to both genders.",
    "action": "This type of language is not acceptable and does not represent the values of the Feminist Movement. #Respect #Equality #Feminism"
  },
  {
    "ID": 486,
    "Target": "Feminist Movement",
    "Tweet": "Some feminist's would shut down the entire global porn industry & put millions on benefits/welfare & not even care",
    "perception": "The person's perception of this tweet is likely to be one of disapproval and frustration towards the idea of shutting down the global porn industry. They may also feel that the idea is unrealistic and not a viable solution to the issue of welfare.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the idea of shutting down the global porn industry is not a practical solution to the issue of welfare, and that it would be detrimental to the millions of people who rely on the industry for their livelihood. They may also feel that the idea is not in line with the values of the Feminist Movement.",
    "action": "Shutting down the global porn industry is not a viable solution to the issue of welfare. We should focus on creating more equitable opportunities for everyone instead.\" #FeministMovement #EqualOpportunities"
  },
  {
    "ID": 565,
    "Target": "Feminist Movement",
    "Tweet": "NiceFeminists are passive onlookers to man-hate. Their excuse?  \"It's not up to me to prevent hate in my movement!",
    "perception": "The person's perception of this tweet is likely to be one of disappointment and frustration, as it implies that the feminist movement is not doing enough to prevent hate. They may also feel that the tweet is dismissive of the efforts of feminists to create a more inclusive and equitable society.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is an oversimplification of the feminist movement and its goals, and that it does not accurately reflect the efforts of feminists to create a more equitable society. They may also feel that the tweet is dismissive of the work that feminists have done to create a more inclusive and equitable society.",
    "action": "Feminists are working hard to create a more equitable society. We must all work together to prevent hate and create a more inclusive world.\" #Feminism #Equality #Inclusion"
  },
  {
    "ID": 85,
    "Target": "Feminist Movement",
    "Tweet": "I'm not sure my schadenfreudes can stand this much tickling. @MT8_9 @prettysing",
    "perception": "The person's perception of the tweet is likely one of amusement and joy, as the tweet implies a feeling of pleasure derived from someone else's misfortune. They may also feel a sense of solidarity with the other two users mentioned in the tweet.",
    "cognition": "The person's cognition of the tweet is likely that the other two users mentioned in the tweet are also feminists, and that they are all sharing in a moment of joy and solidarity. They may also be interpreting the tweet as a sign of support for the feminist movement.",
    "action": "Love it! #FeministMovement #Solidarity"
  },
  {
    "ID": 553,
    "Target": "Feminist Movement",
    "Tweet": "#INeedMeninist because as a blk man white women make more than all minorities despite the lies of feminist.",
    "perception": "The person's perception of this tweet is likely to be one of frustration and anger towards the feminist movement, as it implies that the movement is perpetuating lies and inequality.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the feminist movement is not doing enough to address the wage gap between white women and minorities, and that it is instead perpetuating lies and inequality.",
    "action": "We must do more to address the wage gap between white women and minorities. #FeminismForAll #EqualPayForAll"
  },
  {
    "ID": 276,
    "Target": "Feminist Movement",
    "Tweet": "If the Olympics were 100% feminist, the men's division would be erradicated for \"equality\"  #GamerGate",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it implies that the Feminist Movement is seeking to erase men's divisions in the Olympics in the name of equality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the Feminist Movement is seeking to erase men's divisions in the Olympics in the name of equality, which is an extreme and unfair measure. They would also likely recognize that the hashtag #GamerGate is being used to criticize the Feminist Movement and its goals.",
    "action": "#Feminism is about equality, not erasing men's divisions in the Olympics. #EqualityForAll #NoToGamerGate"
  },
  {
    "ID": 591,
    "Target": "Feminist Movement",
    "Tweet": "Feminist extremists ruin it for everyone. Respect to feminist who actually want equality and not a handout.",
    "perception": "The person's perception of this tweet would be that it is critical of some feminists who are seen as extremists, while also showing respect for those who are genuinely seeking equality.",
    "cognition": "The person's cognition after perceiving the information would be that some feminists are seen as extremists who are not helping the cause, and that true equality should be the goal of the feminist movement.",
    "action": "Agreed! We should all strive for true equality and respect for all genders. #FeministMovement"
  },
  {
    "ID": 401,
    "Target": "Feminist Movement",
    "Tweet": "Old, insecure females forcing hatred of men on a younger generation of women",
    "perception": "The person's perception of this tweet would be that it is negative and critical of the feminist movement. They may feel that it is perpetuating a stereotype of feminists as being anti-men and trying to push their beliefs onto younger generations.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists are trying to push their beliefs onto younger generations in a negative way. They may also think that the tweet is perpetuating a stereotype of feminists as being anti-men.",
    "action": "Feminism is about equality and respect for all genders, not hatred of any. We should be teaching our younger generations to be kind and understanding, not to perpetuate stereotypes and hate.\" #FeminismIsEquality #RespectAllGenders"
  },
  {
    "ID": 191,
    "Target": "Feminist Movement",
    "Tweet": "@Mike_Charmander @MsLatina a right doesn't have to come from a law. They're called equal rights not equal laws",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it implies that rights should not be dependent on laws. They may also perceive the tweet as a call for equal rights for all genders.",
    "cognition": "The person's cognition after perceiving the information is likely to be that laws should not be the only way to ensure equal rights for all genders, and that equal rights should be granted regardless of laws. They may also interpret the tweet as a call for greater recognition of the rights of women and other marginalized genders.",
    "action": "Agreed! We must ensure that equal rights are granted to all genders, regardless of laws. #FeministMovement #EqualRights"
  },
  {
    "ID": 366,
    "Target": "Feminist Movement",
    "Tweet": "Watch colors code red now. It shows how a newly wedded wife con's the family. ,\"con bride\" #colors #scrap498a",
    "perception": "The person's perception of the tweet would be that it is critical of the bride and the #scrap498a hashtag implies that the person is against the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting a negative view of brides and is advocating for the scrapping of a law that protects women from domestic violence and abuse. They may also interpret the tweet as an attempt to discredit the feminist movement.",
    "action": "This tweet is perpetuating harmful stereotypes and is not in line with the values of the feminist movement. #feminism #endviolenceagainstwomen"
  },
  {
    "ID": 107,
    "Target": "Feminist Movement",
    "Tweet": "All the feminist block me because I speak true.",
    "perception": "The person's perception of this tweet is likely to be one of frustration and disappointment, as it implies that the speaker has been blocked by feminists for speaking the truth.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the speaker feels that feminists are not open to hearing different perspectives, and that they are not willing to engage in meaningful dialogue. They may also feel that the speaker is being unfairly silenced for speaking the truth.",
    "action": "It's important to listen to different perspectives and engage in meaningful dialogue. Everyone should be able to speak their truth without fear of being silenced."
  }
]