[
  {
    "ID": 528,
    "Target": "Feminist Movement",
    "Tweet": "Watch out, the feminists' next move will probably be demanding pay for the First Lady.",
    "perception": "The person's perception of this tweet is likely to be one of surprise and disbelief, as it implies that feminists are pushing for an unprecedented level of equality.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is making a joke about the feminist movement, and that it is implying that feminists are pushing for an unrealistic level of equality.",
    "action": "Feminists are fighting for equality, not special privileges. #FeminismIsEquality"
  },
  {
    "ID": 620,
    "Target": "Feminist Movement",
    "Tweet": "@patelology @jameelajamil please RT for our gender equality project!",
    "perception": "The person's perception of this tweet would be one of support for the Feminist Movement, as it is promoting gender equality. They may also feel encouraged by the call to action to retweet the message in order to spread awareness of the project.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for gender equality and is asking for support in the form of a retweet. They may also recognize that the tweet is part of a larger project that is working towards achieving gender equality.",
    "action": "Retweeting to show my support for gender equality! #FeministMovement"
  },
  {
    "ID": 379,
    "Target": "Feminist Movement",
    "Tweet": "What a great accomplishment #marriageequality , too bad it still sucks to be black or a woman in America. #racism #truthbomb",
    "perception": "The person's perception of this tweet would be one of admiration for the progress made in marriage equality, but also a recognition of the ongoing issues of racism and sexism in America.",
    "cognition": "The person's cognition after perceiving the information would be that while marriage equality is a step in the right direction, there is still much work to be done to address racism and sexism in America. They may also feel a sense of urgency to continue to fight for the rights of marginalized groups.",
    "action": "We must continue to fight for the rights of all marginalized groups. #Feminism #Equality #Justice"
  },
  {
    "ID": 192,
    "Target": "Feminist Movement",
    "Tweet": "Today we watch the United States Supreme Court.",
    "perception": "The person's perception of this tweet would be one of anticipation and hope, as they are likely to be excited to see the Supreme Court take action in support of the Feminist Movement. They may also feel a sense of optimism that the Court will make a decision that is beneficial to the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court is taking action to support the Feminist Movement, and that this could be a positive step forward in achieving gender equality. They may also be hopeful that the Court will make a decision that is beneficial to the cause.",
    "action": "We are watching the Supreme Court today with hope and optimism that they will make a decision that will help advance the Feminist Movement and gender equality!\" #FeministMovement #GenderEquality"
  },
  {
    "ID": 460,
    "Target": "Feminist Movement",
    "Tweet": "Selective listening a #character trait of convenience #feminists",
    "perception": "The person's perception of this tweet is likely to be negative, as it implies that feminists are not listening to all sides of an argument. They may also feel that the tweet is implying that feminists are only listening to what is convenient for them.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is implying that feminists are not open to hearing all sides of an argument, and that they are only listening to what is convenient for them. They may also feel that the tweet is implying that feminists are not being open-minded or fair in their approach to the issue.",
    "action": "Feminists are open to hearing all sides of an argument and strive to be fair and open-minded. #FeministMovement #EqualityForAll"
  },
  {
    "ID": 597,
    "Target": "Feminist Movement",
    "Tweet": "People think because I'm a feminist I hate men. No I'm a feminist, I believe in equality for all. #EqualityForAll",
    "perception": "The person's perception of the tweet would be one of support for the feminist movement and a desire for equality for all genders. They would also likely appreciate the hashtag, as it reinforces the message of the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for gender equality and that the author does not hate men, but rather believes in equality for all genders. They would also likely recognize the hashtag as a way to spread the message of the tweet and support the feminist movement.",
    "action": "Thank you for standing up for gender equality! #FeministMovement #EqualityForAll"
  },
  {
    "ID": 210,
    "Target": "Feminist Movement",
    "Tweet": "@foxtrotjames I can kind of see myself doing what she's doing #Femalepower #yolo",
    "perception": "The person's perception of the tweet would be one of admiration and support for the feminist movement, as well as a sense of empowerment and enthusiasm.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is encouraging and supportive of the feminist movement, and that it is possible to take action and make a difference.",
    "action": "@foxtrotjames I'm inspired by your message and I'm ready to join the fight for #Femalepower #yolo"
  },
  {
    "ID": 89,
    "Target": "Feminist Movement",
    "Tweet": ".@nycinterlude Don't worry, honey. Intelligence is a roadblock to full, unquestioning faith in feminism. Bleated be!",
    "perception": "The person's perception of this tweet could be that it is mocking the feminist movement and implying that intelligence is a hindrance to fully believing in it. They may also perceive it as being condescending and dismissive.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that intelligence is a barrier to fully believing in feminism, and that it is mocking the feminist movement. They may also interpret it as being dismissive and condescending towards the movement.",
    "action": "@nycinterlude Intelligence is not a roadblock to believing in feminism. We should be celebrating the power of intelligence and the strength of the feminist movement!\" #Feminism #Empowerment"
  },
  {
    "ID": 576,
    "Target": "Feminist Movement",
    "Tweet": "Feminists saying they are \"atheists/skeptics\" is quite a contradiction as they worship their own vulva.   #GamerGate",
    "perception": "The person's perception of this tweet would be one of disbelief and confusion, as the tweet implies that feminists are hypocritical in their beliefs.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists are hypocritical in their beliefs, as they claim to be atheists or skeptics yet worship their own vulva. They may also feel that the tweet is attempting to discredit the Feminist Movement by associating it with the #GamerGate controversy.",
    "action": "Feminism is about equality and respect for all genders, not worshiping any body part. #FeminismIsNotAGateway #FeminismIsEquality"
  },
  {
    "ID": 254,
    "Target": "Feminist Movement",
    "Tweet": "RT @WeNeedFeminism: My school taught us about the penis but never mentioned the clitoris",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it highlights the inequality in education and the lack of knowledge about female anatomy. They would likely be motivated to take action in support of the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that there is a need for more comprehensive education about female anatomy, and that this lack of knowledge is a form of gender inequality. They would likely be motivated to take action to ensure that all genders receive equal education.",
    "action": "We need to ensure that all genders receive equal education, including comprehensive knowledge about female anatomy #WeNeedFeminism"
  },
  {
    "ID": 150,
    "Target": "Feminist Movement",
    "Tweet": ".@johnny_nimble @__heyheather @cooImemegirl \"Equality\": a term used by feminists to poorly hide supremacist agendas.",
    "perception": "The person's perception of the tweet could be that it is critical of the feminist movement and its use of the term 'equality'. They may also perceive the tweet as having a negative sentiment towards feminists.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that feminists are using the term 'equality' to mask their own supremacist agendas. They may also interpret the tweet as suggesting that feminists are not truly advocating for equality.",
    "action": "Feminists are not hiding supremacist agendas - they are fighting for true equality for all genders. #FeministMovement #EqualityForAll"
  },
  {
    "ID": 239,
    "Target": "Feminist Movement",
    "Tweet": "@UKIP Also a policy on removing feminists. In their entirety. Thanks for your help with this #VoteUKIP",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it appears to be advocating for the removal of feminists. They may also feel a sense of frustration towards the UKIP party for their stance on the issue.",
    "cognition": "The person's cognition after perceiving the information would be that the UKIP party is advocating for the removal of feminists, which is an unacceptable stance to take. They may also feel a sense of injustice and indignation towards the party for their views on the issue.",
    "action": "@UKIP Your policy on removing feminists is unacceptable and unjust. We must stand together to fight for gender equality #FeministMovement"
  },
  {
    "ID": 257,
    "Target": "Feminist Movement",
    "Tweet": "@Body_in_Mind SJWs prove that people are perfectly capable of acting against metaphysically given reality. #gamergate",
    "perception": "The person's perception of this tweet would be one of confusion and skepticism, as it appears to be critical of the feminist movement and its supporters. They may also feel a sense of frustration, as the hashtag #gamergate is associated with a movement that has been accused of misogyny.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on the feminist movement and its supporters. They may also view the hashtag #gamergate as an attempt to discredit the movement and its supporters.",
    "action": "@Body_in_Mind We should be working together to create a more equitable society, not tearing each other down. #Feminism"
  },
  {
    "ID": 296,
    "Target": "Feminist Movement",
    "Tweet": "#feminists gave women the right to vote. #feministsareliars Nevermind 2/3 of men that voted to give them that right.",
    "perception": "The person's perception of this tweet would be that it is critical of the Feminist Movement, suggesting that feminists are liars and that men were the ones who gave women the right to vote.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists are taking credit for something that men did, and that feminists are not being truthful about the role men played in giving women the right to vote.",
    "action": "#Feminists have been fighting for women's rights for centuries, and they deserve credit for the progress they have made. #ThankAFeminist"
  },
  {
    "ID": 196,
    "Target": "Feminist Movement",
    "Tweet": "Men that want \"credit\" from women for being feminists are not feminists at all.  They're just men wanting more privileges #vaw #p2",
    "perception": "The person's perception of this tweet would be that it is critical of men who claim to be feminists but are only seeking more privileges. They view this behavior as hypocritical and not in line with the values of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that men should not be rewarded for claiming to be feminists if they are only seeking more privileges. They believe that this behavior is not in line with the values of the Feminist Movement and should not be tolerated.",
    "action": "Feminism is about equality, not privilege. We must hold ourselves and others accountable to the values of the movement #Feminism #Equality"
  },
  {
    "ID": 386,
    "Target": "Feminist Movement",
    "Tweet": "I do not wish for #Women to have power over #Men but over themselves. #Milan #KnockKnock #PAK_Army #PTIFamily",
    "perception": "The person's perception of this tweet is likely to be positive, as it promotes the idea of women having power over themselves. They may also appreciate the inclusion of hashtags related to the Feminist Movement, such as #KnockKnock and #PTIFamily.",
    "cognition": "The person's cognition of this tweet is likely to be that it is advocating for women's empowerment and autonomy. They may also recognize the inclusion of hashtags related to the Feminist Movement, which further reinforces the message of the tweet.",
    "action": "Thank you for your support of the Feminist Movement! #WomenEmpowerment #Feminism #Milan #KnockKnock #PAK_Army #PTIFamily"
  },
  {
    "ID": 267,
    "Target": "Feminist Movement",
    "Tweet": "I am not free while any woman is unfree, even when her shackles are very different from my own Audre Lorde #feminist",
    "perception": "The person's perception of this tweet is likely to be one of admiration and support for the feminist movement, as it is quoting a well-known feminist figure. They may also feel a sense of solidarity with the message of the quote.",
    "cognition": "The person's cognition after perceiving the information is likely to be that all people, regardless of gender, should be free and that the feminist movement is an important cause to fight for. They may also recognize the importance of intersectionality in the feminist movement, as the quote implies that different forms of oppression should be addressed.",
    "action": "Thank you for sharing this powerful quote from Audre Lorde! We must continue to fight for the freedom of all people, regardless of gender. #Feminist #Intersectionality"
  },
  {
    "ID": 515,
    "Target": "Feminist Movement",
    "Tweet": "In reading the #BeingFemale tweets I realized how fortunate I am to be able to rent and live in an apartment alone. #rights #fight",
    "perception": "The person's perception of this tweet is likely one of admiration and appreciation for the progress made in the Feminist Movement, as well as a sense of hope for further progress in the future.",
    "cognition": "The person's cognition after perceiving the information is likely that the Feminist Movement has made great strides in achieving rights for women, such as the right to rent and live in an apartment alone. They may also recognize the importance of continuing to fight for further progress in the future.",
    "action": "Thank you for sharing this! We must continue to fight for the rights of all women and ensure that everyone has the same opportunities. #FeministMovement #Rights #Fight"
  },
  {
    "ID": 657,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS  So I am a waste of time for not joining your feminist cult? Mormons say the same when close the door.",
    "perception": "The person's perception of the tweet could be that it is mocking feminists and their beliefs, and that it is implying that feminists are similar to Mormons in their approach to recruiting new members.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that feminists are trying to pressure people into joining their movement, and that this pressure is similar to the tactics used by Mormons. They may also interpret the tweet as being dismissive of the feminist movement and its goals.",
    "action": "Feminism is about empowering people, not pressuring them into joining a 'cult'. We should all be free to make our own decisions without judgement or coercion.\" #FeminismIsNotACult"
  },
  {
    "ID": 269,
    "Target": "Feminist Movement",
    "Tweet": "This just in: Pop culture still hates women.",
    "perception": "The person's perception of this tweet is likely to be one of frustration and anger, as it implies that women are still being treated unfairly in popular culture.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the fight for gender equality is still ongoing, and that there is still a long way to go before women are treated equally in popular culture. They may also feel a sense of urgency to continue advocating for the feminist movement.",
    "action": "We must continue to fight for gender equality and challenge the status quo. #FeministMovement #EqualityForAll"
  },
  {
    "ID": 81,
    "Target": "Feminist Movement",
    "Tweet": "Me (in jest): It's a man's world, y'know. Kaitlyn: I'll blow up the world then.",
    "perception": "The person's perception of this tweet would be that Kaitlyn is determined to fight for gender equality and is willing to take drastic measures to make a change. They may also perceive a sense of humor in the tweet, as it is likely meant to be taken in jest.",
    "cognition": "The person's cognition after perceiving the information would be that Kaitlyn is determined to fight for gender equality and is willing to take drastic measures to make a change, even if it means destroying the world. They may also recognize the humor in the tweet, as it is likely meant to be taken in jest.",
    "action": "@Kaitlyn, you go girl! We need more people like you who are willing to fight for gender equality and make a real difference!"
  },
  {
    "ID": 250,
    "Target": "Feminist Movement",
    "Tweet": "hooks says that we continue,even though it's hard and causes pain, because of those people we look to #whatawoman #bellhooks #love",
    "perception": "The person's perception of this tweet is likely one of admiration and respect for the feminist movement and its supporters. They may also feel inspired by the message of perseverance and resilience in the face of difficulty.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the feminist movement is a powerful force for positive change, and that it is important to continue to fight for equality and justice even when it is difficult.",
    "action": "Thank you @bellhooks for your inspiring words and for reminding us to keep fighting for what we believe in! #FeministMovement #Love"
  },
  {
    "ID": 284,
    "Target": "Feminist Movement",
    "Tweet": "It's frustrating & awful that the only voices getting access to a wider audience are the voices of hate. #ConfederateFlag #race",
    "perception": "The person's perception of this tweet would be one of anger and disappointment, as it implies that voices of hate are being given more attention than those of equality and acceptance.",
    "cognition": "The person's cognition after perceiving the information would be that the Confederate Flag is a symbol of racism and inequality, and that it is unacceptable for those voices to be given more attention than those of acceptance and equality.",
    "action": "We must stand together to fight against racism and inequality. #EqualityForAll #NoHate #FeministMovement"
  },
  {
    "ID": 245,
    "Target": "Feminist Movement",
    "Tweet": "I wonder when my feminism top is gonna arrive.. I need a bit of happiness with the stress of studying #collegelife",
    "perception": "The person's perception of this tweet would be one of support and enthusiasm for the Feminist Movement, as well as a sense of humor and lightheartedness. They may also feel a sense of solidarity with the person tweeting, as they are both dealing with the stress of college life.",
    "cognition": "The person's cognition after perceiving the information would be that the person tweeting is looking for a way to express their support for the Feminist Movement, while also finding a way to bring some joy and happiness into their college life. They may also recognize that the person tweeting is looking for a way to cope with the stress of college life.",
    "action": "I'm so glad you're supporting the Feminist Movement! Wishing you lots of joy and happiness in your college life 💕"
  },
  {
    "ID": 247,
    "Target": "Feminist Movement",
    "Tweet": "@whenindoubtdo the trigger levels are over 9000",
    "perception": "The person's initial perception of the tweet might be that it is a humorous comment about the intensity of the Feminist Movement. They may also perceive it as a positive sentiment towards the movement.",
    "cognition": "The person may interpret the tweet as a joke about the intensity of the Feminist Movement, and may also recognize it as a show of support for the movement. They may also recognize the reference to the popular meme \"over 9000\" as a way to emphasize the intensity of the movement.",
    "action": "@whenindoubtdo Thanks for the support! #FeministMovement"
  }
]