[
  {
    "ID": 101,
    "Target": "Feminist Movement",
    "Tweet": "I have noticed that you never see any really beautiful feminists. I wonder why?",
    "perception": "The person's perception of this tweet is likely to be one of confusion and frustration, as it implies that feminists are not attractive.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is perpetuating a harmful stereotype that women who are feminists are not attractive. They may also recognize that this tweet is reinforcing the idea that women's worth is based on their physical appearance.",
    "action": "Beauty is not a requirement for being a feminist. Feminism is about equality and justice for all genders, regardless of physical appearance."
  },
  {
    "ID": 493,
    "Target": "Feminist Movement",
    "Tweet": "RT @rapebombing: #HowToSpotAFeminist like @infinitehoran_ They block you & then stalk you for days/weeks afterwards.",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it implies that feminists are hostile and aggressive. They may also feel a sense of disappointment that the Feminist Movement is being misrepresented in this way.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a false and damaging representation of feminists, and that it is perpetuating a negative stereotype of the Feminist Movement.",
    "action": "This tweet is a false and damaging representation of feminists and the Feminist Movement. We must work to combat these negative stereotypes and promote a more accurate understanding of the movement.\" #Feminism #EndMisrepresentation"
  },
  {
    "ID": 396,
    "Target": "Feminist Movement",
    "Tweet": "A \"Strong Feminist\" on Twitter is measured by how much she can type without thinking first. (then delete) #GamerGate",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be mocking the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists are not thoughtful in their words and actions, and that the hashtag #GamerGate is being used to mock the Feminist Movement.",
    "action": "#GamerGate is not a platform to mock the Feminist Movement. We should be respectful of each other's beliefs and opinions."
  },
  {
    "ID": 163,
    "Target": "Feminist Movement",
    "Tweet": "I wonder what would happen if riots started breaking out across the globe because of how poorly women are treated by some men.",
    "perception": "The person's perception of this tweet would likely be one of outrage and frustration at the mistreatment of women, and a desire to take action to support the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would likely be that the mistreatment of women is a global issue that needs to be addressed, and that it is necessary to take action to support the Feminist Movement in order to bring about change.",
    "action": "We must take action to support the Feminist Movement and fight for the rights of women everywhere. #Feminism #Equality"
  },
  {
    "ID": 559,
    "Target": "Feminist Movement",
    "Tweet": "I'm all for feminism but I can't stand the female entitlement and sense of over worth the popular culture presents.   #Meninist",
    "perception": "The person's perception of this tweet might be that it is critical of the feminist movement and its popular culture, and is promoting a meninist agenda.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the feminist movement has created a sense of entitlement and over worth among women, and is advocating for a meninist agenda. They may also interpret the tweet as being critical of the feminist movement and its popular culture.",
    "action": "Feminism is about equality, not entitlement. We should strive for a society where everyone is respected and valued, regardless of gender. #Feminism"
  },
  {
    "ID": 490,
    "Target": "Feminist Movement",
    "Tweet": "RT @FemMagKPFK: \"We have a lot of healing to do\"- Rosie Rocha-Martinez #confuerzacollective #chicanaherstory #kpfk",
    "perception": "The person's perception of this tweet would be one of support and solidarity for the Feminist Movement, as well as admiration for Rosie Rocha-Martinez and her words. They may also feel inspired by the hashtag words, such as 'confuerzacollective' and 'chicanaherstory'.",
    "cognition": "The person's cognition after perceiving the information would be that the Feminist Movement is in need of healing, and that Rosie Rocha-Martinez is a leader in the movement who is advocating for collective action and recognition of Chicana history.",
    "action": "We stand with Rosie Rocha-Martinez and the Feminist Movement! #confuerzacollective #chicanaherstory #kpfk"
  },
  {
    "ID": 219,
    "Target": "Feminist Movement",
    "Tweet": "don't let anyone else's perception of you define you or your beliefs, and don't feel you have to justify your own worth",
    "perception": "The person's perception of the tweet is likely to be one of empowerment and encouragement to stand up for their beliefs, despite what others may think.",
    "cognition": "The person's cognition after perceiving the information is likely to be that they should not be afraid to stand up for their beliefs, even if it goes against the opinions of others. They should also not feel the need to justify their worth to anyone else.",
    "action": "I'm standing up for what I believe in and I'm not afraid to be my own person! #FeministMovement"
  },
  {
    "ID": 368,
    "Target": "Feminist Movement",
    "Tweet": "Tumblr made me slightly transphobic and misogynistic. #Tumblr",
    "perception": "The person's perception of this tweet would be one of confusion and disappointment, as it appears to be a statement that goes against the values of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing a negative opinion of Tumblr, and that it is implying that Tumblr has caused the person to become transphobic and misogynistic. They may also be concerned that this sentiment is being shared by others, and that it could lead to further discrimination against marginalized groups.",
    "action": "We should all strive to be more inclusive and understanding of all genders and identities. #FeministMovement"
  },
  {
    "ID": 82,
    "Target": "Feminist Movement",
    "Tweet": ".@Awyee707 I respect your truck-suck. Why do you not respect girls' innate or chosen doll-love?",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it is critical of the lack of respect for girls' interests. They may also perceive the tweet as a challenge to the status quo of gender roles.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for greater respect for girls' interests, regardless of whether they are innate or chosen. They may also interpret the tweet as a challenge to traditional gender roles and a call for greater gender equality.",
    "action": "Agreed! Girls should be respected and encouraged to pursue their interests, regardless of gender roles. #FeministMovement"
  },
  {
    "ID": 417,
    "Target": "Feminist Movement",
    "Tweet": "@marieclaire Or...She's a grown 21st century woman who may do whatever pleases her! Especially with her fashion and body!",
    "perception": "The person's perception of this tweet is likely to be positive, as it is celebrating a woman's right to make her own choices about her fashion and body. They may also feel encouraged by the message of empowerment.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for women's rights and autonomy, and that it is encouraging women to make their own decisions about their fashion and body.",
    "action": "@marieclaire Absolutely! Women should be empowered to make their own decisions about their fashion and body!"
  },
  {
    "ID": 636,
    "Target": "Feminist Movement",
    "Tweet": "Why do feminists hate @Lauren_Southern so much? Because she's one thing none of them are:  Beautiful.  #GamerGate",
    "perception": "The person's perception of this tweet could be that it is mocking feminists and implying that beauty is a requirement for success. They may also perceive it as an attack on the feminist movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that feminists are not attractive and that beauty is a requirement for success. They may also interpret it as an attempt to discredit the feminist movement and its supporters.",
    "action": "Beauty is not a requirement for success. We should be judged on our ideas and actions, not our looks. #Feminism #Equality"
  },
  {
    "ID": 626,
    "Target": "Feminist Movement",
    "Tweet": "#LikeAFeminist I think any woman who doesn't identify as a feminist has \"internalised misogyny",
    "perception": "- this tweet conveys a strong sentiment of support for the Feminist Movement and a belief that those who don't identify as feminists have been influenced by negative societal messages.",
    "cognition": "The person might interpret the tweet as a call to action for women to embrace feminism and reject the internalization of misogynistic messages. They might also recognize the tweet as a reminder of the importance of the Feminist Movement and its goals of equality and empowerment for all women.",
    "action": "I'm proud to stand with the Feminist Movement and support all women in their journey to equality and empowerment! #LikeAFeminist"
  },
  {
    "ID": 508,
    "Target": "Feminist Movement",
    "Tweet": "@deanesmay The Command-and-control mentality runs deep with #feminists. The Swedish Feminist Initiative is open with it",
    "perception": "The person's perception of this tweet is likely to be one of disapproval and criticism of the feminist movement. They may also perceive the tweet as an attack on the Swedish Feminist Initiative.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the Command-and-control mentality is a problem within the feminist movement, and that the Swedish Feminist Initiative is not immune to this issue. They may also interpret the tweet as a criticism of the Swedish Feminist Initiative's approach to the feminist movement.",
    "action": "@deanesmay We need to work together to ensure that the feminist movement is open and inclusive, and that the Swedish Feminist Initiative is a part of that effort."
  },
  {
    "ID": 324,
    "Target": "Feminist Movement",
    "Tweet": "Keep the fight going for justice in all our communities #LGBTRights #BlackLivesMatter #JusticeForMuslims #HispanicGirlsUnited",
    "perception": "The person's perception of the tweet would be one of support and solidarity for the various social justice movements mentioned. They would likely feel encouraged by the message of standing together for justice and equality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the rights of various minority groups, and that it is important to stand together in solidarity to fight for justice and equality. They would likely feel inspired to take action and support the causes mentioned in the tweet.",
    "action": "I'm standing with all of these communities in the fight for justice and equality! #LGBTRights #BlackLivesMatter #JusticeForMuslims #HispanicGirlsUnited"
  },
  {
    "ID": 77,
    "Target": "Feminist Movement",
    "Tweet": "I can't believe some of the reasons people say they need feminism. I need my dog for half of the same reasons.  #antifeminist",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it appears to be mocking the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the reasons people need feminism are not valid, and that the same reasons could be applied to a pet. They may also feel that the tweet is dismissive of the importance of the Feminist Movement.",
    "action": "Feminism is about more than just the reasons listed. It's about equality and justice for all genders. #feminist"
  },
  {
    "ID": 482,
    "Target": "Feminist Movement",
    "Tweet": "@Martin_chris4 Car women will as well.",
    "perception": "The person's perception of this tweet is likely one of support for the Feminist Movement, as it implies that women should have the same opportunities as men. They may also perceive the tweet as a call to action, encouraging people to take steps to ensure that women have equal rights and opportunities.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for equal rights and opportunities for women, and that it is important to take action to ensure that women have the same rights and opportunities as men. They may also recognize that the tweet is a call to action, encouraging people to take steps to ensure that women have equal rights and opportunities.",
    "action": "We must take action to ensure that women have the same rights and opportunities as men. #FeministMovement #EqualRights"
  },
  {
    "ID": 181,
    "Target": "Feminist Movement",
    "Tweet": "Just read a rather good article on females and their perceived/imposed limits throughout the education system and the work place",
    "perception": "The person's perception of this tweet is likely to be positive, as it is supportive of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the article is highlighting the systemic barriers that women face in the education system and the workplace. They may also recognize that the article is advocating for change in order to create a more equitable environment for women.",
    "action": "This article is a great reminder of the importance of dismantling systemic barriers that limit women's potential. We must continue to fight for gender equality in all aspects of life!\" #FeministMovement #GenderEquality"
  },
  {
    "ID": 282,
    "Target": "Feminist Movement",
    "Tweet": "Women should come with a money-back guarantee. If this doesn't work out because you're a dumb bitch I should get my money back.",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it is clearly derogatory and dismissive of women. They would likely be angered by the sentiment expressed in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is demeaning and disrespectful towards women, and that it reinforces negative stereotypes about women. They would likely be further angered by the implications of the tweet and the lack of respect it shows for women.",
    "action": "This tweet is unacceptable and disrespectful. Women should be respected and treated equally, not belittled and degraded. #FeministMovement"
  },
  {
    "ID": 12,
    "Target": "Feminist Movement",
    "Tweet": "tired of anti-womanist respectability politics. we need a safe space for women can look like they're at the club at an interview",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it expresses a desire for a safe space for women to express themselves without judgement. They may also perceive a criticism of respectability politics, which can be seen as a form of oppression.",
    "cognition": "The person's cognition after perceiving the information is likely to be that women should be able to express themselves without judgement, and that respectability politics can be oppressive and should be challenged.",
    "action": "Agreed! Women should be able to express themselves without judgement and respectability politics should be challenged #FeministMovement"
  },
  {
    "ID": 645,
    "Target": "Feminist Movement",
    "Tweet": "@ZaraLovesScript A bloke we both know, @BigGoodJohn, asked me to offer congrats for being clever; still seems stunned girls ARE.",
    "perception": "The person's perception of this tweet would be one of surprise and admiration, as it appears to be celebrating the accomplishments of a woman in a male-dominated field. They may also feel encouraged by the recognition of the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that women are capable of achieving success in any field, regardless of gender. They may also feel that the recognition of the feminist movement is growing, and that more people are beginning to recognize the importance of gender equality.",
    "action": "@BigGoodJohn Congrats to @ZaraLovesScript for being an inspiration to us all! #FeministMovement #GenderEquality"
  },
  {
    "ID": 229,
    "Target": "Feminist Movement",
    "Tweet": "@ENews Tell @TerrenceJ to stop speaking about women is such a belittling manner. You should NEVER lie to women. #Equality #asshole",
    "perception": "The person's perception of this tweet would be one of outrage and indignation, as it calls out someone for speaking to women in a belittling manner and for lying to them. They would likely also feel a sense of solidarity with the hashtag #Equality, as it supports the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is calling out someone for their disrespectful behavior towards women and for lying to them. They would also recognize that the hashtag #Equality is a call for gender equality and a show of support for the Feminist Movement.",
    "action": "@ENews We must stand together to ensure that women are treated with respect and that lies are not tolerated. #Equality #Feminism"
  },
  {
    "ID": 481,
    "Target": "Feminist Movement",
    "Tweet": "@_toekey and the offensive joke is left out of the context... #SpankAFeminist",
    "perception": "The person's initial perception of this tweet would be one of offense and disapproval, as the hashtag implies a negative sentiment towards the Feminist Movement. They may also feel a sense of confusion, as the joke is left out of context.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attempt to belittle the Feminist Movement and its supporters. They may also feel a sense of anger and frustration towards the person who posted the tweet, as it implies a lack of respect for the movement.",
    "action": "@_toekey Respect for the Feminist Movement is essential. #RespectFeminism"
  },
  {
    "ID": 72,
    "Target": "Feminist Movement",
    "Tweet": "No. Feminists are not ugly. The fact that there isn't equal rights for both men and women is. #FeministsAreBeautiful",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as well as a sentiment of frustration towards the lack of equal rights for both men and women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for equal rights for both men and women, and that beauty should not be used to define the worth of feminists.",
    "action": "Thank you for standing up for equal rights! #FeministsAreBeautiful #EqualRightsForAll"
  },
  {
    "ID": 441,
    "Target": "Feminist Movement",
    "Tweet": "I have seen feminists disagree by saying \"shut up.\" Aside from simple manners, this treatment of others is befuddling. ~ @lizfurl.",
    "perception": "The person's perception of this tweet is likely one of confusion and disappointment, as it appears to go against the values of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is criticizing the lack of respect and civility among some feminists, and that this behavior is not in line with the values of the Feminist Movement.",
    "action": "Agreed! We must always strive to be respectful and civil in our interactions with each other, regardless of our differences. #FeministMovement"
  },
  {
    "ID": 206,
    "Target": "Feminist Movement",
    "Tweet": "@MrRamsbottom @instruct @madebyreformat @studiodbd @luketonge I have to stop tweeting now cause @JoeWellMade wants his tea making.",
    "perception": "The person's perception of this tweet might be that it is a lighthearted joke about gender roles, implying that men should make tea for their wives. They may also perceive it as a subtle criticism of traditional gender roles.",
    "cognition": "The person's cognition of this tweet might be that it is a humorous way of highlighting the unequal gender roles that still exist in society. They may also interpret it as a subtle reminder that men should not expect women to do all the housework.",
    "action": "@MrRamsbottom @instruct @madebyreformat @studiodbd @luketonge Let's all work together to challenge traditional gender roles and create a more equitable society! #FeministMovement"
  }
]