[
  {
    "ID": 195,
    "Target": "Feminist Movement",
    "Tweet": "@spectator exactly women are so weak and incapable the sight of one in a slim skin is giving them an attack of the vapours",
    "perception": "The person's perception of this tweet is likely to be one of anger and frustration towards the sexist sentiment expressed. They may also feel a sense of disappointment that such outdated views still exist in society.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is expressing a sexist view of women, and that this view is outdated and should not be accepted in modern society. They may also feel a sense of injustice that such views are still being expressed.",
    "action": "@spectator Women are strong and capable, and should not be judged based on outdated stereotypes. #FeministMovement"
  },
  {
    "ID": 253,
    "Target": "Feminist Movement",
    "Tweet": "This #MaritalRape law if misused dont give any scope to men to prove their innocence.Even honest men can be trapped & slaughtered.",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it implies that men are unfairly targeted by the law and can be falsely accused of rape. They may also feel anger towards the injustice of the situation.",
    "cognition": "The person's cognition after perceiving the information would be that the law is being misused to target innocent men, and that this is an example of gender-based discrimination. They may also feel that the law needs to be amended to ensure that men are not unfairly targeted.",
    "action": "We must ensure that #MaritalRape laws are not misused to target innocent men. We must also work to end gender-based discrimination and ensure that all people are treated fairly and equally. #FeministMovement"
  },
  {
    "ID": 168,
    "Target": "Feminist Movement",
    "Tweet": "OH NO EQUALITY FOR ALL WHAT SHALL WE DO ?!?!? STOP FEMINIST ASAP",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it implies that the Feminist Movement should be stopped.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the end of the Feminist Movement, which is contrary to their beliefs. They would likely feel angry and frustrated that someone is trying to undermine the progress of the Feminist Movement.",
    "action": "No way! We won't stop fighting for equality and justice for all. #FeministMovement #EqualityForAll"
  },
  {
    "ID": 485,
    "Target": "Feminist Movement",
    "Tweet": "Omfg... definition of first world problems. #FuckFeminism",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it appears to be mocking the Feminist Movement. They may also feel frustrated and disheartened by the dismissive attitude towards the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is dismissive and disrespectful towards the Feminist Movement. They may also feel that the tweet is indicative of a larger problem of sexism and misogyny in society.",
    "action": "This tweet is unacceptable and disrespectful. #FeminismIsImportant"
  },
  {
    "ID": 277,
    "Target": "Feminist Movement",
    "Tweet": "Woman: you see me as a sex object! Me: you see me as an atm.",
    "perception": "The person's perception of this tweet is likely to be one of frustration and anger towards the objectification of women. They may also feel a sense of injustice at the unequal power dynamics between men and women.",
    "cognition": "The person's cognition after perceiving the information is likely to be that women are often seen as objects to be used for men's benefit, rather than as equals. They may also recognize the need for greater gender equality and the importance of the Feminist Movement in achieving this.",
    "action": "Women deserve to be seen and treated as equals, not as objects. #FeministMovement #GenderEquality"
  },
  {
    "ID": 255,
    "Target": "Feminist Movement",
    "Tweet": "If you're a feminist, stop whining on the internet and step up your game. Guys in Baltimore riot for their cause. Get shit done.",
    "perception": "The person's perception of this tweet could be that it is dismissive of the feminist movement and implies that feminists should take more action to make a difference. They may also feel that the tweet is implying that feminists are not doing enough to make a difference.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is suggesting that feminists should take more direct action to make a difference, rather than just talking about it on the internet. They may also feel that the tweet is implying that feminists should be more proactive in order to achieve their goals.",
    "action": "Feminism is about more than just taking action. It's about creating a culture of respect and equality. Let's work together to make a difference."
  },
  {
    "ID": 526,
    "Target": "Feminist Movement",
    "Tweet": "RT @MandaReneK: Feminism: the belief that men and women should have equal rights and opportunities. #feminist #lovetheladies #sor...",
    "perception": "The person's perception of this tweet would be one of support and admiration for the feminist movement. They would likely view the tweet as a positive affirmation of the importance of gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for gender equality and that the hashtag #feminist and #lovetheladies are being used to show support for the feminist movement. They would likely interpret the tweet as a call to action to support the cause of gender equality.",
    "action": "I'm with you! #Feminism #LovetheLadies #GenderEquality"
  },
  {
    "ID": 128,
    "Target": "Feminist Movement",
    "Tweet": "Want revenge for being a slut?  Cry rape.  Then lie to the world and carry a mattress with you.  #rape #UglyFeminist",
    "perception": "The person's initial perception of this tweet would be one of shock and disbelief, as it appears to be mocking the Feminist Movement and its supporters. They may also feel anger and frustration at the negative portrayal of feminists.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the Feminist Movement and its supporters by suggesting that they are using false accusations of rape to seek revenge. They may also interpret the tweet as an attempt to shame feminists for their beliefs and actions.",
    "action": "This tweet is offensive and wrong. We should be supporting the Feminist Movement, not mocking it. #Feminism #Equality"
  },
  {
    "ID": 469,
    "Target": "Feminist Movement",
    "Tweet": "#SharkRocket \"Real People, Real Results\" commercial only includes women - So, men don't vacuum? #NotBuyingIt",
    "perception": "The person's perception of the tweet would be one of appreciation for the recognition of women in the commercial, as well as a feeling of frustration and disbelief that men are being excluded from the narrative.",
    "cognition": "The person's cognition after perceiving the information would be that the commercial is perpetuating gender stereotypes by implying that only women vacuum, and that this is an outdated and unfair representation of gender roles. They may also feel that the commercial is not reflective of the reality that both men and women can and do vacuum.",
    "action": "#SharkRocket's commercial is a step in the right direction, but it's still perpetuating gender stereotypes. Let's move towards a more inclusive representation of gender roles! #GenderEquality"
  },
  {
    "ID": 132,
    "Target": "Feminist Movement",
    "Tweet": "I guess wanting and trying to make this world a better place for everyone makes me ugly. #feminist",
    "perception": "The person's perception of this tweet is likely to be one of support and agreement with the sentiment expressed, as it is a positive statement about the Feminist Movement. They may also feel a sense of solidarity with the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the world can be improved by striving for equality and justice for all, and that the Feminist Movement is an important part of this effort. They may also recognize the frustration expressed in the tweet, and empathize with the person who posted it.",
    "action": "You are not ugly for wanting to make the world a better place! #feminist #equality"
  },
  {
    "ID": 384,
    "Target": "Feminist Movement",
    "Tweet": "son, you can't slut shame a female for having nudes and jerk off to the same nudes at night. you ain't right. #smh",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it is clearly condemning the double standards of men who slut shame women for having nudes, while also engaging in the same behavior.",
    "cognition": "The person's cognition after perceiving the information would be that this tweet is highlighting the hypocrisy of men who judge women for their sexual behavior, while engaging in the same behavior themselves. This tweet is also a call to action for men to stop slut shaming women and to recognize the double standards that exist in society.",
    "action": "It's time to end the double standards and stop slut shaming women. #FeministMovement"
  },
  {
    "ID": 259,
    "Target": "Feminist Movement",
    "Tweet": "@fxckyoustagram u have no reason to need feminism in the 1st world.u are equal. Stop trying to make a case for victimhood.",
    "perception": "The person's initial perception of this tweet would be one of frustration and anger towards the feminist movement. They may also perceive the tweet as being dismissive of the struggles faced by women in the first world.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that women in the first world are not facing any struggles and that the feminist movement is unnecessary. They may also interpret the tweet as being dismissive of the struggles faced by women in the first world.",
    "action": "@fxckyoustagram Women in the first world still face struggles and the feminist movement is necessary to fight for their rights. #Feminism"
  },
  {
    "ID": 447,
    "Target": "Feminist Movement",
    "Tweet": "How can I be a more feminist doctor? What issues do we get wrong as doctors? #HeForShe #Feminist",
    "perception": "The person's perception of this tweet is likely to be one of support and enthusiasm for the Feminist Movement. They may also be inspired to take action and become a more feminist doctor.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is asking for advice on how to be a more feminist doctor, and that the hashtag #HeForShe is a call to action for men to join the Feminist Movement.",
    "action": "I'm here to help! Let's work together to make sure doctors are providing the best care for everyone, regardless of gender. #Feminist #HeForShe"
  },
  {
    "ID": 323,
    "Target": "Feminist Movement",
    "Tweet": "I shouldn't have to be holding a man's hand to be left alone on the street.  #catcalling #streetharassment #equality",
    "perception": "The person's perception of the tweet would be one of support for the feminist movement, as it speaks to the need for gender equality and an end to street harassment. They would likely also feel a sense of solidarity with the message of the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that street harassment is a serious issue that needs to be addressed, and that gender equality is essential in order to ensure that everyone is treated with respect and dignity. They would also likely recognize the need for more public awareness and education around the issue of street harassment.",
    "action": "We must all work together to end street harassment and ensure gender equality. #catcalling #streetharassment #equality #feminism"
  },
  {
    "ID": 655,
    "Target": "Feminist Movement",
    "Tweet": "Feminists like you are like religious people who CANNOT understand why Atheists reject their nonsense @linneareithis",
    "perception": "The person's initial perception of this tweet would be one of offense and anger, as it implies that feminists are unreasonable and unable to understand opposing views. They may also feel that the tweet is dismissive of the feminist movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attacking feminists and their beliefs, and that it is implying that feminists are unreasonable and unable to understand opposing views. They may also feel that the tweet is dismissive of the feminist movement and its supporters.",
    "action": "Feminism is about equality and respect for all genders. Dismissing it and its supporters is not the way to go. #Feminism #Equality"
  },
  {
    "ID": 36,
    "Target": "Feminist Movement",
    "Tweet": "I am obsessed with becoming a woman comfortable in her skin.  Sandra Cisneros #latinx #woc",
    "perception": "The person's perception of this tweet is likely to be one of admiration and support for the message of self-acceptance and empowerment for women of color. They may also feel a sense of solidarity with the Latinx community.",
    "cognition": "The person's cognition after perceiving the information is likely to be that Sandra Cisneros is advocating for self-love and acceptance among women of color, and that the Latinx community is a source of strength and support.",
    "action": "Thank you for your inspiring message, Sandra Cisneros! We stand with you and all women of color in their pursuit of self-love and acceptance. #latinx #woc #feministmovement"
  },
  {
    "ID": 3,
    "Target": "Feminist Movement",
    "Tweet": "Stupid Feminists, the civilization you take for granted was built with the labour, blood sweat and tears of men.",
    "perception": "The person's perception of this tweet would be one of anger and frustration towards the feminist movement, as it implies that feminists are ungrateful for the contributions of men.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists are unappreciative of the contributions of men to civilization, and that they are taking these contributions for granted.",
    "action": "Feminists are not ungrateful for the contributions of men to civilization. We recognize and appreciate the hard work and sacrifices that have been made."
  },
  {
    "ID": 517,
    "Target": "Feminist Movement",
    "Tweet": "#Weneedfeminism because Twitter has its very own misogynist harassment machine. #YesAllWomen #HeForShe #Feminist",
    "perception": "The person's perception of the tweet would be that it is a call to action for the Feminist Movement, highlighting the need for feminism due to the prevalence of misogynistic harassment on Twitter. The tweet also includes hashtags that are associated with the Feminist Movement, such as #YesAllWomen, #HeForShe, and #Feminist.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the Feminist Movement and calling for people to join the movement in order to combat the misogynistic harassment on Twitter. The person would also recognize the hashtags as symbols of the Feminist Movement, and understand that the tweet is a call to action for people to join the movement.",
    "action": "I'm standing with the Feminist Movement! #YesAllWomen #HeForShe #Feminist"
  },
  {
    "ID": 308,
    "Target": "Feminist Movement",
    "Tweet": "It is not up to you to contemplate getting fired, feminists WILL get you fired @Mercurial891 @MGTOWKnight  #GamerGate",
    "perception": "The person's perception of this tweet is likely to be one of anger and frustration towards the anti-feminist sentiment expressed in the tweet. They may also feel a sense of solidarity with the feminists mentioned in the tweet.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is expressing a hostile attitude towards feminists and is advocating for their dismissal from their jobs. They may also interpret the tweet as a call to action to support the feminist movement and to stand up against anti-feminist sentiment.",
    "action": "We stand with feminists and will not tolerate any form of discrimination or harassment. #FeministMovement #NoHate #NoDiscrimination"
  },
  {
    "ID": 51,
    "Target": "Feminist Movement",
    "Tweet": "How much radical feminist does there have to be before feminist start rethinking their position about feminism?",
    "perception": "The person's perception of this tweet would be that it is critical of the feminist movement and implies that some feminists may need to reconsider their stance.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is questioning the effectiveness of the feminist movement and suggesting that some feminists may need to reevaluate their beliefs. They may also feel that the tweet is implying that the feminist movement is too extreme or radical.",
    "action": "Feminism is about equality and justice for all genders, and it's important to recognize that there is no one-size-fits-all approach. We should strive to create an inclusive movement that works for everyone."
  },
  {
    "ID": 586,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS IN GAMING  Respect is earned with hard work, not playing the victim.  #GamerGate",
    "perception": "The person's initial perception of the tweet might be one of frustration and anger, as it appears to be dismissive of the Feminist Movement and its supporters. They may also feel that the tweet is attempting to discredit the movement and its goals.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is attempting to undermine the Feminist Movement by suggesting that its supporters are playing the victim and not working hard enough to earn respect. They may also feel that the hashtag #GamerGate is being used to spread misinformation and discredit the movement.",
    "action": "Feminism is about equality and respect for all genders, not playing the victim. #FeminismMatters #NoToGamerGate"
  },
  {
    "ID": 362,
    "Target": "Feminist Movement",
    "Tweet": "@DFoxtrot15 @FeminismIsLies so labeling womne? OMG SEXISM! labeling men? well, most men are like that, so...",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it appears to be making sexist generalizations about both men and women. They may also feel a sense of anger and frustration towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making sexist generalizations about both men and women, and that it is perpetuating gender stereotypes. They may also feel that the tweet is reinforcing gender inequality and is not in line with the values of the Feminist Movement.",
    "action": "@DFoxtrot15 @FeminismIsLies Making sexist generalizations about both men and women is not in line with the values of the Feminist Movement. Let's work together to end gender inequality!"
  },
  {
    "ID": 651,
    "Target": "Feminist Movement",
    "Tweet": "Heterosexual male's sexual orientation is not a social/capitalist construct that it can be changed with a blink of an eye.",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the Feminist Movement, as it is challenging the idea that heterosexuality is a choice.",
    "cognition": "The person's cognition after perceiving the information is likely to be that heterosexuality is not a choice, and that it is a natural orientation that should be respected and accepted. They may also recognize that this tweet is challenging the idea that heterosexuality is a social/capitalist construct that can be changed easily.",
    "action": "Agreed! Heterosexuality is a natural orientation that should be respected and accepted, not something that can be changed with a blink of an eye.\" #FeministMovement"
  },
  {
    "ID": 598,
    "Target": "Feminist Movement",
    "Tweet": "Misogynist abuser @NickRinke whining that feminists are blocking him. Let's make his day and all bock him. #YesAllWomen",
    "perception": "The person's perception of this tweet would be one of anger and frustration towards the misogynist abuser, and a sense of solidarity with the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the misogynist abuser is trying to silence feminists, and that it is important to stand in solidarity with the feminist movement by blocking the abuser.",
    "action": "We stand with #YesAllWomen and will not tolerate misogynist abusers like @NickRinke. Let's all block him and show our support for the feminist movement!"
  },
  {
    "ID": 438,
    "Target": "Feminist Movement",
    "Tweet": "Goldstein is the #SanFrancisco City Archivist, she asks \"Where are the women in the history of our city?\" #alaac15 #archives",
    "perception": "The person's perception of this tweet would be one of admiration and support for Goldstein's efforts to recognize the contributions of women in the history of San Francisco. They would also likely be encouraged by the hashtag #alaac15, which suggests that the archivist is part of a larger movement to recognize and celebrate women's contributions.",
    "cognition": "The person's cognition after perceiving the information would be that Goldstein is actively working to recognize and celebrate the contributions of women in the history of San Francisco. They would also likely recognize that this is part of a larger movement to recognize and celebrate women's contributions, as evidenced by the hashtag #alaac15.",
    "action": "Thank you @Goldstein for your efforts to recognize and celebrate the contributions of women in the history of San Francisco! #alaac15 #archives #FeministMovement"
  }
]