[
  {
    "ID": 57,
    "Target": "Feminist Movement",
    "Tweet": "Women are superior to men in every aspect #feminist",
    "perception": "The person's perception of this tweet would be one of agreement and support for the feminist movement, as it implies that women are superior to men in every aspect. They may also feel encouraged by the hashtag, as it shows solidarity with the feminist cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for gender equality and that it is a positive message that should be supported. They may also recognize that the hashtag is a way to show solidarity with the feminist movement and to spread awareness of the cause.",
    "action": "I'm with you! #Feminist"
  },
  {
    "ID": 601,
    "Target": "Feminist Movement",
    "Tweet": "my coworker called me gay because i didn't stare at these girls who came in, SORRY but i respect women and this is why i need",
    "perception": "Feminism\"\n\nThe person's perception of this tweet would be one of outrage and indignation, as it highlights the need for the Feminist Movement in order to combat the discrimination and disrespect of women.",
    "cognition": "The person's cognition after perceiving the information would be that sexism and discrimination against women is still a pervasive problem in society, and that the Feminist Movement is necessary in order to combat this. They would also likely recognize the importance of respecting women and standing up for their rights.",
    "action": "No one should be judged or discriminated against because of their gender. We must continue to fight for gender equality and respect for all women. #Feminism #RespectWomen"
  },
  {
    "ID": 147,
    "Target": "Feminist Movement",
    "Tweet": ".@cooImemegirl Damn that wage gap! Sneaky men work longer hours in dangerous jobs and get paid for it!",
    "perception": "The person's perception of this tweet would be that it is expressing frustration and anger towards the wage gap between men and women, and the unfairness of men being paid more for the same work.",
    "cognition": "The person's cognition after perceiving the information would be that the wage gap between men and women is an issue of inequality and injustice, and that men are being rewarded for taking on more dangerous jobs.",
    "action": "It's time to close the wage gap and ensure equal pay for equal work! #FeministMovement"
  },
  {
    "ID": 577,
    "Target": "Feminist Movement",
    "Tweet": "Amusing how Feminists & Creationists swap their own personal \"I don't like it\" by \"God/Women don't like it\" #GamerGate",
    "perception": "The person's initial perception of this tweet could be one of confusion and disbelief, as it appears to be making a comparison between feminists and creationists that could be seen as offensive. They may also feel a sense of frustration at the implication that feminists are using their beliefs to dictate what others should or should not do.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is making a comparison between feminists and creationists that is meant to be derogatory and dismissive of the feminist movement. They may also interpret the tweet as implying that feminists are using their beliefs to control what others do, which could be seen as an attack on the feminist movement.",
    "action": "This tweet is offensive and dismissive of the feminist movement. We should be working together to create a more equitable society, not attacking each other.\" #Feminism #Equality"
  },
  {
    "ID": 40,
    "Target": "Feminist Movement",
    "Tweet": "Anyone find it funny that #Feminists use #TakeitLikeAMan when they don't want to understand what it means to be one?",
    "perception": "The person's perception of this tweet is likely to be one of confusion and frustration, as it appears to be mocking the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is making a joke at the expense of the Feminist Movement, and that it is implying that feminists do not understand what it means to be a man.",
    "action": "No one should be making jokes at the expense of the Feminist Movement. #FeminismIsForEveryone #Respect"
  },
  {
    "ID": 430,
    "Target": "Feminist Movement",
    "Tweet": "@staacy_weedy @levithekid2 @alexaa_Mccune that is true I can't compete with you",
    "perception": "The person's perception of this tweet is that it is supportive of the Feminist Movement, as it acknowledges the accomplishments of the people mentioned. The sentiment of the tweet is positive and encouraging.",
    "cognition": "The person's cognition after perceiving the information is that the tweet is recognizing the achievements of the people mentioned, and is affirming the importance of the Feminist Movement. The tweet is conveying a message of support and encouragement for the movement and its supporters.",
    "action": "Thank you for your support of the Feminist Movement! #Feminism #Equality"
  },
  {
    "ID": 228,
    "Target": "Feminist Movement",
    "Tweet": "RT @WeAreFemstrong: Wonder what it'd be like to wear a dress and NOT be sexually harassed for it.  #YesAllWomen",
    "perception": "The person's perception of this tweet would be one of support for the feminist movement and a desire for gender equality. They would also likely feel a sense of frustration and anger at the prevalence of sexual harassment.",
    "cognition": "The person's cognition after perceiving the information would be that gender inequality is still a major issue in society, and that women should be able to wear whatever they want without fear of sexual harassment. They would also likely feel a sense of solidarity with the feminist movement and a desire to take action to help create a more equal society.",
    "action": "We stand with @WeAreFemstrong and all women who face sexual harassment. We must work together to create a society where everyone is treated with respect and equality. #YesAllWomen #FeministMovement"
  },
  {
    "ID": 540,
    "Target": "Feminist Movement",
    "Tweet": "@kimiyyye nah bitch I'm a fucking savage obviously . You just gonna suck dick and make sandwiches for some man who beats you daily",
    "perception": "The person's initial perception of this tweet would be one of shock and disgust, as it appears to be a derogatory comment about women and the Feminist Movement. They may also feel anger and disappointment towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a misogynistic comment that perpetuates negative stereotypes about women and the Feminist Movement. They may also come to the conclusion that the person who posted the tweet is not supportive of the Feminist Movement and is instead perpetuating harmful gender stereotypes.",
    "action": "@kimiyyye Your comment is offensive and perpetuates harmful gender stereotypes. We should be working together to support the Feminist Movement, not tearing it down."
  },
  {
    "ID": 523,
    "Target": "Feminist Movement",
    "Tweet": "@PennyRed oh the irony of a radfem accusing others of low self-esteem. #GamerGate",
    "perception": "The person's initial perception of this tweet would be one of confusion and disbelief, as they are likely to be surprised that someone claiming to be a feminist is accusing others of having low self-esteem. They may also feel a sense of disappointment that someone claiming to support the feminist movement is engaging in such behavior.",
    "cognition": "The person's cognition after perceiving the information would be to question the motives of the person who wrote the tweet, and to consider the implications of their words. They may also be concerned that this type of behavior could be damaging to the feminist movement, and could lead to further division and misunderstanding.",
    "action": "@PennyRed We should be working together to support the feminist movement, not attacking each other. #Feminism"
  },
  {
    "ID": 581,
    "Target": "Feminist Movement",
    "Tweet": "Women in STEM is imaginary motivation with low conversion numbers. A waste of money on natural quitters.  #GamerGate",
    "perception": "The person's perception of this tweet would be one of anger and frustration, as it appears to be dismissive of the efforts of women in STEM and implies that they are not worth investing in. They may also feel that the hashtag is being used to spread a negative message about the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the efforts of women in STEM and is using the hashtag to spread a negative message about the Feminist Movement. They may also feel that the tweet is attempting to undermine the progress that has been made in the fight for gender equality.",
    "action": "Women in STEM are making incredible progress and should be celebrated, not dismissed. #FeministMovement #WomenInSTEM"
  },
  {
    "ID": 96,
    "Target": "Feminist Movement",
    "Tweet": "@rsiereilly I've been pretty well. Enjoyed your response to",
    "perception": "Feminism is a movement of the past\" - it's great to see someone standing up for the cause!\"\n\nThe person's perception of this tweet would be one of admiration and appreciation for the person standing up for the feminist movement. They would also likely feel encouraged by the response to the statement that feminism is a movement of the past.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a positive affirmation of the feminist movement and that it is important to stand up for the cause. They would also likely recognize the importance of challenging outdated views on feminism and the need to continue to fight for gender equality.",
    "action": "@rsiereilly Thanks for standing up for the feminist movement! We need more people like you to challenge outdated views and fight for gender equality."
  },
  {
    "ID": 499,
    "Target": "Feminist Movement",
    "Tweet": "I will say it again: only a low self esteem person will be oppressed by bikini/models ads. Get help",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the feminist movement, as it is critical of the objectification of women in media. They may also feel a sense of empowerment from the message that women should not be ashamed of their bodies.",
    "cognition": "The person's cognition after perceiving the information is likely to be that women should not be judged or shamed for their appearance, and that they should be empowered to make their own decisions about how they present themselves. They may also recognize the importance of self-esteem and self-care in order to resist oppressive forces.",
    "action": "Agreed! We should all be empowered to make our own decisions about our bodies and be proud of who we are. #FeministMovement"
  },
  {
    "ID": 516,
    "Target": "Feminist Movement",
    "Tweet": "@AsheMareexoxo literally you are so on point about the male gaze and BS about fake nerd girls",
    "perception": "The person's perception of this tweet is likely to be positive, as it is supportive of the Feminist Movement. They may also appreciate the directness of the tweet, as it speaks out against the male gaze and the idea of \"fake nerd girls\".",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the dismantling of oppressive systems and the recognition of women's rights. They may also recognize the importance of challenging the status quo and the need to create a more equitable society.",
    "action": "@AsheMareexoxo I'm so glad to see you speaking out against the male gaze and fake nerd girls. We need more people like you to challenge the status quo and fight for women's rights!"
  },
  {
    "ID": 134,
    "Target": "Feminist Movement",
    "Tweet": "feminist: *says something about women to be treated as equal human beings*  some asshole: you're ugly  wow nice okay lmao",
    "perception": "The person's perception of the tweet would be one of disbelief and frustration, as it is dismissive of the feminist movement and belittles the speaker. They may also feel anger towards the person who posted the tweet for their lack of respect.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of how the feminist movement is often dismissed and belittled, and that it is important to stand up for the rights of women and fight against sexism.",
    "action": "No one should be dismissed or belittled for standing up for the rights of women. #FeministMovement #EqualRights"
  },
  {
    "ID": 492,
    "Target": "Feminist Movement",
    "Tweet": "So you want equality in the work place between men and woman but you won't take the trash out..? Makes sense",
    "perception": "The person's perception of this tweet might be that it is sarcastic and mocking the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that feminists are not willing to do the same work as men, and that the tweet is implying that feminists are not taking action to achieve equality.",
    "action": "Equality in the workplace is about more than just taking out the trash. It's about equal pay, equal opportunities, and equal respect.\" #FeministMovement"
  },
  {
    "ID": 415,
    "Target": "Feminist Movement",
    "Tweet": "@TrapLordAlec @Bold_Radicals 10 to realize this is all actually a symbol for",
    "perception": "patriarchy\" #Feminism\"\n\nThe person's perception of this tweet would be that it is a positive message in support of the Feminist Movement, and that it is highlighting the need to recognize the oppressive nature of patriarchy.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the dismantling of patriarchy and the recognition of its oppressive nature, and that the hashtag #Feminism is being used to emphasize the importance of the Feminist Movement.",
    "action": "Agreed! We must continue to fight for gender equality and challenge the oppressive systems of patriarchy #Feminism"
  },
  {
    "ID": 468,
    "Target": "Feminist Movement",
    "Tweet": "GETTING OFFENDED  Is the simplest, most effective lie to manipulate others. Feminism & Religions love it. #GamerGate",
    "perception": "The person's initial perception of the tweet would be one of confusion and frustration, as it appears to be critical of the Feminist Movement. They may also feel a sense of anger towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on the Feminist Movement, and to question the motives of the person who posted it. They may also feel a sense of disbelief that someone would make such a statement.",
    "action": "This tweet is offensive and wrong. #FeminismIsNotALie #NoToGamerGate"
  },
  {
    "ID": 105,
    "Target": "Feminist Movement",
    "Tweet": "@_sarcasmspasm @MT8_9 Then there's the added level of irony: Their chosen figureheads: Not really \"body positive\" amirite?",
    "perception": "The person's perception of this tweet could be that it is making a sarcastic comment about the lack of body positivity among the figureheads of the Feminist Movement. They may also perceive the tweet as being critical of the movement.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that the figureheads of the Feminist Movement are not living up to their own standards of body positivity. They may also interpret the tweet as being critical of the movement and its chosen representatives.",
    "action": "@_sarcasmspasm @MT8_9 We need to ensure that the figureheads of the Feminist Movement are living up to their own standards of body positivity. #Feminism #BodyPositivity"
  },
  {
    "ID": 501,
    "Target": "Feminist Movement",
    "Tweet": "texting my bf telling him to shave today so i find him optimally bangable next time i see him",
    "perception": "The person's perception of this tweet would be one of disapproval and frustration, as it reinforces traditional gender roles and objectifies the boyfriend.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is reinforcing traditional gender roles and objectifying the boyfriend, which is not in line with the values of the Feminist Movement. They would likely view this tweet as an example of how gender roles are still perpetuated in society, and how women are often expected to conform to certain standards of beauty.",
    "action": "This tweet reinforces traditional gender roles and objectifies the boyfriend. We should be striving for equality, not perpetuating outdated gender roles!\" #FeministMovement #GenderEquality"
  },
  {
    "ID": 618,
    "Target": "Feminist Movement",
    "Tweet": "@orange_kae a lot of people get indoctrinated in a movement by reading comments and articles. For example #meinkamp. #equality",
    "perception": "The person's perception of this tweet is likely one of support for the Feminist Movement, as it references the hashtag #meinkamp, which is associated with the movement, and the hashtag #equality, which implies a desire for equal rights.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is advocating for the Feminist Movement, and that reading comments and articles can help people become more informed and involved in the movement.",
    "action": "@orange_kae Absolutely! Reading and educating ourselves is a great way to become more involved in the Feminist Movement. #meinkamp #equality"
  },
  {
    "ID": 220,
    "Target": "Feminist Movement",
    "Tweet": "U can be a #feminist w/o bein a bitch, u can also embrace ur sexuality w/o having loose morals #EmpowerAllBodies #empoweringwomen",
    "perception": "The person's perception of this tweet would be one of positivity and support for the Feminist Movement. They would likely appreciate the message of embracing one's sexuality without judgement and the encouragement of empowering all bodies.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for a more inclusive and accepting view of feminism, one that does not judge people based on their gender or sexuality. They would also likely recognize the message of empowering all bodies, regardless of gender or sexuality, as a way to promote equality and acceptance.",
    "action": "Thank you for this empowering message! #Feminism #EmpowerAllBodies #EmpoweringWomen"
  },
  {
    "ID": 114,
    "Target": "Feminist Movement",
    "Tweet": "Feminists are not ugly lol they do make me laugh though. They are the most hypocritical people on the planet",
    "perception": "The person's perception of this tweet is likely to be negative, as it implies that feminists are hypocritical and that they are the source of amusement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is mocking feminists and that the author does not take the feminist movement seriously. They may also interpret the tweet as implying that feminists are not to be taken seriously and that they are not attractive.",
    "action": "Feminism is about equality and respect for all genders, not about being laughed at or judged. #FeminismIsNotAJoke"
  },
  {
    "ID": 141,
    "Target": "Feminist Movement",
    "Tweet": "the fact that people think women need to be appealing and attractive to be heard/seen as equal is why we need feminism",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the feminist movement, as it highlights the need for equality between genders.",
    "cognition": "The person's cognition after perceiving the information is likely to be that society has a tendency to prioritize the physical appearance of women over their ideas and opinions, and that this is an example of the inequality that the feminist movement is fighting against.",
    "action": "We must continue to fight for gender equality and challenge the idea that women need to be attractive to be heard. #Feminism #Equality"
  },
  {
    "ID": 28,
    "Target": "Feminist Movement",
    "Tweet": "Men don't have a right to talk over you, you're voice is important, you are a goddess and don't deserve to be silenced",
    "perception": "The person's perception of this tweet would be one of support and empowerment for the Feminist Movement, as it encourages women to speak up and be heard. They would likely feel encouraged and inspired by the message of the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that women should not be silenced and that their voices are important and should be heard. They would likely feel empowered and motivated to continue advocating for the Feminist Movement.",
    "action": "Thank you for your support! We must continue to fight for gender equality and ensure that women's voices are heard and respected!\" #FeministMovement"
  },
  {
    "ID": 653,
    "Target": "Feminist Movement",
    "Tweet": "feminism appeared for ray rice domestic violence but disappear for hope sole's #doublestandards",
    "perception": "The person's perception of the tweet would be one of frustration and anger, as it highlights the double standards that exist in society when it comes to the treatment of men and women. They may also feel a sense of injustice, as the tweet implies that the Feminist Movement is not doing enough to address the issue of domestic violence.",
    "cognition": "The person's cognition after perceiving the information would be that the Feminist Movement is not doing enough to address the issue of domestic violence, and that there is a double standard in society when it comes to the treatment of men and women. They may also feel a sense of injustice and frustration at the lack of action taken to address this issue.",
    "action": "We must do more to address domestic violence and end the double standards in our society. #FeminismForAll #EndDomesticViolence"
  }
]