[
  {
    "ID": 668,
    "Target": "Legalization of Abortion",
    "Tweet": "@CultureShifting \"If you don't draw the line where I've arbitrarily drawn it, you can't draw it anywhere.\" Nonsense.",
    "perception": "The person's perception of this tweet would be that it is critical of the idea of drawing a line on abortion, and that it is dismissive of the idea.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that drawing a line on abortion is arbitrary and not a valid argument, and that the idea should be rejected.",
    "action": "@CultureShifting I agree! Drawing a line on abortion is arbitrary and should not be used as an argument for or against it."
  },
  {
    "ID": 1104,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @rob_mcarthur: @JustinTrudeau try joining the millions of slaughtered unborn CHILDREN robbed of their right to choose. #cdnpoli",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that the unborn children are being denied their right to choose. They may also feel that the tweet is an attack on the pro-choice movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the unborn children are being denied their right to choose, and that this is an attack on the pro-choice movement. They may also feel that the tweet is attempting to discredit the legalization of abortion.",
    "action": "@rob_mcarthur Abortion is a fundamental right and should be respected. We must protect the rights of all individuals, including unborn children. #prochoice"
  },
  {
    "ID": 1164,
    "Target": "Legalization of Abortion",
    "Tweet": "At the Mass. State House again tomorrow for Planned Parenthood's Sexual Health Lobby Day #ReproductiveJustice #Feminism",
    "perception": "The person's perception of this tweet would be one of support and enthusiasm for the cause of reproductive justice and feminism. They would likely be encouraged by the mention of Planned Parenthood's Sexual Health Lobby Day and the hashtag use of #ReproductiveJustice and #Feminism.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the cause of reproductive justice and feminism, and that Planned Parenthood is organizing a lobby day to support these causes. They would likely be encouraged to take part in the event and to support the cause.",
    "action": "I'm so excited to join @PlannedParenthood tomorrow for their Sexual Health Lobby Day! #ReproductiveJustice #Feminism #AbortionRights"
  },
  {
    "ID": 833,
    "Target": "Legalization of Abortion",
    "Tweet": "We are the #prolifegen and we will abolish abortion in our lifetime! #prolifefuture #tcot",
    "perception": "The person's perception of this tweet would be one of disapproval and disagreement, as it is advocating for the abolishment of abortion, which goes against their stance on the issue. They may also feel frustrated or angry at the tweet's message.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the abolishment of abortion, which goes against their stance on the issue. They may also interpret the tweet as a call to action for those who are against abortion to join the #prolifegen movement and work towards ending abortion.",
    "action": "Abortion is a fundamental right and should be accessible to all who need it. #prochoice #reproductiverights"
  },
  {
    "ID": 1232,
    "Target": "Legalization of Abortion",
    "Tweet": "PRAYERS FOR BABIES Urgent prayer in Detroit MI ...two in San Diego CA&one in San Antonio  Life begins at conception",
    "perception": "The person's perception of this tweet would be one of disapproval towards the legalization of abortion, as it is emphasizing the importance of life beginning at conception. They may also feel a sense of urgency and sadness for the unborn babies mentioned in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of unborn babies and is against the legalization of abortion. They may also interpret the tweet as a call to action to pray for the unborn babies mentioned in the tweet.",
    "action": "We must protect the rights of women to make their own decisions about their bodies. #ProChoice #AbortionRights"
  },
  {
    "ID": 942,
    "Target": "Legalization of Abortion",
    "Tweet": "I don't plan on ever having an abortion, but here's the thing ...I don't think anyone ever PLANS on it.",
    "perception": "The person's perception of the tweet is likely to be one of understanding and support for the legalization of abortion, as it acknowledges that it is not something that is planned for.",
    "cognition": "The person's cognition after perceiving the information is likely to be that abortion should be a legal option for those who find themselves in a situation where they need it, as it is not something that is planned for. Additionally, they may recognize that it is important to have access to safe and legal abortions in order to protect the health and safety of those who need it.",
    "action": "Agreed! Everyone should have access to safe and legal abortions, no matter the circumstances. #LegalizeAbortion"
  },
  {
    "ID": 1020,
    "Target": "Legalization of Abortion",
    "Tweet": "@TheHeavySquad  #DailyWordsOfWisdom Pat's best Hell is for children  still defines goverment #fostercare #adoption",
    "perception": "The person's perception of this tweet might be that it is advocating for adoption and foster care as an alternative to abortion. They may also perceive it as a criticism of government policies that do not prioritize the well-being of children.",
    "cognition": "The person's cognition after perceiving the information might be that adoption and foster care are better alternatives to abortion, and that the government should prioritize the well-being of children. They may also interpret the tweet as a criticism of government policies that do not prioritize the well-being of children.",
    "action": "@TheHeavySquad Agreed! We should prioritize the well-being of children and support adoption and foster care as alternatives to abortion. #DailyWordsOfWisdom #fostercare #adoption"
  },
  {
    "ID": 997,
    "Target": "Legalization of Abortion",
    "Tweet": "Alright #SCOTUS your next order of business should be overturning #roevwade",
    "perception": "The person's perception of this tweet would be one of disapproval and frustration, as it is advocating for the overturning of Roe v. Wade, which would make abortion illegal.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the overturning of Roe v. Wade, which would make abortion illegal and would be a major setback for those who support the legalization of abortion. They would likely feel frustrated and angry at the suggestion of overturning the ruling.",
    "action": "#RoevWade is a landmark ruling that protects the right to choose. We must fight to keep it in place and protect the rights of women everywhere!\" #ProtectChoice"
  },
  {
    "ID": 1245,
    "Target": "Legalization of Abortion",
    "Tweet": "#PeoplesDebate Juvenile hysterics from that woman. Killing babies is bodily autonomy? People dying of neglect but lets have #VinB",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it appears to be mocking the idea of legalizing abortion. They may also feel frustrated that the tweet is attempting to discredit the idea of bodily autonomy.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the idea of legalizing abortion by implying that it is a form of killing babies. They may also interpret the tweet as implying that people are dying of neglect, but the focus is on legalizing abortion instead.",
    "action": "Abortion is not about killing babies, it's about giving people the right to make decisions about their own bodies. #VinB #PeoplesDebate"
  },
  {
    "ID": 1143,
    "Target": "Legalization of Abortion",
    "Tweet": "Well that's a win for women in Texas. Thank you SCOTUS! #texas",
    "perception": "The person's perception of this tweet would be one of joy and appreciation for the Supreme Court's decision to legalize abortion in Texas. They would likely be pleased that women in Texas now have access to this important healthcare option.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court's decision was a positive step forward for women's rights in Texas. They would likely be encouraged by the decision and hopeful that it will lead to greater access to abortion services in the state.",
    "action": "This is a huge victory for women's rights in Texas! #texas #SCOTUS"
  },
  {
    "ID": 1036,
    "Target": "Legalization of Abortion",
    "Tweet": "@michaelianblack i don't follow the news, is there a new law that ALL gay people have to get married? I'm against that!",
    "perception": "The person's perception of this tweet would be that the author is against a law that would require all gay people to get married. They may also perceive the sentiment of the tweet to be negative.",
    "cognition": "The person's cognition after perceiving the information would be that the author is against a law that would require all gay people to get married, and that they do not support the legalization of same-sex marriage. They may also interpret the tweet as a statement of disapproval of the proposed law.",
    "action": "@michaelianblack I agree with you! Everyone should have the right to choose who they marry, regardless of their sexual orientation."
  },
  {
    "ID": 1130,
    "Target": "Legalization of Abortion",
    "Tweet": "Pregnancy is not a crisis. It's a gift. Whether they be wanted by you or someone else, no child is unwanted. #ChooseLife #Adoption",
    "perception": "The person's perception of this tweet might be that it is advocating for adoption as an alternative to abortion, and that it is promoting the idea that all children are wanted and should be given the chance to live.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that abortion is wrong and that adoption is a better option for unwanted pregnancies. They might also interpret the tweet as suggesting that all children should be given the chance to live, regardless of whether or not they are wanted by the mother.",
    "action": "Everyone should have the right to make their own decisions about their bodies and their pregnancies. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 747,
    "Target": "Legalization of Abortion",
    "Tweet": "@mrsdrjim did you know #wrp @BrianJeanWRP tried to get personhood going via federal #motion312.",
    "perception": "The person's perception of this tweet might be one of disbelief and disappointment, as it appears to be advocating for a policy that goes against their beliefs on the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for a policy that would limit the rights of women to make decisions about their own bodies. They may also be concerned that this policy could lead to further restrictions on abortion access.",
    "action": "This is unacceptable! We must fight for the right of women to make decisions about their own bodies #prochoice"
  },
  {
    "ID": 1023,
    "Target": "Legalization of Abortion",
    "Tweet": "Everyone who disagrees has always had the right to mind their own damn business!!!! #LoveWins",
    "perception": "The person's perception of this tweet would be that it is a positive sentiment in support of the legalization of abortion, and that those who disagree should keep their opinions to themselves.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to choose and that it is a message of acceptance and love for those who support the legalization of abortion. They would also understand that the hashtag is a sign of solidarity and support for the cause.",
    "action": "Thank you for your support! #LoveWins #AbortionRights"
  },
  {
    "ID": 1238,
    "Target": "Legalization of Abortion",
    "Tweet": "@HomunculusLoikm @SawyerAndrew @BryanBroome1 @jstines3 Bad analogy. The current time frame for abortion is the best compromise",
    "perception": "The person's perception of this tweet would be that it is in favor of the legalization of abortion, as it suggests that the current time frame for abortion is the best compromise. They may also perceive the tweet as being supportive of the pro-choice movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion, and that the current time frame for abortion is the best compromise. They may also interpret the tweet as being supportive of the pro-choice movement and its goals.",
    "action": "I agree! The current time frame for abortion is the best compromise and should be supported #prochoice"
  },
  {
    "ID": 1127,
    "Target": "Legalization of Abortion",
    "Tweet": "@LifeNewsHQ I would consider this, to be dispersal of a chemical weapon, one that kills children.",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that abortion is akin to a chemical weapon.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is a form of violence and should not be legalized. They would also likely feel that the tweet is an attack on their beliefs and values.",
    "action": "@LifeNewsHQ Abortion is a personal choice and should be respected. It is not a chemical weapon and should not be treated as such."
  },
  {
    "ID": 1008,
    "Target": "Legalization of Abortion",
    "Tweet": "@Scullybones027 And where is @AmnestyIreland ? Nowhere to be seen - cause they only care about",
    "perception": "women's rights\" when it suits them #prolife\"\n\nThe person's perception of this tweet would be that it is critical of Amnesty Ireland and expresses a pro-life sentiment. They may also perceive it as being dismissive of women's rights.",
    "cognition": "The person's cognition after perceiving the information would be that Amnesty Ireland is not supportive of women's rights when it comes to abortion, and that the tweet is advocating for a pro-life stance.",
    "action": "@Scullybones027 We disagree with your stance on abortion. Women should have the right to make decisions about their own bodies."
  },
  {
    "ID": 1066,
    "Target": "Legalization of Abortion",
    "Tweet": "Great college training in Stevens Point today!gen #WRTLCollege",
    "perception": "The person's perception of the tweet would be that it is a positive message about college training in Stevens Point and that it is likely related to the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is likely related to the WRTL College, which is a college that provides training related to the legalization of abortion. They would also likely interpret the tweet as a positive message about the college and its training.",
    "action": "Thanks for the great college training in Stevens Point! #WRTLCollege #LegalizeAbortion"
  },
  {
    "ID": 699,
    "Target": "Legalization of Abortion",
    "Tweet": "@jemimakirke my hat is off to you for speaking out about something that is rarely discussed by anyone who has a voice.",
    "perception": "The person's perception of this tweet is likely one of admiration and respect for Jemima Kirke's courage in speaking out about a controversial topic.",
    "cognition": "The person's cognition after perceiving the information is likely that Jemima Kirke is brave for speaking out about a difficult issue, and that her voice is important in the discussion of abortion legalization.",
    "action": "@jemimakirke thank you for your courage in speaking out about such an important issue. Your voice is invaluable in the fight for abortion legalization."
  },
  {
    "ID": 992,
    "Target": "Legalization of Abortion",
    "Tweet": "Now we just need to give women everywhere their rightful choice",
    "perception": "The person's perception of this tweet is likely to be one of support for the legalization of abortion, as it emphasizes the importance of giving women the right to choose.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the right of women to make their own decisions about their reproductive health, and that the legalization of abortion is necessary to ensure that women have access to this right.",
    "action": "I fully support the right of women to make their own decisions about their reproductive health. #LegalizeAbortion #MyRightMyChoice"
  },
  {
    "ID": 720,
    "Target": "Legalization of Abortion",
    "Tweet": "It's a free country. Freedom includes freedom of choice.",
    "perception": "The person's perception of this tweet is likely to be one of support for the legalization of abortion, as it emphasizes the importance of freedom of choice.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the right to choose, which implies support for the legalization of abortion. They may also interpret the tweet as a call for greater autonomy and freedom of choice in general.",
    "action": "I fully support the right to choose and the legalization of abortion. #FreedomOfChoice #AbortionRights"
  },
  {
    "ID": 1100,
    "Target": "Legalization of Abortion",
    "Tweet": "We all have a duty to protect the sanctity of life...from the first cell division, to the last. #ProtectLife #pjnet #ctot #ccot",
    "perception": "The person's perception of this tweet would be one of disagreement, as it implies that life should be protected from the first cell division, which goes against the person's stance on the legalization of abortion. They may also feel frustrated or angry at the message being conveyed.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of life from the first cell division, which implies that abortion should not be legalized. They may also interpret the tweet as a call to action to protect life, and to oppose the legalization of abortion.",
    "action": "Abortion should be a choice, not a crime. #MyBodyMyChoice #ProChoice #AbortionRights"
  },
  {
    "ID": 1176,
    "Target": "Legalization of Abortion",
    "Tweet": "The Constitution of Kenya 2010 is clear that abortion on demand is illegal.  #FIDA",
    "perception": "The person's perception of this tweet would likely be one of disappointment and disagreement, as it implies that abortion is illegal and should not be legalized.",
    "cognition": "The person's cognition after perceiving the information would likely be that the Kenyan Constitution does not allow for abortion on demand, and that the tweet is advocating for the current law to remain in place. They may also feel frustrated that their views on abortion are not being taken into consideration.",
    "action": "Abortion should be a choice for women, not a decision made by the government. #MyBodyMyChoice #LegalizeAbortion"
  },
  {
    "ID": 964,
    "Target": "Legalization of Abortion",
    "Tweet": "Just like abortion, even though SCOTUS says gay marriage is legal doesn't make it moral. #SCOTUSMarriage #FreedomOfReligion",
    "perception": "The person's perception of the tweet might be that it is expressing a negative sentiment towards the legalization of gay marriage, and is implying that it is not moral despite being legal. They may also perceive that the tweet is advocating for freedom of religion.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the legalization of gay marriage does not make it morally right, and that religious freedom should be respected. They may also interpret the tweet as a criticism of the Supreme Court's decision to legalize gay marriage.",
    "action": "Legalizing abortion is a decision that should be respected and protected. #AbortionRights #MyBodyMyChoice"
  },
  {
    "ID": 1026,
    "Target": "Legalization of Abortion",
    "Tweet": "@web_rant No, it shows that liberals should start thinking about the consequences of their actions #polygamy #gaymarriage",
    "perception": "The person's perception of this tweet would be that it is critical of liberal views on social issues such as polygamy and gay marriage, and implies that they should consider the consequences of their actions.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that liberal views on social issues such as polygamy and gay marriage should be reconsidered, and that the consequences of these actions should be taken into account. They may also infer that the tweet is implying that legalizing abortion could have negative consequences.",
    "action": "@web_rant Abortion should be a decision made between a woman and her doctor, with consideration of the potential consequences. #prochoice"
  }
]