[
  {
    "ID": 1084,
    "Target": "Legalization of Abortion",
    "Tweet": "It should never ever be legal to have an abortion because murder is wrong & #AbortionIsMurder not #healthcare . We Must .",
    "perception": "The person's perception of this tweet would be that it is strongly against the legalization of abortion, and that it is equating abortion to murder.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the criminalization of abortion, and that it is implying that abortion is an immoral act.",
    "action": "Abortion is a complex issue and should be treated as such. We must ensure that women have access to safe and legal abortion services.\" #AbortionRights #Healthcare"
  },
  {
    "ID": 707,
    "Target": "Legalization of Abortion",
    "Tweet": "The Democrats just gave the most chilling reply when asked if they support aborting 7-pound babies",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as they are likely to be strongly in favor of the legalization of abortion. They may also feel a sense of anger and frustration towards the Democrats for their response.",
    "cognition": "The person's cognition after perceiving the information would be that the Democrats are not in favor of abortion, even in cases where the fetus is seven pounds. They may also feel that the Democrats are not taking into account the rights of women to make decisions about their own bodies.",
    "action": "Abortion is a fundamental right and should not be restricted based on the size of the fetus. Women should have the right to make decisions about their own bodies!\" #ProChoice #AbortionRights"
  },
  {
    "ID": 1003,
    "Target": "Legalization of Abortion",
    "Tweet": "@mrprolife Complications come with all types of medical procedures, doesn't mean procedure itself should be banned. #DealWithIt",
    "perception": "The person's perception of this tweet would be that the author is in favor of legalizing abortion and is challenging the idea that it should be banned due to potential complications. They also appear to be suggesting that the issue should be addressed rather than ignored.",
    "cognition": "The person's cognition after perceiving the information would be that the author is advocating for the legalization of abortion and is suggesting that the potential complications should be addressed rather than ignored. They are also challenging the idea that abortion should be banned due to potential complications.",
    "action": "@mrprolife We should be looking for ways to reduce the risks of abortion, not banning it altogether. #SupportChoice"
  },
  {
    "ID": 1006,
    "Target": "Legalization of Abortion",
    "Tweet": "Any asshat \"protesting\" against #SofiaVergara is a disgrace to the entire Women's Rights movement. Live and let live.",
    "perception": "The person's perception of this tweet would be one of approval and support for Sofia Vergara and the Women's Rights movement, as well as a sentiment of live and let live.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the Women's Rights movement and for Sofia Vergara, and that it is suggesting that people should be allowed to make their own decisions without judgement or interference.",
    "action": "Agreed! #SofiaVergara deserves respect and the right to make her own decisions. #WomenRights #LiveAndLetLive"
  },
  {
    "ID": 879,
    "Target": "Legalization of Abortion",
    "Tweet": "Since #roevwade 1/3 of my #generation has been #aborted. Where were their #rights?youthgen",
    "perception": "The person's perception of this tweet would be one of sadness and outrage, as it implies that a large number of people in the speaker's generation have been denied their rights by being aborted.",
    "cognition": "The person's cognition after perceiving the information would be that abortion is a serious issue that needs to be addressed, and that the rights of those affected by it should be respected.",
    "action": "We must ensure that everyone's rights are respected and protected. #roevwade #abortion #rights #youthgen"
  },
  {
    "ID": 1156,
    "Target": "Legalization of Abortion",
    "Tweet": "The Supreme Court justices are on fire this week #LoveWins",
    "perception": "The person's perception of this tweet would be one of joy and celebration, as they interpret the hashtag to mean that the Supreme Court justices have made a decision in favor of legalizing abortion. They may also feel a sense of hope that their views on the issue are being validated.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court justices have made a decision that is in favor of legalizing abortion, and that this decision is a victory for those who support the legalization of abortion. They may also feel a sense of optimism that their views on the issue are being validated.",
    "action": "So proud of the Supreme Court justices for standing up for what's right! #LoveWins #AbortionRights"
  },
  {
    "ID": 721,
    "Target": "Legalization of Abortion",
    "Tweet": "Unthinkable, shameful, acceptable, encouraged, desirable  ...the evolution of killing the defenseless.   @msnbc @jemimakirke",
    "perception": "The person's perception of this tweet could be that it is expressing a negative sentiment towards abortion, suggesting that it is an unacceptable and shameful practice.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that the evolution of abortion is a form of killing the defenseless, and that it should not be encouraged or desirable. They may also interpret the tweet as a criticism of the media outlets mentioned in the tweet.",
    "action": "Abortion should be a safe and legal option for those who need it. We must ensure that it is accessible and affordable for all. #ProtectChoice #MyBodyMyChoice"
  },
  {
    "ID": 1250,
    "Target": "Legalization of Abortion",
    "Tweet": "@mrgeology They abort millions of their possible progressives for the future. #Downfall",
    "perception": "The person's perception of this tweet would be one of disapproval and sadness, as it implies that the abortion of millions of potential lives is a cause of decline.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the abortion of millions of potential lives is a cause of decline, and that this is a negative consequence of the legalization of abortion.",
    "action": "Abortion should be a choice, but it should also be done responsibly and with consideration for the potential lives lost. #ProChoice"
  },
  {
    "ID": 876,
    "Target": "Legalization of Abortion",
    "Tweet": "Does a #pregnant #woman have 2 heads, 2 hearts, 4 arms, and 4 legs? #prolifeyouth #prolifegen #didntthinkso",
    "perception": "The person's perception of this tweet would be that it is advocating for the pro-life movement and is against the legalization of abortion. They may also perceive it as a sarcastic comment about the physical impossibility of a pregnant woman having two of each body part.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that a pregnant woman should not be denied the right to choose whether or not to have an abortion, as it is physically impossible for her to have two of each body part. They may also interpret the tweet as a criticism of the pro-life movement for denying women the right to choose.",
    "action": "No one should be denied the right to choose. #prochoice #abortionrights #mybodymychoice"
  },
  {
    "ID": 679,
    "Target": "Legalization of Abortion",
    "Tweet": "A person's a person, no matter how small. - Dr. Suess #WAAR",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as the quote implies that all people, regardless of size, should be respected and valued. They may also feel a sense of solidarity with the hashtag #WAAR, which could stand for a pro-choice movement.",
    "cognition": "The person's cognition after perceiving the information would be that the quote is advocating for the rights of all people, regardless of size, and that the hashtag is likely associated with a pro-choice movement. They may also interpret the tweet as a call to action to support the legalization of abortion.",
    "action": "Agreed! We must continue to fight for the rights of all people, no matter how small. #WAAR #ProChoice"
  },
  {
    "ID": 806,
    "Target": "Legalization of Abortion",
    "Tweet": "Meme on like it's the last Reddit thread on Earth. #AgeofUltron #lifeadvice #protip #propeller #propane #andpropaneaccessories",
    "perception": "The person's perception of this tweet might be that it is humorous and light-hearted, and does not directly relate to the topic of abortion.",
    "cognition": "The person's cognition of this tweet might be that it is not relevant to the topic of abortion, and that it is simply a humorous meme.",
    "action": "LOL! That's a great meme! #abortionrights"
  },
  {
    "ID": 825,
    "Target": "Legalization of Abortion",
    "Tweet": "I am just as much a feminist as any pro-choicer. I simply carry my beliefs to their logical conclusion. #faminism #YesAllWomen",
    "perception": "The person's perception of this tweet is likely to be one of support for the legalization of abortion, as well as a strong sense of feminism and solidarity with women.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the author of the tweet is a strong advocate for women's rights and that they believe that the logical conclusion of their beliefs is to support the legalization of abortion.",
    "action": "I'm with you! #Feminism #YesAllWomen #LegalizeAbortion"
  },
  {
    "ID": 1111,
    "Target": "Legalization of Abortion",
    "Tweet": "@PnkGlitterChemE @SayNoToSuicide4 Being #Gay is a #Choice Just like",
    "perception": "Abortion\" is a Choice.\n\nThe person's perception of this tweet is likely to be one of support for the legalization of abortion, as well as acceptance of the LGBTQ+ community.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the acceptance of both the LGBTQ+ community and the legalization of abortion. They may also interpret the tweet as a statement that both of these choices are valid and should be respected.",
    "action": "I fully support the legalization of abortion and the acceptance of the LGBTQ+ community. #EqualityForAll #AbortionRights"
  },
  {
    "ID": 900,
    "Target": "Legalization of Abortion",
    "Tweet": "It's time to be a #voice for the #voiceless. Stand up for the #unborn! #AllLivesMatter #ProLifeYouth #chooselife",
    "perception": "The person's perception of this tweet would be that it is advocating for the pro-life movement and is against the legalization of abortion. They may also perceive it as a call to action to stand up for the unborn.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the pro-life movement and is against the legalization of abortion. They may also interpret it as a call to action to stand up for the unborn and to choose life over abortion.",
    "action": "Abortion should be a choice, not a mandate. #MyBodyMyChoice #ProChoice #AbortionRights"
  },
  {
    "ID": 844,
    "Target": "Legalization of Abortion",
    "Tweet": "@hillaryclinton - I guess this means you're happy for me to be pro-life as I never aborted any of my own children? #hypocrisy",
    "perception": "The person's perception of this tweet might be that it is critical of Hillary Clinton for her stance on abortion, and that it is accusing her of hypocrisy.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that Hillary Clinton is hypocritical for supporting abortion rights while not having had an abortion herself. They might also interpret the tweet as suggesting that Hillary Clinton's stance on abortion is not genuine.",
    "action": "@hillaryclinton Abortion is a complex issue and everyone has the right to their own opinion. We should respect each other's views and work together to find a solution that works for everyone."
  },
  {
    "ID": 1153,
    "Target": "Legalization of Abortion",
    "Tweet": "If the fetus isn't inside you, than shut up love",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards those who oppose the legalization of abortion. They may also feel a sense of solidarity with those who support the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a call to action for those who support the legalization of abortion to speak up and make their voices heard. They may also interpret the tweet as a reminder that the decision to have an abortion should be a personal one, and that those who are not directly affected should not be making judgments.",
    "action": "We stand with those who support the right to choose. #LegalizeAbortion #MyBodyMyChoice"
  },
  {
    "ID": 1237,
    "Target": "Legalization of Abortion",
    "Tweet": "@HomunculusLoikm @SawyerAndrew @BryanBroome1 @jstines3 I don't think most women enjoy the experience.",
    "perception": "The person's perception of this tweet is likely one of disagreement with the idea of legalizing abortion, as the tweet implies that it is not a pleasant experience for women. They may also perceive the tweet as being critical of those who support the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is implying that abortion is not a pleasant experience for women, and that it is not something that should be supported. They may also interpret the tweet as being critical of those who support the legalization of abortion.",
    "action": "I disagree. Women should have the right to make decisions about their own bodies, and abortion should be an option for them.\" #LegalizeAbortion"
  },
  {
    "ID": 1241,
    "Target": "Legalization of Abortion",
    "Tweet": "Never during a pregnancy does a pregnant person's body cease being their own. Support bodily autonomy. Be",
    "perception": "pro-choice\" #LegalizeAbortion\"\nThe person's perception of this tweet would be that it is advocating for the legalization of abortion and is in support of bodily autonomy. They would likely agree with the sentiment of the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to choose whether or not to have an abortion, and that it is important to respect the autonomy of pregnant people. They would likely agree with the message of the tweet and support the legalization of abortion.",
    "action": "I fully support the right to choose and the importance of respecting bodily autonomy. #LegalizeAbortion"
  },
  {
    "ID": 870,
    "Target": "Legalization of Abortion",
    "Tweet": "The right to #choose? Thats a #lie! #babies don't choose to #die! Prolifeyouthgen",
    "perception": "The person's perception of this tweet would be one of disagreement and disapproval of the legalization of abortion. They would likely interpret the tweet as a strong stance against abortion, and view it as an attack on the pro-choice movement.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as a criticism of the pro-choice movement and an assertion that abortion is wrong. They would likely view the tweet as an attempt to persuade people to oppose the legalization of abortion.",
    "action": "Abortion is a complex issue and everyone should have the right to make their own decisions. #prochoice #reproductivefreedom"
  },
  {
    "ID": 788,
    "Target": "Legalization of Abortion",
    "Tweet": "@BBCNewshour \"if u had been my wife I would have blow your head off.\" Yep, that sound like #ElSalvador",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it conveys a violent sentiment towards women and abortion.",
    "cognition": "The person's cognition after perceiving the information would be that this tweet is an example of the extreme violence and lack of respect for women's rights that is still present in some parts of the world, and that this is an example of why abortion should be legalized in order to protect women's rights.",
    "action": "This tweet is a stark reminder of why abortion should be legalized to protect women's rights. #AbortionRights #LegalizeAbortion #WomenRights"
  },
  {
    "ID": 760,
    "Target": "Legalization of Abortion",
    "Tweet": "wow all these people r so upset over 1 Black Man killed, what would they do if they knew about BlackKids killed by #BaltimoreRiots",
    "perception": "The person's perception of the tweet would be one of shock and outrage, as they are appalled by the lack of attention given to the deaths of Black children in the Baltimore riots compared to the attention given to the death of one Black man.",
    "cognition": "The person's cognition after perceiving the information would be that the death of Black children due to the Baltimore riots is being overlooked and not given the same attention as the death of one Black man. They would also likely be angered by the injustice of this situation and the lack of recognition of the lives lost.",
    "action": "It's unacceptable that the deaths of Black children due to the #BaltimoreRiots are being overlooked. We must recognize and honor the lives lost and fight for justice.\" #BlackLivesMatter"
  },
  {
    "ID": 723,
    "Target": "Legalization of Abortion",
    "Tweet": "@AdamMyerson @quarq - Sent mine two days ago.  Expect it back in two days. Quick turnaround and great customer service!",
    "perception": "The person's perception of this tweet would be that AdamMyerson and Quarq provide excellent customer service with a quick turnaround time. They would also likely perceive a positive sentiment from the tweet.",
    "cognition": "The person's cognition of this tweet would be that AdamMyerson and Quarq are reliable and efficient in providing customer service. They would also likely interpret the tweet as a positive endorsement of the company's services.",
    "action": "@AdamMyerson @quarq Thanks for the great customer service! I'm glad to hear that you have a quick turnaround time."
  },
  {
    "ID": 1247,
    "Target": "Legalization of Abortion",
    "Tweet": "@toby_dorena I am in favor of women's rights and their right to choose. How I chose is irrelevant to others",
    "perception": "The person's perception of this tweet is likely to be one of support for the legalization of abortion, as well as a sentiment of respect for individual autonomy.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the right of women to make their own decisions about their reproductive health, and that the individual's personal choices should not be judged by others.",
    "action": "@toby_dorena I fully support the right of women to make their own decisions about their reproductive health. #LegalizeAbortion"
  },
  {
    "ID": 937,
    "Target": "Legalization of Abortion",
    "Tweet": "#Abstinence proponent #BristolPalin, pregnant with second child, conceives of #humility.  #MirthControl #BirthControl",
    "perception": "The person's perception of this tweet might be that Bristol Palin is advocating for abstinence, but has become pregnant with her second child, which could be seen as hypocritical. They may also find the hashtag combination of 'humility' and 'mirth control' to be humorous.",
    "cognition": "The person's cognition after perceiving the information might be that Bristol Palin is not practicing what she preaches, and that her situation is ironic. They may also find the hashtag combination to be a humorous way of pointing out the irony of the situation.",
    "action": "It's ironic that #BristolPalin, a #Abstinence proponent, is pregnant with her second child. #Humility #MirthControl #BirthControl"
  },
  {
    "ID": 725,
    "Target": "Legalization of Abortion",
    "Tweet": "@DWStweets @RepDWStweets is a seven pound baby murderer. Too bad her Mom didn't have the same operation. #Baby #Democrats #Losers",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that abortion is equivalent to murder. They would likely feel that the tweet is offensive and insensitive.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and that the Democratic party is to blame for it. They would likely feel that the tweet is attacking their beliefs and values.",
    "action": "@DWStweets @RepDWStweets Abortion is a personal decision and should not be judged. #MyBodyMyChoice #ProChoice #WomenRights"
  }
]