[
  {
    "ID": 840,
    "Target": "Legalization of Abortion",
    "Tweet": "@Hannah_Warren14 that much more oppressive for women",
    "perception": "The person's perception of this tweet is likely one of agreement with the sentiment that abortion should be legalized, as it implies that not legalizing it is oppressive for women.",
    "cognition": "The person's cognition after perceiving the information is likely that abortion should be legalized in order to protect women's rights and to ensure that women have access to safe and legal reproductive healthcare. They may also recognize that not legalizing abortion can lead to dangerous and potentially deadly consequences for women.",
    "action": "@Hannah_Warren14 Absolutely! Women should have the right to make decisions about their own bodies without fear of oppression or judgement."
  },
  {
    "ID": 920,
    "Target": "Legalization of Abortion",
    "Tweet": "@LogicOfLife7 I don't confuse \"right to life\" with 'right-to-use-someone's-body-without-consent'. Do you? #rapeculture",
    "perception": "The person's perception of this tweet would be that it is advocating for the legalization of abortion, as it is questioning the idea of a \"right to life\" and the implications of not having consent. They may also perceive the tweet as being critical of rape culture.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion by questioning the idea of a \"right to life\" and the implications of not having consent, and that it is also critical of rape culture. They may also recognize that the tweet is making a connection between the two issues.",
    "action": "@LogicOfLife7 I agree! We need to ensure that everyone has the right to make decisions about their own body without fear of judgement or coercion. #prochoice"
  },
  {
    "ID": 893,
    "Target": "Legalization of Abortion",
    "Tweet": "They haven't eliminated #murder. They just call it by a different #name. #prolifeyouth #prolifegen",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, and is likely to be in favor of the pro-life movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is a form of murder, and that the pro-life movement should be supported.",
    "action": "Abortion should be a safe and legal option for those who need it. #prochoice #reproductiverights"
  },
  {
    "ID": 1179,
    "Target": "Legalization of Abortion",
    "Tweet": "So prolifers are against health rights?",
    "perception": "The tweet implies that those who oppose abortion are against health rights, which the person likely disagrees with.",
    "cognition": "The person may interpret the tweet as implying that those who oppose abortion are against health rights, which they may find to be an unfair characterization. They may also feel that the tweet is an oversimplification of the complex issue of abortion.",
    "action": "Abortion is a complex issue and should be discussed with respect. We should focus on protecting health rights for all, regardless of their stance on abortion."
  },
  {
    "ID": 768,
    "Target": "Legalization of Abortion",
    "Tweet": "@ProWomanChoice forcing women to change their body's normal function is the epitome of controlling women.",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the legalization of abortion, as it is advocating for women's rights and freedom of choice.",
    "cognition": "The person's cognition after perceiving the information is likely to be that abortion should be a choice that is available to women, and that it should not be forced upon them. They may also interpret the tweet to mean that women should have the right to make decisions about their own bodies without interference from others.",
    "action": "@ProWomanChoice Absolutely! Women should have the right to make decisions about their own bodies without interference from others."
  },
  {
    "ID": 871,
    "Target": "Legalization of Abortion",
    "Tweet": "It's not #yourbody, so it's not your #choice.youthgen",
    "perception": "The person's perception of this tweet is likely to be one of disagreement, as it implies that abortion should not be a choice. They may also feel frustrated that their opinion is being challenged.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the restriction of abortion rights, and that it is implying that the decision to have an abortion should not be left up to the individual.",
    "action": "Abortion should be a choice, and it's up to the individual to decide what's best for them. #prochoice #abortionrights"
  },
  {
    "ID": 1058,
    "Target": "Legalization of Abortion",
    "Tweet": "We should not deny the basic human right to life for unborn babies. #LifeWins #EndTheDiscrimination",
    "perception": "The person's perception of this tweet would be one of disapproval of abortion, as it emphasizes the right to life for unborn babies and calls for an end to discrimination.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of unborn babies and is against the legalization of abortion. They would also likely interpret the tweet as a call to action to end discrimination against unborn babies.",
    "action": "We must protect the rights of women to make their own decisions about their bodies. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 1112,
    "Target": "Legalization of Abortion",
    "Tweet": "remember the gates of Hell will not prevail. #GayMarriage",
    "perception": "The person's perception of the tweet might be that it is a positive sentiment in support of legalizing gay marriage. They may also perceive it as a religious reference, suggesting that those who oppose gay marriage will not be successful.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the legalization of gay marriage, and that it is a religious reference suggesting that those who oppose it will not be successful.",
    "action": "I'm in full support of #GayMarriage! Let's make it happen!"
  },
  {
    "ID": 862,
    "Target": "Legalization of Abortion",
    "Tweet": "Bodily autonomy is a human right. A person's access to abortion is a human right. #reprojustice #reprorights",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as it emphasizes the importance of bodily autonomy and access to abortion as a human right. They would likely also view the hashtags as a sign of solidarity with the reproductive justice movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to access abortion, and that it is a part of the reproductive justice movement. They would likely also recognize the importance of bodily autonomy and the need to protect reproductive rights.",
    "action": "I fully support the right to access abortion and the reproductive justice movement. #reprojustice #reprorights"
  },
  {
    "ID": 1088,
    "Target": "Legalization of Abortion",
    "Tweet": "Mzwakhe mbuli says doctors & nurses are paid assassins.. they kill unborn babies & give it a fancy name",
    "perception": "abortion\" #prolife\"\n\nThe person's perception of this tweet would be one of disapproval and disagreement, as it implies that abortion is wrong and equates it to murder. They may also feel frustrated that the tweet is spreading an anti-abortion message.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is spreading an anti-abortion message and that it is equating abortion to murder. They may also feel that the tweet is trying to shame those who support abortion and is attempting to discredit the practice.",
    "action": "Abortion is a personal decision and should not be judged or shamed. #prochoice"
  },
  {
    "ID": 739,
    "Target": "Legalization of Abortion",
    "Tweet": "Took God, discipline & tobacco out, made ^airtight & filled homes w/^CO2 cuz of energy & climate lies. Evil & energy use soared.",
    "perception": "The person's perception of this tweet would be that it is critical of the removal of God, discipline, and tobacco, and that it implies that energy and climate lies have caused an increase in evil and energy use.",
    "cognition": "The person's cognition after perceiving the information would be that the removal of God, discipline, and tobacco has had a negative effect on society, and that energy and climate lies have caused an increase in evil and energy use.",
    "action": "We must recognize the consequences of removing God, discipline, and tobacco from our lives and take action to address the energy and climate lies that have caused an increase in evil and energy use.\" #LegalizeAbortion"
  },
  {
    "ID": 838,
    "Target": "Legalization of Abortion",
    "Tweet": "Pro-Life Legislative Day Party in Lansing today! See y'all there! #sopumpedgen",
    "perception": "The person's perception of this tweet would be one of disappointment and frustration, as it appears to be promoting an event that is in opposition to their stance on abortion. They may also feel a sense of anger or resentment towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the event is likely to be attended by people who are against the legalization of abortion, and that the event is likely to be used to promote anti-abortion legislation.",
    "action": "Abortion is a fundamental right and should be respected. #MyBodyMyChoice #ProChoice"
  },
  {
    "ID": 950,
    "Target": "Legalization of Abortion",
    "Tweet": "Dear #BristolPalin. STOP. Just FUCKING STOP. You have choices. It's called #abortion. Take it or leave it but quit whining. #fem2",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as well as a strong sentiment of frustration towards Bristol Palin.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to choose abortion, and that it is expressing a strong sentiment of disapproval towards Bristol Palin's views on the issue.",
    "action": "Agreed! Everyone should have the right to choose what is best for them. #abortion #fem2 #prochoice"
  },
  {
    "ID": 1259,
    "Target": "Legalization of Abortion",
    "Tweet": "@NARAL @TIME At the same time, this decision ISN'T always a difficult one. Don't let #antichoice guilt-trip people.",
    "perception": "The person's perception of this tweet would be that it is supportive of the legalization of abortion and is encouraging people not to feel guilty about their decisions. It also implies that the decision to have an abortion is not always a difficult one.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to choose and is encouraging people to make their own decisions without feeling guilty. It also implies that the decision to have an abortion is not always a difficult one and should be respected.",
    "action": "@NARAL @TIME We must respect the right to choose and support those who make their own decisions without feeling guilty. #prochoice"
  },
  {
    "ID": 1122,
    "Target": "Legalization of Abortion",
    "Tweet": "Another SCOTUS decision I do not agree with. It's time to do away with the death penalty all together.",
    "perception": "The person's perception of the tweet would be one of disappointment and disagreement, as it implies that the Supreme Court has made a decision that goes against their stance on abortion. They may also feel that the death penalty should be abolished altogether.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court has made a decision that goes against their stance on abortion, and that the death penalty should be abolished altogether. They may also feel that the decision is unjust and that the death penalty should not be used as a form of punishment.",
    "action": "I strongly disagree with the SCOTUS decision. We should be working towards ending the death penalty, not upholding it.\" #AbolishTheDeathPenalty"
  },
  {
    "ID": 1118,
    "Target": "Legalization of Abortion",
    "Tweet": "@nice_euna As much as they try the notion of ts the 21st century its killing a lot.....",
    "perception": "The person's perception of this tweet is likely one of disapproval of the legalization of abortion, as the tweet implies that it is a form of killing. They may also perceive a sense of frustration that the idea of abortion is still being discussed in the 21st century.",
    "cognition": "The person's cognition after perceiving the information is likely that abortion is still a controversial issue in the 21st century, and that it is seen as a form of killing by some people. They may also come to the conclusion that there is still a lot of work to be done in order to make abortion more widely accepted.",
    "action": "@nice_euna We must continue to work towards making abortion more widely accepted and understood in the 21st century. #LegalizeAbortion"
  },
  {
    "ID": 1133,
    "Target": "Legalization of Abortion",
    "Tweet": "@CoraSherlock @NORTHANNE @fdelond you Cora ignore that IRE export the 'problem',to UK @MarieStopes #itwontgoaway #repealthe8th",
    "perception": "The person's perception of this tweet would be that it is advocating for the repeal of the 8th Amendment in Ireland, which would legalize abortion. They may also perceive a sense of urgency in the message, as the hashtag #itwontgoaway implies.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is calling for the repeal of the 8th Amendment in Ireland in order to legalize abortion. They may also interpret the message as a call to action, as the hashtag #itwontgoaway implies that the issue of abortion will not go away until the 8th Amendment is repealed.",
    "action": "@CoraSherlock @NORTHANNE @fdelond @MarieStopes We must repeal the 8th Amendment in Ireland to legalize abortion #repealthe8th"
  },
  {
    "ID": 1231,
    "Target": "Legalization of Abortion",
    "Tweet": "How Ohio is secretly as restrictive as Texas with their #antichoice laws #TRAPlaws",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards the restrictive laws in Ohio, and a sense of solidarity with those affected by the anti-choice laws.",
    "cognition": "The person's cognition after perceiving the information would be that Ohio is just as restrictive as Texas when it comes to abortion laws, and that these laws are unjust and should be changed. They would also likely feel a sense of urgency to take action and fight for the rights of those affected by these laws.",
    "action": "We must fight for the rights of those affected by these unjust #TRAPlaws and work to ensure that all people have access to safe and legal abortion. #prochoice"
  },
  {
    "ID": 686,
    "Target": "Legalization of Abortion",
    "Tweet": ".@DRUDGE_REPORT not sure I agree with her decision but, it is her decision.I wonder how many of the critics would support abortion?",
    "perception": "The person's perception of the tweet might be that the author is in favor of the individual's right to choose, but is unsure of the decision itself. They also question how many of the critics of abortion would actually support it.",
    "cognition": "The person's cognition after perceiving the information might be that the author is advocating for the individual's right to choose, but is unsure of the decision itself. They are also questioning the hypocrisy of those who criticize abortion but would not support it themselves.",
    "action": "Agreed! Everyone should have the right to make their own decisions, regardless of what others think. #prochoice #abortionrights"
  },
  {
    "ID": 1208,
    "Target": "Legalization of Abortion",
    "Tweet": "The HHS contraceptive mandate has been challenged in #SCOUTS 6 times and has lost 6 times.      #contraception",
    "perception": "The person's perception of this tweet would be that the HHS contraceptive mandate has been unsuccessful in its attempts to be upheld in court, and that contraception is an important issue.",
    "cognition": "The person's cognition after perceiving the information would be that the HHS contraceptive mandate is not a reliable source of protection for contraception, and that access to contraception is an important issue that needs to be addressed.",
    "action": "Access to contraception is a fundamental right that must be protected. #contraception #abortion #reproductivehealth"
  },
  {
    "ID": 809,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @Singerman2000: Government  has exceeded its necessary size, scope and reach into the lives of its citizens. #Armenia...",
    "perception": "The person's perception of this tweet would be that the government is too large and intrusive, and that it needs to be scaled back. They may also agree with the sentiment that the government should not be involved in personal decisions such as abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the government should not be involved in personal decisions, and that it should not be able to dictate what people can and cannot do with their own bodies. They may also agree with the sentiment that the government should not be able to restrict access to abortion.",
    "action": "Agree with @Singerman2000 - the government should not be able to dictate what people can and cannot do with their own bodies. #LegalizeAbortion #Armenia"
  },
  {
    "ID": 1070,
    "Target": "Legalization of Abortion",
    "Tweet": "Gay Marriage & Murdering the Unborn will always be a SIN in GODS eyes. #ccot #tcot #jesus #bible.",
    "perception": "The person's perception of this tweet would be one of disapproval and disagreement, as it implies that abortion is a sin in the eyes of God. They may also feel frustrated or angry at the tweet's message.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting an anti-abortion stance, and that it is using religious beliefs to support this stance. They may also interpret the tweet as an attempt to shame those who support abortion rights.",
    "action": "Abortion is a personal decision and should not be judged by religious beliefs. #prochoice #reproductiverights #abortionrights"
  },
  {
    "ID": 669,
    "Target": "Legalization of Abortion",
    "Tweet": "@k_yoder That lady needs help, mental illness is a serious issue.",
    "perception": "The person's perception of this tweet might be that it is critical of someone who supports the legalization of abortion, suggesting that they have a mental illness.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that those who support the legalization of abortion are mentally ill, and that this is a negative view of the issue. They may also interpret the tweet as suggesting that mental illness is a valid reason to oppose the legalization of abortion.",
    "action": "@k_yoder Mental illness is not a valid reason to oppose the legalization of abortion. Everyone deserves access to safe and legal healthcare."
  },
  {
    "ID": 984,
    "Target": "Legalization of Abortion",
    "Tweet": "Why do you cry when a dog dies in a movie, but it doesn't seem to phase you that so many babies die because of abortion?",
    "perception": "The person's perception of this tweet is likely one of disapproval and criticism of their stance on abortion. They may feel attacked or judged for their beliefs.",
    "cognition": "The person's cognition after perceiving the information is likely to be one of confusion and frustration. They may be questioning why the death of a dog in a movie is seen as more important than the death of unborn babies due to abortion. They may also be feeling defensive and misunderstood.",
    "action": "Abortion is a complex issue and it's important to consider all perspectives. We should be working together to find solutions that respect the rights of all involved."
  },
  {
    "ID": 1126,
    "Target": "Legalization of Abortion",
    "Tweet": "Roe v Wade prevented the biggest crime spree predicted in U.S. history. The guns were there; the criminals weren't. #gunsense",
    "perception": "The person's perception of this tweet would be that it is in support of the legalization of abortion, as it references Roe v Wade and implies that the lack of criminal activity is due to the decision. They may also perceive the tweet as being in favor of gun control, as it includes the hashtag #gunsense.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion, as well as for gun control measures. They may also interpret the tweet as suggesting that the Roe v Wade decision has had a positive effect on the U.S. by preventing a predicted crime spree.",
    "action": "Agreed! #RoeVWade was a landmark decision that has had a positive impact on the US. #ProChoice #GunSense"
  }
]