[
  {
    "ID": 948,
    "Target": "Legalization of Abortion",
    "Tweet": "It hurts my  2 C ppl more offended over a flag/symbol than deaths/abortions of millions of innocent children! #flag #Mississippi",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that people are more concerned about a flag than the deaths and abortions of innocent children.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the injustice of people being more concerned about a flag than the deaths and abortions of innocent children. They would also likely be motivated to take action to support the legalization of abortion and to ensure that innocent children are not subjected to such injustice.",
    "action": "We must stand up for the rights of innocent children and support the legalization of abortion! #abortionrights #childrensrights"
  },
  {
    "ID": 1037,
    "Target": "Legalization of Abortion",
    "Tweet": "True equality\" allows all to be born.",
    "perception": "No to abortion\"\n\nThe person's perception of this tweet is likely to be one of disagreement, as it implies that abortion should not be legalized and that everyone should be born.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the restriction of abortion rights, and that it is implying that everyone should be born regardless of the circumstances.",
    "action": "Abortion should be a choice, not a mandate. Everyone should have the right to make decisions about their own bodies.\" #ProChoice #AbortionRights"
  },
  {
    "ID": 1263,
    "Target": "Legalization of Abortion",
    "Tweet": "I am 1 in 3... I have had an abortion #AbortionOnDemand #MenstruationMatters",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as well as a recognition of the importance of access to abortion and the need to destigmatize menstruation.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to access abortion on demand, and that menstruation is an important part of reproductive health that should not be stigmatized.",
    "action": "I stand with you! Access to abortion is a fundamental right and menstruation should be celebrated, not shamed. #AbortionOnDemand #MenstruationMatters"
  },
  {
    "ID": 778,
    "Target": "Legalization of Abortion",
    "Tweet": ".@giannaberettamo @GiaMolla @sphcs_news Happy feast of St. Gianna Beretta Molla! May she pray for us!",
    "perception": "The person's perception of this tweet would be one of admiration and respect for St. Gianna Beretta Molla, as well as a sense of hope that her prayers will be answered.",
    "cognition": "The person's cognition after perceiving the information would be that St. Gianna Beretta Molla was a strong advocate for the protection of unborn children, and that her legacy should be celebrated and honored.",
    "action": "Thank you for honoring the legacy of St. Gianna Beretta Molla. May her prayers be answered and her work continue to be remembered.\" #GiannaBerettaMolla #AbortionRights"
  },
  {
    "ID": 731,
    "Target": "Legalization of Abortion",
    "Tweet": "I think Marcus is slightly scared of my radical liberal side #feministally",
    "perception": "The person's perception of the tweet is likely to be one of support for the feminist cause and a positive attitude towards the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the person who wrote the tweet is a strong advocate for feminist causes and is unafraid to express their opinion on the issue of abortion. They may also interpret the tweet as a sign of solidarity with those who support the legalization of abortion.",
    "action": "I'm with you! #prochoice #feministally"
  },
  {
    "ID": 1040,
    "Target": "Legalization of Abortion",
    "Tweet": "@Caleb_Lopez760 it is legal bro and its",
    "perception": "The person's perception of this tweet is likely one of approval and support for the legalization of abortion. They may also perceive the tweet as a reminder that abortion is already legal in some places.",
    "cognition": "The person's cognition after perceiving the information is likely that the tweet is a reminder that abortion is already legal in some places, and that the author of the tweet supports the legalization of abortion. They may also interpret the tweet as a call to action to support the legalization of abortion in other places.",
    "action": "@Caleb_Lopez760 Thanks for the reminder! Let's keep fighting for the right to choose and make sure abortion is legal everywhere!"
  },
  {
    "ID": 915,
    "Target": "Legalization of Abortion",
    "Tweet": "@umich Unjustified homicide should ALWAYS be illegal, including #ProlifeYouth",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, and that it is advocating for the protection of unborn lives.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of unborn lives, and that it is against the legalization of abortion. They would likely interpret the tweet as a statement against their own beliefs.",
    "action": "@umich Abortion should be a decision made between a woman and her doctor, not the government. #ProchoiceYouth"
  },
  {
    "ID": 672,
    "Target": "Legalization of Abortion",
    "Tweet": "Someone snitched on the mom having sex with and playing naked twister with teens. I bet it was her Cock blocking ass children.",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it implies a negative judgement of the mother's behavior. They may also feel a sense of outrage at the judgemental tone of the tweet.",
    "cognition": "The person's cognition after perceiving the information would be to question the validity of the tweet and the motives of the person who posted it. They may also be concerned about the implications of the tweet, such as the potential for slut-shaming and victim-blaming.",
    "action": "This tweet is inappropriate and offensive. We should not be judging people for their personal choices. #NoShame #NoJudgement #LegalizeAbortion"
  },
  {
    "ID": 854,
    "Target": "Legalization of Abortion",
    "Tweet": "@EmilyBeaulieu1 maybe that's what he wants",
    "perception": "The person's perception of this tweet could be that the author is in favor of the legalization of abortion and is suggesting that it is the right choice. They may also perceive the tweet as being supportive and encouraging.",
    "cognition": "The person's cognition after perceiving the information could be that the author is suggesting that the legalization of abortion is the right choice and that they are supportive of the decision. They may also interpret the tweet as being encouraging and understanding of the situation.",
    "action": "@EmilyBeaulieu1 I agree, the legalization of abortion is the right choice and I'm glad you're supportive of it!"
  },
  {
    "ID": 1091,
    "Target": "Legalization of Abortion",
    "Tweet": "I'm pro choice for if you want to kill living babies, go right ahead.",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it is a very negative and insensitive view of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the author of the tweet is against abortion and has a very negative view of it. They would also likely interpret the tweet as being insensitive and offensive towards those who support abortion.",
    "action": "This tweet is offensive and insensitive. Abortion is a complex issue and should be discussed with respect and understanding."
  },
  {
    "ID": 842,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @FrCharles: .@giannaberettamo @GiaMolla @sphcs_news Happy feast of St. Gianna Beretta Molla! May she pray for us!",
    "perception": "The person's perception of this tweet would be one of admiration and respect for St. Gianna Beretta Molla, as well as a sense of appreciation for her prayers.",
    "cognition": "The person's cognition of this tweet would be that St. Gianna Beretta Molla is a respected figure who is worthy of admiration and prayer, and that her prayers are a source of comfort and strength.",
    "action": "Thank you for honoring St. Gianna Beretta Molla! Her prayers are a blessing to us all."
  },
  {
    "ID": 1260,
    "Target": "Legalization of Abortion",
    "Tweet": "If your agonist abortion get a vasectomy",
    "perception": "The person's perception of this tweet would be one of confusion and disbelief, as it appears to be suggesting that those who are in favor of abortion should get a vasectomy instead.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is suggesting an alternative to abortion, and that it is implying that those who are in favor of abortion should get a vasectomy instead. They may also interpret the tweet as being dismissive of the issue of abortion and its implications.",
    "action": "Abortion is a complex issue that deserves to be discussed with respect and understanding. Suggesting a vasectomy as an alternative is not the answer."
  },
  {
    "ID": 1120,
    "Target": "Legalization of Abortion",
    "Tweet": "@SenTedCruz Great job on @TODAYshow. #Scotus should have been eliminated 41 years ago when they called for the murder of children.",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that the Supreme Court has been responsible for the murder of children.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court has been complicit in the murder of children through their decision to legalize abortion. They would also likely be angry at the implication that the Supreme Court is responsible for the deaths of innocent children.",
    "action": "@SenTedCruz Your comments are unacceptable and offensive. Abortion should be a decision made between a woman and her doctor, not the Supreme Court."
  },
  {
    "ID": 998,
    "Target": "Legalization of Abortion",
    "Tweet": "It's great that same-sex marriage has been made legal, but how long will it take to make abortion illegal?",
    "perception": "The person's perception of this tweet would be one of disappointment that abortion is still not legal, and frustration that progress is slow.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet implies that abortion is still not legal, and that progress towards legalizing it is slow. They may also feel that the tweet is implying that same-sex marriage is more important than abortion.",
    "action": "Abortion should be a fundamental right, and it's time to make it legal! #AbortionRights #LegalizeAbortion"
  },
  {
    "ID": 1165,
    "Target": "Legalization of Abortion",
    "Tweet": "EVERYONE has a right and choice of either HEAVEN or HELL. #ProMarriage #ProFaith #EternalLifeMatters",
    "perception": "The person's perception of this tweet might be that it is promoting traditional values such as marriage and faith, and is likely against abortion. They may also perceive it as advocating for an eternal life that is more important than the right to choose.",
    "cognition": "The person's cognition of this tweet might be that it is promoting traditional values such as marriage and faith, and is likely against abortion. They may also interpret it as advocating for an eternal life that is more important than the right to choose, and that abortion is not an acceptable option.",
    "action": "Everyone has the right to choose their own path, and that includes the right to choose abortion. #ProChoice #MyBodyMyChoice #AbortionRightsMatter"
  },
  {
    "ID": 1064,
    "Target": "Legalization of Abortion",
    "Tweet": "I'm so glad this is Not My Home! #NMH #SCOTUSMarriage #ACA",
    "perception": "The person's perception of this tweet would be one of approval and support for the Supreme Court's decision on marriage equality and the Affordable Care Act. They may also be pleased to see that their home state is not part of the decision on abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court has made a positive decision on marriage equality and the Affordable Care Act, and that their home state is not part of the decision on abortion. They may also be pleased that their home state is not part of the decision on abortion.",
    "action": "Thankful that #NMH is not part of the decision on abortion. #SCOTUSMarriage #ACA"
  },
  {
    "ID": 1021,
    "Target": "Legalization of Abortion",
    "Tweet": "Equality in the states is a nice step forward to a better America. #ProudToLove",
    "perception": "The person's perception of this tweet is likely to be one of positivity and support for the cause of legalizing abortion. They may also feel a sense of pride in the progress being made towards equality.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for equality and progress in the United States, which could include the legalization of abortion. They may also interpret the hashtag as a sign of support for the cause, and feel a sense of pride in the progress being made.",
    "action": "I'm proud to stand with you in support of equality and the legalization of abortion! #ProudToLove"
  },
  {
    "ID": 819,
    "Target": "Legalization of Abortion",
    "Tweet": "If you aren't responsible enough to take care of a baby, why are you having unprotected sex?",
    "perception": "The person's perception of this tweet would be that it is critical of those who support the legalization of abortion, and that it implies that those who engage in unprotected sex should be held accountable for their actions.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that those who engage in unprotected sex should be held responsible for any potential consequences, such as an unwanted pregnancy, and that it is critical of those who support the legalization of abortion.",
    "action": "Abortion should be a safe and legal option for those who need it, regardless of how they got pregnant. Everyone deserves access to healthcare and reproductive rights."
  },
  {
    "ID": 971,
    "Target": "Legalization of Abortion",
    "Tweet": "Why would a mother advice her daughter to abort?? Shame, responsibility, but truly is that the best advice?? #ItsNotOnItsNotSafe",
    "perception": "The person's perception of this tweet would be one of disapproval and confusion, as it appears to be advocating against abortion despite the person's support of it. They may also feel a sense of sadness for the situation the mother and daughter are in.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is not a safe or responsible choice for a mother to make for her daughter. They may also be questioning the morality of the decision and whether it is the best advice for the daughter.",
    "action": "Abortion is a personal decision that should be respected. Everyone deserves access to safe and legal abortion services. #MyBodyMyChoice"
  },
  {
    "ID": 1202,
    "Target": "Legalization of Abortion",
    "Tweet": "In so many ways, to so many people around the world, America really IS the \"Great Satan\" #GayMarriage #Drugs #WakeUpAmerica",
    "perception": "The person's perception of the tweet might be that it is critical of America's stance on social issues such as gay marriage, drugs, and abortion. They may also perceive the tweet as a call to action to change the current laws and policies.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for social change in America, particularly in regards to legalizing abortion, gay marriage, and drugs. They may also interpret the tweet as a criticism of America's current stance on these issues and a call to action to make a change.",
    "action": "Agreed! We need to make sure everyone has access to the same rights and freedoms, regardless of gender, sexuality, or beliefs. #LegalizeAbortion #EqualRights #WakeUpAmerica"
  },
  {
    "ID": 1105,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @modernwerewolf: Why doesn't anyone congratulate me for NOT getting knocked up? Throw me a damn shower #ReproJustice",
    "perception": "The person's perception of this tweet would be one of understanding and support for the hashtag #ReproJustice, as well as a recognition of the struggles faced by those who choose not to have children. They may also feel a sense of solidarity with the author of the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the author of the tweet is highlighting the lack of recognition for those who choose not to have children, and that reproductive justice is an important issue that needs to be addressed. They may also recognize the need for more support and resources for those who choose not to have children.",
    "action": "@modernwerewolf We stand with you in support of #ReproJustice and the right to choose! #AbortionRights"
  },
  {
    "ID": 868,
    "Target": "Legalization of Abortion",
    "Tweet": "@ScottWalker   goes along with the world is the law of God and not of men",
    "perception": "The person's perception of this tweet would be that Scott Walker is against the legalization of abortion, as he is implying that the law of God should be followed instead of the law of men. They may also perceive the tweet as having a negative sentiment towards the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that Scott Walker is against the legalization of abortion, as he is implying that the law of God should be followed instead of the law of men. They may also interpret the tweet as a criticism of the legalization of abortion, as it implies that the law of God should be followed instead.",
    "action": "@ScottWalker Your stance on abortion is wrong. We should be following the law of the people, not the law of God."
  },
  {
    "ID": 1080,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @AdvocatesOfLife: RT @ProLifeYouth Adopting a child shouldn't cost more than aborting one.   #adoptionclini...",
    "perception": "The person's perception of this tweet would be that it is advocating for adoption over abortion, and that it is a pro-life sentiment.",
    "cognition": "The person's cognition of this tweet would be that it is suggesting that adoption should be a more accessible and affordable option than abortion, and that it is advocating for the protection of unborn children.",
    "action": "Adoption should be a viable option for those considering abortion, and we should work to make it more accessible and affordable. #prochoice"
  },
  {
    "ID": 1175,
    "Target": "Legalization of Abortion",
    "Tweet": "@Anti_Fox_News @MannyMooncup @lexinelli @MattSears4 @FactsVsOpinion Hypocrisy: saying #LoveWins while supporting #QuitKillingGirls",
    "perception": "The person's perception of this tweet would be one of disapproval and criticism of those who support the legalization of abortion. They may also feel that the tweet is implying that those who support abortion are hypocritical for also supporting the idea of love.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that those who support the legalization of abortion are hypocritical for also supporting the idea of love. They may also interpret the tweet as a criticism of their stance on abortion and feel that it is an attack on their beliefs.",
    "action": "Supporting the right to choose is not hypocritical. #LoveWins #MyBodyMyChoice"
  },
  {
    "ID": 1236,
    "Target": "Legalization of Abortion",
    "Tweet": "If #BlackLivesMatter why not black babies in the womb? Somehow their lives don't matter.... puzzled with that one. #catholic",
    "perception": "The person's perception of this tweet would be one of confusion and disagreement, as it implies that black lives in the womb do not matter, which contradicts the person's stance on abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that black lives in the womb do not matter, which is contrary to their beliefs. They would also likely interpret the tweet as an attempt to discredit the Black Lives Matter movement by associating it with abortion.",
    "action": "#BlackLivesMatter is about protecting the lives of all black people, including those in the womb. We must ensure that all lives are valued and respected. #AbortionRights #ProChoice"
  }
]