[
  {
    "ID": 1188,
    "Target": "Legalization of Abortion",
    "Tweet": "A pregnancy, planned or unplanned, brings spouses,families & everyone closer to each other. #Life is beautiful! #USA #SemST",
    "perception": "The person's perception of this tweet would be that it is conveying a positive sentiment about pregnancy and life in general, and is supportive of the idea that families should be brought closer together. They may also interpret the hashtag #USA to mean that the tweet is in support of the legalization of abortion in the United States.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the importance of family and the beauty of life, and is in support of the legalization of abortion in the United States. They may also interpret the tweet as a call to action to support the legalization of abortion in the United States.",
    "action": "I fully support the #LegalizationOfAbortion in the US. It's time to make sure that everyone has access to safe and legal abortion services. #SemST #USA"
  },
  {
    "ID": 775,
    "Target": "Legalization of Abortion",
    "Tweet": "Agree choice if woman's life in danger.  But rape - does the baby deserve death for crime of his/her father? @HelpBillColeman #SemST",
    "perception": "The person's perception of this tweet would be that the author is against abortion in cases of rape, but is in favor of it if the woman's life is in danger. They may also perceive that the author is asking for help from @HelpBillColeman on the issue of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the author is questioning the morality of abortion in cases of rape, and is seeking help from @HelpBillColeman to address the issue. They may also be considering the implications of abortion in cases of rape and the potential consequences for the unborn child.",
    "action": "@HelpBillColeman We must consider the implications of abortion in cases of rape and the potential consequences for the unborn child. #SemST"
  },
  {
    "ID": 857,
    "Target": "Legalization of Abortion",
    "Tweet": "words are meant to trigger strong emotional responses as well as to the medical inaccuracies & misogyny.. #SemST",
    "perception": "The person's perception of the tweet might be that it is critical of the legalization of abortion, and that it is likely to contain strong language and negative sentiment.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is likely to be critical of the legalization of abortion, and that it is likely to contain strong language and negative sentiment that could be damaging to the cause. They may also interpret the hashtag to mean that the tweet is related to the issue of sex and gender-based discrimination.",
    "action": "I disagree with the sentiment of this tweet. Abortion should be a safe and legal option for all women. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 1230,
    "Target": "Legalization of Abortion",
    "Tweet": "If being in a mother's womb isn't safe I guess neither are churches; specifically black ones #WhoIsBurningBlackChurches #SemST",
    "perception": "The person's perception of this tweet might be one of shock and outrage, as it appears to be making a connection between abortion and the burning of black churches. They may also feel a sense of solidarity with the hashtag, as it is advocating for justice and safety for all.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is making a comparison between the lack of safety for unborn babies and the lack of safety for black churches. They may also recognize that the hashtag is advocating for justice and protection for both unborn babies and black churches.",
    "action": "We must protect the safety of both unborn babies and black churches. #ProtectAllLives #SemST"
  },
  {
    "ID": 1082,
    "Target": "Legalization of Abortion",
    "Tweet": "That's like being into cannibalism but against abortion.comparing being against eggs but loving chicken. #cannibalism #analogy #SemST",
    "perception": "The person's perception of the tweet might be that it is making a comparison between being against abortion and being into cannibalism, and that it is making a point about the inconsistency of such a stance. They may also perceive the tweet as being critical of those who oppose abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that opposing abortion is an inconsistent stance, and that it is criticizing those who oppose abortion. They may also interpret the tweet as making a comparison between being against abortion and being into cannibalism.",
    "action": "Agree! Abortion should be a legal and safe option for everyone. #prochoice #abortionrights"
  },
  {
    "ID": 1178,
    "Target": "Legalization of Abortion",
    "Tweet": "@FoxNews @BristolsBlog Not possible. #BristolPalin doesn't believe in #SemST",
    "perception": "The person's perception of this tweet would be one of disagreement and disapproval of the idea of legalizing abortion, as it is associated with Bristol Palin, who does not believe in it. They may also perceive a negative sentiment towards the topic of abortion in general.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that Bristol Palin does not support the legalization of abortion, and that Fox News and Bristol's Blog are in agreement with her opinion. They may also interpret the tweet as a criticism of the idea of legalizing abortion.",
    "action": "@FoxNews @BristolsBlog Respectfully disagree. Everyone should have the right to make their own decisions about their bodies."
  },
  {
    "ID": 791,
    "Target": "Legalization of Abortion",
    "Tweet": "@WayneSense \"In check\" is putting it nicely. #MargaretSanger #SemST",
    "perception": "The person's perception of this tweet might be that it is in support of Margaret Sanger and her stance on abortion, and that it is a positive sentiment towards the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information might be that Margaret Sanger was a strong advocate for the legalization of abortion, and that the tweet is expressing support for her stance on the issue.",
    "action": "I'm with you! #LegalizeAbortion #MargaretSanger"
  },
  {
    "ID": 879,
    "Target": "Legalization of Abortion",
    "Tweet": "Since #roevwade 1/3 of my #generation has been #aborted. Where were their #rights?youthgen #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that a large portion of a generation has been aborted without their rights being taken into consideration.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the injustice of abortion laws, and that the rights of those affected by abortion laws have been ignored.",
    "action": "We must ensure that everyone's rights are respected and protected, regardless of their views on abortion. #roevwade #aborted #rights #youthgen #SemST"
  },
  {
    "ID": 682,
    "Target": "Legalization of Abortion",
    "Tweet": "@LuM1996 @KurtSchlichter #Obama cares more about deserters than unborn babies #ProtectTheUnprotected #AntiAbortion #SemST",
    "perception": "The person's perception of this tweet would be that it is strongly against abortion and in favor of protecting the unborn. They may also perceive it as being critical of President Obama for not doing enough to protect the unborn.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of the unborn and is critical of President Obama for not doing enough to protect them. They may also interpret the tweet as being an attack on the pro-choice movement and a call to action to protect the unborn.",
    "action": "@LuM1996 @KurtSchlichter We must protect the unborn and ensure that they have the same rights as any other person. #ProtectTheUnprotected #ProChoice"
  },
  {
    "ID": 732,
    "Target": "Legalization of Abortion",
    "Tweet": "One day I'm gonna set an abortion clinic on fire. Anyone wanna join? #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it appears to be advocating for the destruction of a clinic that provides abortion services.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the destruction of a clinic that provides abortion services, and that this is an unacceptable and dangerous action.",
    "action": "This kind of violence is unacceptable and dangerous. We must protect access to safe and legal abortion services. #ProtectAbortionRights"
  },
  {
    "ID": 1201,
    "Target": "Legalization of Abortion",
    "Tweet": "Don't see the big deal about all this #SemST",
    "perception": "The person's perception of this tweet would be that the author is dismissive of the issue of abortion and does not think it is a significant topic. They may also perceive the author to be against the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the author does not think the issue of abortion is important and is likely against its legalization. They may also think that the author is not taking the issue seriously and is not open to discussing it.",
    "action": "Abortion is an important issue that deserves to be taken seriously. #SemST #LegalizeAbortion"
  },
  {
    "ID": 916,
    "Target": "Legalization of Abortion",
    "Tweet": "#ProLifeYouth know that human life in the womb is as valuable as human life outside the womb. #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the pro-life movement and is against the legalization of abortion. They may also perceive the sentiment of the tweet to be strongly against abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the pro-life movement and is against the legalization of abortion. They may also interpret the tweet to mean that human life in the womb is just as valuable as human life outside the womb.",
    "action": "#ProChoiceYouth know that every person has the right to make decisions about their own body. #SemST"
  },
  {
    "ID": 860,
    "Target": "Legalization of Abortion",
    "Tweet": "Thank you @PPact for treating me with kindness & respect & TLC during my wellness exam. #womenshealth #yaycondoms #SemST",
    "perception": "The person's perception of this tweet would be one of appreciation and support for Planned Parenthood and the services they provide, as well as a positive attitude towards contraception and women's health.",
    "cognition": "The person's cognition after perceiving the information would be that Planned Parenthood is providing quality care and support to its patients, and that contraception is an important part of women's health.",
    "action": "Thank you @PPact for providing quality care and support to women and for advocating for contraception as an important part of women's health! #womenshealth #yaycondoms #SemST"
  },
  {
    "ID": 782,
    "Target": "Legalization of Abortion",
    "Tweet": "Kudos to the mentality that believes people who are dumb enough to not use protection are 'mature enough' to take care of a baby. #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval and criticism of those who support the legalization of abortion. They may also perceive a sense of sarcasm in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is mocking those who support the legalization of abortion, and that it implies that those who do not use protection are not mature enough to take care of a baby.",
    "action": "Abortion should be a choice for those who need it, not a punishment for those who don't use protection. #ReproRights"
  },
  {
    "ID": 805,
    "Target": "Legalization of Abortion",
    "Tweet": "@WildChild69 No, U want 2 limit the doctor's choice & force him/her to help w/ abortions. I want to protect life & human dignity. #SemST",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, and is in favor of protecting life and human dignity.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for limiting the doctor's choice when it comes to abortions, and is against the legalization of abortion. They believe that protecting life and human dignity is more important than allowing doctors to make their own decisions.",
    "action": "@WildChild69 I disagree. We should be protecting the right of doctors to make their own decisions, not limiting them. #SemST"
  },
  {
    "ID": 1103,
    "Target": "Legalization of Abortion",
    "Tweet": "(3/3) So when @AUL tells you MLK was #prolife, they're lying. (Their gullible followers r likely just misinformed). #UniteBlue #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of the organization @AUL for claiming that Martin Luther King Jr. was pro-life, and that their followers are likely misinformed. The tweet also implies that the person supports the #UniteBlue and #SemST movements.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion, and that the organization @AUL is misrepresenting the views of Martin Luther King Jr. in order to push their own agenda.",
    "action": "Agree! We must #UniteBlue and #SemST to ensure that everyone has access to safe and legal abortion services. #ProChoice"
  },
  {
    "ID": 907,
    "Target": "Legalization of Abortion",
    "Tweet": "#ProLifeYouth know that life begins at conception. #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the pro-life movement and is against the legalization of abortion. They may also perceive it as having a negative sentiment towards those who support abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the pro-life movement and is against the legalization of abortion. They may also interpret the tweet as implying that life begins at conception and that those who support abortion are wrong.",
    "action": "Abortion should be a decision made between a woman and her doctor, not the government. #MyBodyMyChoice #SemST"
  },
  {
    "ID": 940,
    "Target": "Legalization of Abortion",
    "Tweet": "I get the whole \"Kill your darlings\" advice, but I feel like an abortionist with all these unfinished stories. #Writing  #Literary #SemST",
    "perception": "The person's perception of this tweet might be that it is expressing a sense of sadness and regret about the need to make difficult decisions, such as abortion. They may also interpret the tweet as a commentary on the creative process of writing, and the need to make difficult choices in order to create a successful story.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is making a comparison between the difficult decisions that must be made in the creative process of writing and the difficult decisions that must be made in the process of abortion. They may also interpret the tweet as a commentary on the need to make difficult choices in order to create a successful story.",
    "action": "It's important to recognize the difficult decisions that must be made in order to create something meaningful, whether it's a story or a life. #Abortion #Writing #SemST"
  },
  {
    "ID": 724,
    "Target": "Legalization of Abortion",
    "Tweet": "Both Democrats and #IslamicState murder by dismemberment. The only difference is the age of their victims. #ISIS #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that Democrats are committing the same acts of violence as the Islamic State. They may also feel a sense of disbelief that such a comparison is being made.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attempt to equate the Democratic party with the Islamic State, and to view the tweet as an attack on the Democratic party. They may also view the tweet as an attempt to discredit the Democratic party and its policies, such as the legalization of abortion.",
    "action": "This comparison is outrageous and offensive. #Democrats are not terrorists and should not be equated with #ISIS. #AbortionRights"
  },
  {
    "ID": 1258,
    "Target": "Legalization of Abortion",
    "Tweet": "@ghhshirley @WordfactoryQ @LeahNTorres Abortion Workers Charged with Manslaughter After Another Woman Dies From #SemST",
    "perception": "The person's initial perception of this tweet would be one of shock and outrage, as it implies that someone has died due to an abortion procedure. They may also feel a sense of injustice, as the workers have been charged with manslaughter.",
    "cognition": "The person's cognition after perceiving the information would be to question the circumstances of the woman's death and to consider the implications of the workers being charged with manslaughter. They may also be concerned about the safety of abortion procedures and the potential for similar incidents to occur in the future.",
    "action": "This is a tragedy. We must ensure that abortion procedures are safe and that those responsible for any deaths are held accountable. #AbortionRights"
  },
  {
    "ID": 945,
    "Target": "Legalization of Abortion",
    "Tweet": "Cursed be anyone who takes a bribe to shed innocent blood.' And all the people shall say, 'Amen.'  Deuteronomy 27:25 #dropsmic #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval of abortion, as it references a Bible verse condemning those who take bribes to shed innocent blood. They may also perceive a sense of finality in the hashtag #dropsmic, suggesting that the conversation is over.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating against abortion, as it references a Bible verse condemning those who take bribes to shed innocent blood. They may also interpret the hashtag #dropsmic as a sign that the conversation is over and that the opinion expressed in the tweet is final.",
    "action": "Abortion should be a decision made between a woman and her doctor, not dictated by religious beliefs. #MyChoice #SemST"
  },
  {
    "ID": 1072,
    "Target": "Legalization of Abortion",
    "Tweet": "@nytimes Thanks to anti-choicers, women dealing with this may also face prosecution. #SemST",
    "perception": "The person's perception of this tweet would be one of anger and frustration towards those who oppose the legalization of abortion, as well as a sense of injustice towards women who may face prosecution due to their decisions.",
    "cognition": "The person's cognition after perceiving the information would be that anti-choicers are creating an environment of fear and oppression for women, and that this is an unacceptable violation of their rights. They would also likely feel that the legal system should be protecting women's rights to make their own decisions about their bodies.",
    "action": "It's unacceptable that women are facing prosecution for making decisions about their own bodies. We must fight for their rights and protect them from oppression #SemST"
  },
  {
    "ID": 827,
    "Target": "Legalization of Abortion",
    "Tweet": "@emrata did u become a lib before or after u made it in Hollywood? #BlackLivesDontMatter #whitebrunch #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be a criticism of liberal beliefs and values. They may also feel a sense of anger towards the person who posted the tweet for their insensitive and offensive language.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an attack on liberal beliefs and values, and that the person who posted it is insensitive and offensive. They may also feel a sense of indignation towards the person who posted the tweet for their lack of respect for the beliefs of others.",
    "action": "@emrata Your language is offensive and disrespectful. #BlackLivesMatter #RespectOthers #SemST"
  },
  {
    "ID": 1017,
    "Target": "Legalization of Abortion",
    "Tweet": "Because as long as we're ending innocent lives, love has won nothing. #SemST",
    "perception": "The person's perception of the tweet would be one of disapproval of abortion, as it implies that abortion is ending innocent lives and that love has not been victorious.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and that it is not a victory for love. They may also interpret the hashtag to mean that the tweet is advocating for the protection of the rights of the unborn.",
    "action": "Abortion should be a choice that is available to those who need it. #ReproRights"
  },
  {
    "ID": 1169,
    "Target": "Legalization of Abortion",
    "Tweet": "#DonRients: people aren't just killed by guns.  9 people died and that's sad.  But how many die daily from #abortion? #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of abortion and implies that it is responsible for a large number of deaths. They may also perceive it as an attempt to draw attention to the issue of abortion and its consequences.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is responsible for a large number of deaths and is attempting to draw attention to the issue. They may also interpret the tweet as an attempt to discredit the idea of legalizing abortion.",
    "action": "#Abortion is a complex issue and should be discussed with respect. We should focus on providing safe and accessible healthcare for all, not on assigning blame. #SemST"
  }
]