[
  {
    "ID": 274,
    "Target": "Feminist Movement",
    "Tweet": "@UN_Women @WomenUndrSiege @OSCE_RFoM It should be considered a hate crime if someone makes a threat against a woman. #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as it calls for the protection of women from threats. They would also likely feel encouraged by the hashtag, which suggests that the issue is being taken seriously.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of women from threats, and that the hashtag is a sign that the issue is being taken seriously. They would likely feel encouraged by the tweet and its implications for the Feminist Movement.",
    "action": "We fully support this call for the protection of women from threats. #FeministMovement #SemST"
  },
  {
    "ID": 504,
    "Target": "Feminist Movement",
    "Tweet": "And people wonder why #feminists aren't taken seriously...  At least give me 1 every time I hear this, I'd be rich!  #SemST",
    "perception": "The person's perception of this tweet is likely one of frustration and disbelief, as it implies that feminists are not taken seriously and that their efforts are not rewarded.",
    "cognition": "The person's cognition after perceiving the information is likely that the speaker is frustrated with the lack of recognition and reward for their efforts in the feminist movement. They may also feel that the speaker is highlighting the unfairness of the situation and the need for more support for feminists.",
    "action": "It's time to recognize and reward the hard work of #feminists! We need to show our support and appreciation for their efforts. #SemST"
  },
  {
    "ID": 31,
    "Target": "Feminist Movement",
    "Tweet": "@SirWilliamValen insulting, thinking you can make a switch like that. if it wasn't written for us, it wasn't for us #SemST",
    "perception": "The person's perception of the tweet would be one of frustration and anger, as it appears to be mocking the Feminist Movement and disregarding its importance. They may also feel a sense of solidarity with the hashtag, as it implies a shared sentiment of standing up for the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing the Feminist Movement and that the hashtag is a sign of solidarity with the cause. They may also interpret the tweet as a call to action to stand up for the rights of women and fight against the oppression of the patriarchy.",
    "action": "We won't stand for this kind of disrespect! #FeministMovement #EqualityForAll"
  },
  {
    "ID": 313,
    "Target": "Feminist Movement",
    "Tweet": "Meritocracy is only oppressive against the incompetent - if you believe it's sexist, YOU are the sexist one #therealkind #SemST",
    "perception": "The person's initial perception of the tweet would be that it is making a statement against the Feminist Movement, as it implies that those who believe in meritocracy are being labeled as sexist. They may also perceive the tweet as being dismissive of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that those who believe in meritocracy are being labeled as sexist, and that the Feminist Movement is being dismissed. They may also interpret the tweet as being dismissive of the Feminist Movement's goals and beliefs.",
    "action": "Meritocracy should be inclusive of all genders, not oppressive. #FeministMovement #EqualityForAll"
  },
  {
    "ID": 24,
    "Target": "Feminist Movement",
    "Tweet": "Women get paid far more than men to appear in pornography. How come no one is talking about this blatant sexism?!  @amazingatheist #SemST",
    "perception": "The person's perception of this tweet would be one of outrage and disbelief at the inequality between men and women in the pornography industry. They would likely be in agreement with the sentiment expressed in the tweet and be eager to join the conversation and support the #SemST hashtag.",
    "cognition": "The person's cognition after perceiving the information would be that the gender pay gap in the pornography industry is a form of sexism that needs to be addressed. They would likely be motivated to take action to support the Feminist Movement and the #SemST hashtag in order to help bring about change.",
    "action": "This is unacceptable! We must take action to ensure that women are paid equally in the pornography industry. #SemST #FeministMovement"
  },
  {
    "ID": 530,
    "Target": "Feminist Movement",
    "Tweet": "Gender norms my ass: definitely moved a few 40lb boxes in wedges #muscles #SemST",
    "perception": "The person's perception of this tweet would be that it is a humorous and empowering message that challenges traditional gender norms and celebrates physical strength. They may also feel a sense of solidarity with the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a humorous way of challenging traditional gender norms and celebrating physical strength, regardless of gender. They may also feel a sense of solidarity with the person who posted the tweet, as they are advocating for a cause they support.",
    "action": "Love this! Challenging gender norms and celebrating physical strength is so important. #FeministMovement #Strength"
  },
  {
    "ID": 15,
    "Target": "Feminist Movement",
    "Tweet": "@lucyblakeman12 You need feminism more than you need anything else in your life. You couldn't survive or speak w/o it. #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support and appreciation for the Feminist Movement. They may also feel encouraged by the message that feminism is essential for survival and speaking out.",
    "cognition": "The person's cognition after perceiving the information is likely to be that feminism is an important part of life and that it is necessary for survival and speaking out. They may also feel empowered by the message that feminism is essential for their wellbeing.",
    "action": "@lucyblakeman12 I'm so inspired by your message! Feminism is essential for our survival and speaking out. #FeministMovement"
  },
  {
    "ID": 221,
    "Target": "Feminist Movement",
    "Tweet": "It doesnt take a miracle all takes signature and a few kind people to know not to kill innocent a women #MaryJaneLives #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it calls for people to recognize the value of women's lives. They may also feel encouraged by the hashtag, which suggests that the movement is gaining momentum.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the protection of women's lives and that the Feminist Movement is gaining traction. They may also feel inspired by the hashtag, which suggests that the movement is gaining momentum.",
    "action": "Thank you for standing up for women's rights! #FeministMovement #MaryJaneLives #SemST"
  },
  {
    "ID": 453,
    "Target": "Feminist Movement",
    "Tweet": "@YMFROMTHEBLOCK YES girl you can put almost anything in that joint #Islam #SemST",
    "perception": "The person's perception of the tweet would be one of support and encouragement for the Feminist Movement, as well as a celebration of the intersectionality of feminism with other movements such as Islam and SemST.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is celebrating the intersectionality of feminism with other movements, and that it is encouraging and empowering women to take action and make a difference.",
    "action": "@YMFROMTHEBLOCK We stand with you in solidarity! #Feminism #Islam #SemST"
  },
  {
    "ID": 199,
    "Target": "Feminist Movement",
    "Tweet": "they opened a blenders in the vhs GIRLS bathroom today! #TheMoreYouKnow #SemST",
    "perception": "The person's perception of this tweet would be one of excitement and support for the Feminist Movement, as it celebrates the opening of a blenders in the VHS GIRLS bathroom. They would also likely appreciate the hashtag, which serves to spread awareness of the movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is celebrating the progress of the Feminist Movement, and that it is important to recognize and support the efforts of those who are working to make a difference. They would also likely recognize the importance of spreading awareness of the movement through the hashtag.",
    "action": "This is amazing! Congratulations to everyone involved in making this happen! #FeministMovement #Progress"
  },
  {
    "ID": 355,
    "Target": "Feminist Movement",
    "Tweet": "RT @mrkrusader: @attorneybharti @TimesNow @ndtv @abpnewstv this is a typical example of #misandry and #Scrap498a #498a #fakecases... #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of the feminist movement, as it mentions misandry and calls for the scrapping of a law that is seen as protecting women. They may also perceive it as being hostile and negative towards the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the removal of a law that is seen as protecting women, and that it is critical of the feminist movement. They may also interpret it as being hostile and negative towards the feminist movement.",
    "action": "#Misandry and #Scrap498a are not the answer. We must work together to ensure that all genders are treated equally and fairly. #Feminism #Equality"
  },
  {
    "ID": 388,
    "Target": "Feminist Movement",
    "Tweet": "Great to see singer turned activist @charlottechurch on the stage to interview @pussyrrriot #Glastonbury #glasto #charlottechurch #SemST",
    "perception": "The person's perception of the tweet would be one of admiration and support for Charlotte Church's activism and for Pussy Riot's work. They would also likely be excited to see the two together on stage at Glastonbury.",
    "cognition": "The person's cognition after perceiving the information would be that Charlotte Church is using her platform to support and amplify the voices of other activists, such as Pussy Riot. They would also likely recognize the importance of the event and the significance of the collaboration between the two.",
    "action": "So proud to see @charlottechurch and @pussyrrriot together on stage at #Glastonbury! #SemST #FeministMovement"
  },
  {
    "ID": 266,
    "Target": "Feminist Movement",
    "Tweet": "@brandileighhhhh its called sexual coercion, and it is the same as rape. #RapeCulture #SemST",
    "perception": "The person's perception of the tweet would be one of shock and outrage, as it is discussing the serious issue of sexual coercion and rape. They would likely be in support of the hashtag topics, as they are related to the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that sexual coercion is a serious issue that needs to be addressed and that the hashtag topics are related to the Feminist Movement. They would likely be in agreement with the sentiment of the tweet and would be motivated to take action to help end rape culture.",
    "action": "We must take action to end rape culture and support the Feminist Movement. #RapeCulture #SemST #EndRapeCulture"
  },
  {
    "ID": 554,
    "Target": "Feminist Movement",
    "Tweet": "As a child, had to 'recycle' own socks from festering laundry heap, as feminist mother says \"I'm not your slave! #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration and respect for the mother's stance on gender equality, as well as a sense of understanding for the difficult situation the child was in.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the mother was standing up for her rights and the rights of her child, and that she was making a statement about the unfairness of gender roles in society.",
    "action": "Respect to this mother for standing up for her rights and the rights of her child! #FeministMovement #GenderEquality"
  },
  {
    "ID": 338,
    "Target": "Feminist Movement",
    "Tweet": "@arristotlee Thank you, #progressive-minded pursuers of familial and societal Dystopia. #Democrats #Liberals #SemST",
    "perception": "The person's perception of the tweet might be that it is a positive message of support for progressive-minded individuals who are working towards a better future. They may also interpret the hashtags as a sign of support for the Democratic and Liberal parties, as well as for the SemST movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is expressing appreciation for those who are working towards a better future, and that the hashtags are a sign of support for the Democratic and Liberal parties, as well as for the SemST movement.",
    "action": "@arristotlee We stand with you in your pursuit of a better future! #FeministMovement #Progressives #Equality"
  },
  {
    "ID": 291,
    "Target": "Feminist Movement",
    "Tweet": "I'll gladly accept my face on \"the least used of the most used bills\" #NeverSatisfied #SemST",
    "perception": "The person's perception of the tweet would be one of admiration and support for the Feminist Movement, as the hashtag #NeverSatisfied implies a desire for continued progress and the hashtag #SemST suggests a commitment to gender equality.",
    "cognition": "The person's cognition of the tweet would be that the author is advocating for greater representation of women on currency, and that they are committed to continuing the fight for gender equality.",
    "action": "I'm with you! #FeministMovement #NeverSatisfied #SemST"
  },
  {
    "ID": 272,
    "Target": "Feminist Movement",
    "Tweet": "Because women are seen as \"soft,\" \"weak,\" and \"emotional\" in the eyes of male politicians #SemST",
    "perception": "The person's perception of the tweet would be one of frustration and anger, as it highlights the gender stereotypes that are perpetuated by male politicians. They would also likely feel a sense of solidarity with the Feminist Movement, as the tweet speaks to the need for gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that gender stereotypes are still a major issue in politics, and that the Feminist Movement is necessary to combat this inequality. They would also likely recognize the need for more female representation in politics in order to create a more equitable society.",
    "action": "We need to challenge these outdated gender stereotypes and ensure that women are represented in politics. #FeministMovement #GenderEquality"
  },
  {
    "ID": 265,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS  Why don't you expel the man-haters poisoning your feminism?  Why  you admire them?   #GamerGate #NotY... #SemST",
    "perception": "The person's initial perception of the tweet would be one of confusion and frustration, as it appears to be critical of the Feminist Movement and its supporters. They may also feel a sense of anger towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the Feminist Movement by suggesting that it is full of man-haters and that its supporters admire them. They may also feel that the tweet is attempting to discredit the movement by associating it with the GamerGate and SemST hashtags.",
    "action": "Feminism is about equality and respect for all genders, not about hating men. #FeminismIsForEveryone #EqualityForAll"
  },
  {
    "ID": 170,
    "Target": "Feminist Movement",
    "Tweet": "@Vivvyyy what's so wrong with getting dick? How come when guys do it they're praised for it? YOU SEXIST #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards the sexism that is being perpetuated. They may also feel a sense of solidarity with the person who posted the tweet, as they share the same views on the issue.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the double standards that exist in society when it comes to sexual behavior. They may also recognize that the tweet is calling out the sexism that is present in society and how it is perpetuated by certain people.",
    "action": "@Vivvyyy You're absolutely right! We need to stand up against sexism and double standards in our society. #SemST"
  },
  {
    "ID": 327,
    "Target": "Feminist Movement",
    "Tweet": "Mother and I were laughed at by first graders because mother threw a bug on me and we both screamed and ran away #strongwomen #SemST",
    "perception": "The person's perception of this tweet would be one of amusement and admiration, as it celebrates the strength of women in a humorous way. They may also feel a sense of solidarity with the person who posted the tweet, as it is a shared experience of being laughed at by first graders.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is celebrating the strength of women, even in the face of ridicule. They may also recognize the importance of solidarity between women, as the tweet implies that the mother and daughter were able to laugh at themselves and their situation.",
    "action": "Laughing at ourselves is a sign of strength! #strongwomen #SemST"
  },
  {
    "ID": 481,
    "Target": "Feminist Movement",
    "Tweet": "@_toekey and the offensive joke is left out of the context... #SpankAFeminist  #SemST",
    "perception": "The person's initial perception of the tweet would be one of confusion and offense, as the hashtag implies a negative sentiment towards the Feminist Movement. They may also feel that the joke has been taken out of context, which could be seen as disrespectful.",
    "cognition": "The person's cognition after perceiving the information would be to question the intent of the tweet and the person who posted it. They may also feel that the joke is inappropriate and that it is being used to belittle the Feminist Movement.",
    "action": "@_toekey Please don't use jokes to belittle the Feminist Movement. #RespectFeminism #SemST"
  },
  {
    "ID": 382,
    "Target": "Feminist Movement",
    "Tweet": "The cutting and mutilation of my and my daughters' genitals is an expression of my #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it appears to be advocating for a practice that is widely seen as a violation of human rights. They may also feel a sense of solidarity with the person who posted the tweet, as they are advocating for a cause that the person supports.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right of people to practice their own cultural traditions, even if those traditions are seen as controversial or oppressive by some. They may also recognize that the tweet is highlighting the importance of respecting the autonomy of individuals and their right to make decisions about their own bodies.",
    "action": "I stand in solidarity with those who are fighting for the right to practice their own cultural traditions without fear of judgement or oppression. #SemST"
  },
  {
    "ID": 51,
    "Target": "Feminist Movement",
    "Tweet": "How much radical feminist does there have to be before feminist start rethinking their position about feminism? #SemST",
    "perception": "The person's perception of this tweet could be that it is critical of the feminist movement and implies that feminists need to reevaluate their beliefs. They may also feel that the hashtag is dismissive of the movement.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is questioning the validity of the feminist movement and suggesting that it needs to be reevaluated. They may also feel that the hashtag is dismissive of the movement and its goals.",
    "action": "Feminism is a movement for equality and justice, and it should not be dismissed or questioned. #FeminismMatters"
  },
  {
    "ID": 635,
    "Target": "Feminist Movement",
    "Tweet": "if women didn't have double standards then they would have no standards. #MagicMikeXXL #YesAllWomen #SemST",
    "perception": "The person's perception of the tweet would be that it is making a statement about double standards for women and is likely in support of the Feminist Movement. They may also perceive the tweet as being critical of the lack of standards for women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that women are held to different standards than men, and that this is a problem that needs to be addressed. They may also interpret the tweet as being critical of the lack of standards for women and as a call to action to support the Feminist Movement.",
    "action": "Agreed! We need to work together to end double standards for women and create a more equitable society. #FeministMovement #YesAllWomen #SemST"
  },
  {
    "ID": 551,
    "Target": "Feminist Movement",
    "Tweet": "Being raised by a feminist in rotting, soiled clothes - \"I'm not your slave! #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration and support for the feminist movement, as well as a recognition of the struggles faced by those who are oppressed. They may also feel a sense of solidarity with the person who wrote the tweet.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is highlighting the importance of standing up for one's rights and not allowing oneself to be taken advantage of. They may also recognize the importance of recognizing and challenging oppressive systems and structures.",
    "action": "Thank you for sharing your story and standing up for your rights! #FeministMovement"
  }
]