[
  {
    "ID": 897,
    "Target": "Legalization of Abortion",
    "Tweet": "Without #life, the right to liberty and the pursuit of happiness aren't possible. #ProLifeYouth #AllLivesMatter #SemST",
    "perception": "The person's perception of this tweet might be that it is against the legalization of abortion, as it emphasizes the importance of life and the hashtag #ProLifeYouth implies a pro-life stance.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the protection of life and is against the legalization of abortion. They might also interpret the hashtag #AllLivesMatter as a reference to the pro-life movement.",
    "action": "#AbortionRights are essential for women's autonomy and bodily integrity. #MyBodyMyChoice #ReproductiveJustice #SemST"
  },
  {
    "ID": 1025,
    "Target": "Legalization of Abortion",
    "Tweet": "Now that there's marriage equality, can we start working on equal rights for unborn children? #SemST",
    "perception": "The person's perception of this tweet would be one of disagreement, as it implies that unborn children should have rights that are equal to those of married couples. They may also feel frustrated that the tweet is attempting to equate the two issues, when they believe that abortion should be a legal right.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to equate the rights of unborn children with those of married couples, which they disagree with. They may also feel that the tweet is attempting to undermine the importance of the right to abortion, which they support.",
    "action": "Marriage equality and abortion rights are two separate issues. We should focus on protecting the rights of those who can make their own decisions. #SemST"
  },
  {
    "ID": 876,
    "Target": "Legalization of Abortion",
    "Tweet": "Does a #pregnant #woman have 2 heads, 2 hearts, 4 arms, and 4 legs? #prolifeyouth #prolifegen #didntthinkso #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the pro-life movement and is against the legalization of abortion. They may also perceive the tweet as being insensitive and dismissive of the difficult decisions that pregnant women face.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that pregnant women should not be allowed to make decisions about their own bodies, and that the pro-life movement is trying to control women's reproductive rights. They may also interpret the tweet as being dismissive of the difficult decisions that pregnant women face.",
    "action": "#Prochoiceyouth #prochoicegen #respectwomen #SemST Women should have the right to make decisions about their own bodies. #abortionrights"
  },
  {
    "ID": 1098,
    "Target": "Legalization of Abortion",
    "Tweet": "@SaculSacul @GVPrayerWarrior No guarantee she will be destroyed I trust God. #SemST",
    "perception": "The person's perception of this tweet might be that it is against the legalization of abortion, as it implies that God will protect the unborn child. They may also perceive it as a religious sentiment, as it includes the hashtag #SemST.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that God will protect the unborn child, and that it is a religious sentiment against the legalization of abortion.",
    "action": "@SaculSacul @GVPrayerWarrior Abortion should be a choice and a right for all women. #ProChoice"
  },
  {
    "ID": 1173,
    "Target": "Legalization of Abortion",
    "Tweet": "@__HisKindaCrazy @_QueenTacoBell @thumperbunny88 Abortion is NOT illegal and I would never judge a woman for making that choice. #SemST",
    "perception": "The person's perception of the tweet would be one of support and acceptance of the legalization of abortion. They would also likely perceive a sentiment of understanding and respect for a woman's right to make her own decisions.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion and that it is expressing respect for a woman's right to make her own decisions. They would also likely interpret the tweet as a statement of support for women who choose to have an abortion.",
    "action": "Thank you for your support of the legalization of abortion and for respecting a woman's right to make her own decisions. #SemST"
  },
  {
    "ID": 923,
    "Target": "Legalization of Abortion",
    "Tweet": "@LogicOfLife7 No one is advocating \"punishment\". Would you force ppl to give birth against their wills? #rapeculture #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the legalization of abortion, and is critical of the idea of punishing people for having abortions.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is arguing that forcing people to give birth against their will is a form of punishment, and that this is a part of rape culture. They would also understand that the tweet is advocating for the legalization of abortion.",
    "action": "@LogicOfLife7 Absolutely! No one should be forced to give birth against their will. #prochoice #abortionrights"
  },
  {
    "ID": 1132,
    "Target": "Legalization of Abortion",
    "Tweet": "Justice Breyer et al think injections into arms of killers is heinous.  No word on acidic saline executing unborn babies, however.  #SemST",
    "perception": "The person's perception of this tweet might be one of frustration and anger, as it appears to be implying that the injection of lethal substances into convicted killers is considered heinous, while the abortion of unborn babies is not given the same consideration.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the abortion of unborn babies is not given the same consideration as the injection of lethal substances into convicted killers, and that this is an unjust double standard.",
    "action": "It's unacceptable that the lives of unborn babies are not given the same consideration as convicted killers. #AbortionRights #JusticeForAll"
  },
  {
    "ID": 986,
    "Target": "Legalization of Abortion",
    "Tweet": "It's so brilliant that #lovewins - now extend the equality to women's rights #abortionrights #SemST",
    "perception": "The person's perception of the tweet would be one of support and approval for the legalization of abortion, as well as a sense of optimism that the hashtag #lovewins is being extended to women's rights.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion and that the hashtag #lovewins is being used to emphasize the importance of women's rights. They would also likely interpret the tweet as a call to action to support the legalization of abortion.",
    "action": "I'm in full support of #abortionrights and #lovewins! Let's keep fighting for women's rights and equality!"
  },
  {
    "ID": 736,
    "Target": "Legalization of Abortion",
    "Tweet": "it's ironic that ppl will perform lifesaving therapies on animals to preserve their lives-but have staunch views in favor of #SemST",
    "perception": "The person's perception of the tweet might be that it is ironic that people are willing to save the lives of animals, yet have strong opinions in favor of abortion. They may also perceive the tweet as a criticism of those who support the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that those who support the legalization of abortion are hypocritical for not wanting to save the lives of unborn babies. They may also interpret the tweet as a criticism of the pro-choice movement.",
    "action": "It's not hypocritical to support the right to choose. Everyone should have the right to make decisions about their own bodies and lives.\" #SemST"
  },
  {
    "ID": 804,
    "Target": "Legalization of Abortion",
    "Tweet": "Today, AB 775 passed out of Committee on Judiciary 3-7. We will let you know how to help! #SemST",
    "perception": "The person's perception of this tweet would be one of disappointment, as the bill did not pass, but also of hope, as there is still a chance to help the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the bill did not pass, but that there is still a chance to help the cause by taking action. They may also recognize the hashtag as a call to action, and be motivated to take part in the fight for the legalization of abortion.",
    "action": "We won't give up! Let's keep fighting for the legalization of abortion! #SemST #AbortionRights"
  },
  {
    "ID": 1182,
    "Target": "Legalization of Abortion",
    "Tweet": "SCOTUS has caused more repression and racism in this nation that any other group of people in America. #DredScott #Marriage #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards the Supreme Court for its role in perpetuating racism and repression in the US. They may also feel a sense of injustice towards the decisions made in the Dred Scott and Marriage cases.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court has been a major contributor to the racism and repression that exists in the US, and that the decisions made in the Dred Scott and Marriage cases have been unjust.",
    "action": "The Supreme Court has a long history of upholding oppressive systems and denying basic rights. We must fight for justice and equality for all. #DredScott #Marriage #SemST"
  },
  {
    "ID": 711,
    "Target": "Legalization of Abortion",
    "Tweet": "Children are the greatest blessing which God has bestowed on man and woman. -Pope Francis #LifeisaGift #SemST",
    "perception": "The person's perception of this tweet might be that it is conveying a pro-life sentiment, as it is emphasizing the value of life and the blessing of children. They may also perceive it as a criticism of abortion, as it is using hashtags such as #LifeisaGift and #SemST.",
    "cognition": "The person's cognition of this tweet might be that it is advocating for the protection of unborn children and against the legalization of abortion. They may also interpret it as a message that life is a precious gift and should be respected and valued.",
    "action": "I disagree with the message of this tweet. Everyone should have the right to make decisions about their own bodies and lives, including the right to access safe and legal abortion.\" #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 1080,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @AdvocatesOfLife: RT @ProLifeYouth Adopting a child shouldn't cost more than aborting one.   #adoptionclini... #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for adoption over abortion, and that it is a pro-life sentiment.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is suggesting that adoption should be a more accessible and affordable option than abortion, and that it is a call to action to make adoption more accessible and affordable.",
    "action": "Agreed! We need to make adoption more accessible and affordable for everyone. #adoptionclinic #SemST"
  },
  {
    "ID": 1026,
    "Target": "Legalization of Abortion",
    "Tweet": "@web_rant No, it shows that liberals should start thinking about the consequences of their actions #polygamy #gaymarriage #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of liberal views on social issues such as polygamy, gay marriage, and SemST. They may also perceive it as being against the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that liberal views on social issues can have negative consequences, and that the legalization of abortion should not be supported. They may also interpret the tweet as being critical of liberal views on social issues.",
    "action": "@web_rant Abortion should be a decision made between a woman and her doctor, not the government. #MyBodyMyChoice #ReproductiveRights"
  },
  {
    "ID": 1256,
    "Target": "Legalization of Abortion",
    "Tweet": "@ghhshirley Charged with Manslaughter After Another Woman Dies From #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it implies that a woman has died due to a procedure related to abortion.",
    "cognition": "The person's cognition after perceiving the information would be that this is a tragic event, and that it highlights the need for safe and legal access to abortion services. They may also be concerned that this incident could be used to further restrict access to abortion services.",
    "action": "This is a heartbreaking tragedy. We must ensure that women have access to safe and legal abortion services. #ReproRights #AbortionRights"
  },
  {
    "ID": 1104,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @rob_mcarthur: @JustinTrudeau try joining the millions of slaughtered unborn CHILDREN robbed of their right to choose. #cdnpoli #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that the unborn children are being denied their right to choose.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion should not be legalized, as it is taking away the right of unborn children to choose. They may also feel that the tweet is implying that abortion is wrong and should not be allowed.",
    "action": "@rob_mcarthur We should not deny anyone the right to choose, including unborn children. #prochoice #SemST"
  },
  {
    "ID": 1141,
    "Target": "Legalization of Abortion",
    "Tweet": "#SupremeCourt  is on a roll this week, did they just discover #coffee or something?? #MarriageEquaility #SemST",
    "perception": "The person's perception of this tweet might be that it is positive and celebratory, as it mentions the Supreme Court and two progressive topics, Marriage Equality and SemST.",
    "cognition": "The person's cognition of this tweet might be that the Supreme Court is making positive progress on progressive topics, and that the tweet is expressing joy and celebration for the progress being made.",
    "action": "Great to see the #SupremeCourt making progress on #MarriageEquaility and #SemST! #Progress"
  },
  {
    "ID": 998,
    "Target": "Legalization of Abortion",
    "Tweet": "It's great that same-sex marriage has been made legal, but how long will it take to make abortion illegal? #SemST",
    "perception": "The person's perception of this tweet would be one of disappointment that abortion has not yet been legalized, as well as frustration that progress is not being made quickly enough.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet implies that same-sex marriage has been made legal, but that abortion is still not legal. They may also interpret the hashtag as a call to action to make abortion legal.",
    "action": "It's time to make abortion legal! #AbortionRights"
  },
  {
    "ID": 687,
    "Target": "Legalization of Abortion",
    "Tweet": "Patient advocate Stephen Casey of Texas Center for Defense of Life strongly supports #HB3074. #TXlege #SemST",
    "perception": "The person's perception of this tweet would be that Stephen Casey is a strong advocate for the anti-abortion movement and is in favor of the proposed bill, HB3074. They may also perceive that the bill has strong support from the Texas legislature.",
    "cognition": "The person's cognition after perceiving the information would be that the proposed bill, HB3074, is likely to pass and that it will likely have a negative impact on the legalization of abortion. They may also come to the conclusion that the anti-abortion movement is gaining momentum in Texas.",
    "action": "We must fight against #HB3074 and the anti-abortion movement in Texas. #StandForChoice #TXlege #SemST"
  },
  {
    "ID": 700,
    "Target": "Legalization of Abortion",
    "Tweet": "Anti-vaxxers are such an idiotic bunch... Seriously, guys. Vaccinate. Your. Kids. #stopsb277 #conformcomics #marvel #dc #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of those who oppose vaccinations, and that it is advocating for vaccinations.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for vaccinations, and that it is critical of those who oppose them. They may also interpret the hashtag to mean that the tweet is in support of a specific bill, SB277, which would require vaccinations for children.",
    "action": "Agreed! Vaccinations are essential for protecting our children and our communities. #stopsb277 #conformcomics #marvel #dc #SemST"
  },
  {
    "ID": 812,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @alvedaking: The most disturbing thing we to this planet is to flood our streets with the #blood of #children from #HappyEarth... #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that the legalization of abortion is causing harm to the planet. They may also feel a sense of sadness at the thought of innocent children being hurt.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the legalization of abortion is causing harm to the planet and innocent children. They may also feel a sense of guilt for supporting something that is causing such harm.",
    "action": "I'm deeply saddened by this tweet and the implications it has. We must find a way to protect the lives of innocent children while still allowing for the legalization of abortion."
  },
  {
    "ID": 1119,
    "Target": "Legalization of Abortion",
    "Tweet": "@LadySandersfarm love is only love if it's on her terms. Keep your faith in Jesus, He is your Anchor in this storm. Hebrews 6:19  #SemST",
    "perception": "The person's perception of this tweet might be that it is a message of support for the legalization of abortion, as it emphasizes the importance of making decisions on one's own terms. Additionally, the person might interpret the hashtag as a sign of solidarity with the pro-choice movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the right to make decisions about one's own body, and that the hashtag is a sign of support for the pro-choice movement.",
    "action": "@LadySandersfarm We stand with you in support of the right to make decisions about one's own body. #ProChoice #SemST"
  },
  {
    "ID": 683,
    "Target": "Legalization of Abortion",
    "Tweet": "Dear Nuns, your advocacy of tax paying is weird. #war #Iraq #deathpenalty #taxespayforthistoo #TaxpayerPride #SemST",
    "perception": "The person's perception of the tweet might be that it is critical of nuns advocating for taxation, and that it is making a statement about the death penalty and taxes.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that taxes are used to fund activities such as war and the death penalty, and that the nuns' advocacy of taxation is misguided. They might also infer that the hashtag #TaxpayerPride is meant to express pride in paying taxes, despite the fact that taxes are used to fund activities that the person may not agree with.",
    "action": "Taxes should be used to fund activities that benefit society, not ones that harm it. #NoDeathPenalty #NoWar #TaxesForGood #SemST"
  },
  {
    "ID": 830,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @RogerIsCatholic: Save the Baby Humans! #WAAR #SemST",
    "perception": "The person's perception of this tweet would likely be one of disagreement and disapproval, as it is advocating against the legalization of abortion. They may also feel frustrated or angry at the message being presented.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is advocating against the legalization of abortion, and that the person who posted it is likely against the legalization of abortion as well.",
    "action": "Abortion should be a decision made between a woman and her doctor, not the government. #MyBodyMyChoice #ProChoice"
  },
  {
    "ID": 763,
    "Target": "Legalization of Abortion",
    "Tweet": "@beckaviau @MikeRedmondNDP duh.... Planned pregnancy around election date, new fad. Get with the times. #SemST",
    "perception": "The person's perception of this tweet might be that it is mocking those who support Planned Parenthood and is suggesting that it is a new trend to have a pregnancy around election dates. They may also perceive the tweet as being sarcastic and dismissive of the issue.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that Planned Parenthood is a political ploy and that it is not a serious issue. They may also interpret the tweet as being dismissive of the importance of the issue of abortion and the need for access to safe and legal abortions.",
    "action": "@beckaviau @MikeRedmondNDP Access to safe and legal abortions is a fundamental right and should not be treated as a political ploy. #SemST"
  }
]