[
  {
    "ID": 961,
    "Target": "Legalization of Abortion",
    "Tweet": "Good Friday morning #patriots. Make it ur best one ever. #Smile all day long. #LNYHBT #RescuePets #SOT #SOV #NeverGiveUp #SemST",
    "perception": "The person's perception of this tweet might be that it is a positive and uplifting message, encouraging people to make the most of their day and never give up. They may also recognize the hashtags as being related to various causes, such as animal rescue and support for veterans.",
    "cognition": "The person's cognition of this tweet might be that it is a message of hope and positivity, encouraging people to stay strong and never give up, while also showing support for various causes. They may also recognize the hashtags as being related to important issues, such as animal rescue and support for veterans.",
    "action": "Thanks for the uplifting message! #NeverGiveUp #SemST #RescuePets #SOT #SOV"
  },
  {
    "ID": 909,
    "Target": "Legalization of Abortion",
    "Tweet": "Had a great meeting today with two guys who I know are reading this tweet... Welcome to the team! Excited to expand Team Sobhy!!  #SemST",
    "perception": "The person's perception of this tweet would be one of positivity and enthusiasm, as it appears to be celebrating the addition of new members to the team. They may also feel a sense of pride in the team's growth and success.",
    "cognition": "The person's cognition after perceiving the information would be that the team is growing and succeeding, and that the team is welcoming new members. They may also feel a sense of pride in the team's accomplishments and be excited to see what the future holds.",
    "action": "Congratulations to Team Sobhy on the new additions! Excited to see what the future holds for you all! #SemST"
  },
  {
    "ID": 688,
    "Target": "Legalization of Abortion",
    "Tweet": "Are the same people who are red faced and frothing over abortion also against the death penalty? Just wondering... #deathpenalty #SemST",
    "perception": "The person's perception of this tweet might be that the author is questioning the inconsistency of those who oppose abortion but support the death penalty. They may also perceive the tweet as being critical of those who oppose abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the author is implying that those who oppose abortion should also oppose the death penalty, as both are forms of taking a life. They may also interpret the tweet as a criticism of those who oppose abortion but support the death penalty, as it appears to be a contradiction.",
    "action": "It's important to be consistent in our beliefs and values. #abortion #deathpenalty #SemST"
  },
  {
    "ID": 906,
    "Target": "Legalization of Abortion",
    "Tweet": "Thr r no rights w/o responsibilities. The rt 2 bodily autonomy comes w/ the responsibility 2 care 4 1's unborn child #ProLifeYouth #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the Pro-Life movement and is against the legalization of abortion. They may also perceive the sentiment of the tweet to be one of responsibility and care for an unborn child.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the Pro-Life movement and is against the legalization of abortion. They may also interpret the tweet to mean that those who support the right to bodily autonomy must also take responsibility for the care of their unborn child.",
    "action": "Abortion should be a safe and legal option for those who need it. We must ensure access to reproductive healthcare and support those who choose to have an abortion #ProChoice #SemST"
  },
  {
    "ID": 1123,
    "Target": "Legalization of Abortion",
    "Tweet": "Hadn't seen October Baby until the other night. Had me crying thru the whole thing...I don't cry at movies. So touching! #adoption #SemST",
    "perception": "The person's perception of this tweet would be that it is a positive sentiment towards adoption, and that the movie October Baby was very touching.",
    "cognition": "The person's cognition after perceiving the information would be that adoption is a viable alternative to abortion, and that the movie October Baby is a powerful story that highlights the importance of adoption.",
    "action": "Adoption is a beautiful and powerful alternative to abortion. #adoption #SemST"
  },
  {
    "ID": 701,
    "Target": "Legalization of Abortion",
    "Tweet": "They may need to figure out how to get out of school or work that day. #SemST",
    "perception": "The person's perception of the tweet may be that it is a call to action to support the legalization of abortion, as the hashtag implies. They may also perceive the tweet as a reminder to those who support the cause to take action and make their voices heard.",
    "cognition": "The person's cognition after perceiving the information may be that the tweet is encouraging people to take action in support of the legalization of abortion, and that it is important to make their voices heard in order to make a difference. They may also recognize that the hashtag is a call to action to show solidarity with those who are affected by the issue.",
    "action": "We must stand together and fight for the right to choose. #SemST #AbortionRights"
  },
  {
    "ID": 982,
    "Target": "Legalization of Abortion",
    "Tweet": "@WhiteHouse  @POTUS All children except the millions that have been aborted #everylifematters #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval and disagreement, as it implies that abortion should not be legalized. They may also feel that the tweet is insensitive to those who have had abortions.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion should not be legalized, and that all lives should be valued, including those of aborted children. They may also feel that the tweet is insensitive to those who have had abortions.",
    "action": "@WhiteHouse @POTUS Abortion should be a decision made by the individual, not the government. #MyBodyMyChoice #ReproductiveRights"
  },
  {
    "ID": 692,
    "Target": "Legalization of Abortion",
    "Tweet": "If my body is the only way you can live and I don't want that I have the right to dismiss you. I don't know why that's a problem #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support for the legalization of abortion, as it emphasizes the right of the individual to make decisions about their own body. They may also perceive the sentiment of the tweet to be one of frustration with the current state of the debate.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the right to choose in regards to abortion, and that the current debate is not adequately recognizing the rights of individuals.",
    "action": "I stand with you! Everyone should have the right to make decisions about their own body #SemST"
  },
  {
    "ID": 722,
    "Target": "Legalization of Abortion",
    "Tweet": "Thank you for another day of life Lord. #Christian #Catholic #TeamJesus #SemST",
    "perception": "The person's perception of this tweet might be that it is expressing a strong religious sentiment in favor of life, and is likely against the legalization of abortion.",
    "cognition": "The person's cognition of this tweet might be that it is expressing a strong religious belief in the sanctity of life, and is likely against the legalization of abortion. They may also infer that the person who posted the tweet is likely a Christian or Catholic, and is part of a larger community of people who share similar beliefs.",
    "action": "I respect your beliefs, but I believe that everyone should have the right to make their own decisions about their bodies. #ProChoice #AbortionRights"
  },
  {
    "ID": 707,
    "Target": "Legalization of Abortion",
    "Tweet": "The Democrats just gave the most chilling reply when asked if they support aborting 7-pound babies #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as they are likely to be appalled by the suggestion that Democrats would support aborting 7-pound babies.",
    "cognition": "The person's cognition after perceiving the information would be to question the accuracy of the tweet and to consider the implications of the Democrats' stance on abortion. They may also be concerned about the potential consequences of such a policy.",
    "action": "This is an outrageous suggestion and I'm appalled that anyone would support aborting 7-pound babies. #NoAbortion #SemST"
  },
  {
    "ID": 840,
    "Target": "Legalization of Abortion",
    "Tweet": "@Hannah_Warren14 that much more oppressive for women #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for women's rights and is critical of oppressive policies. They may also interpret the hashtag as a call to action to support women's rights and social justice.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for women's rights and is critical of oppressive policies that limit women's access to abortion. They may also interpret the hashtag as a call to action to support women's rights and social justice, which could include the legalization of abortion.",
    "action": "@Hannah_Warren14 I stand with you in support of women's rights and the legalization of abortion #SemST"
  },
  {
    "ID": 852,
    "Target": "Legalization of Abortion",
    "Tweet": "@CrushTheCFR Yes, heard you the first 500 times you tweeted SIX kids. she is probably also #SemST",
    "perception": "The person's perception of this tweet might be that the author is in favor of abortion and is emphasizing the importance of reproductive rights. They might also perceive the author as being frustrated with the repetition of the message that six children are affected by abortion laws.",
    "cognition": "The person's cognition after perceiving the information might be that the author is advocating for the legalization of abortion and is emphasizing the importance of reproductive rights. They might also interpret the tweet as a call to action to support the cause and to spread awareness of the issue.",
    "action": "@CrushTheCFR I'm with you! Reproductive rights are essential and we must continue to fight for them #SemST"
  },
  {
    "ID": 1225,
    "Target": "Legalization of Abortion",
    "Tweet": "There is something very sinister, NAZI-esque, about folks who support killing babies. #qanda #auspol #SemST",
    "perception": "The person's perception of the tweet would be one of shock and disbelief, as it implies that those who support abortion are akin to Nazis. They may also feel offended and frustrated by the tweet's negative connotations.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on their beliefs and values, and to recognize that the tweet is attempting to discredit their stance on abortion. They may also feel angry and defensive in response to the tweet.",
    "action": "It's wrong to equate those who support abortion with Nazis. We should be having a respectful dialogue about this important issue, not making baseless accusations. #qanda #auspol #SemST"
  },
  {
    "ID": 1167,
    "Target": "Legalization of Abortion",
    "Tweet": ". . . abortion is not self-defense, shooting the rapist is Kittington #PJNET #TCOT #SemST",
    "perception": "The person's perception of the tweet might be that it is against the legalization of abortion, as it implies that shooting the rapist is a better option than abortion. They may also perceive the tweet as being insensitive and offensive.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for violence as a solution to the issue of abortion, and that it is insensitive and offensive to those who support the legalization of abortion.",
    "action": "Abortion is a personal decision and should be respected. #ProChoice #AbortionRights #MyBodyMyChoice"
  },
  {
    "ID": 709,
    "Target": "Legalization of Abortion",
    "Tweet": "Tip for protesters everywhere: your goal is to change the minds of rational adults, not to scar the minds of little kids. #PGH #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for peaceful protesting and discouraging the use of tactics that could be damaging to children. They may also view it as a reminder to be mindful of the impact of protests on vulnerable populations.",
    "cognition": "The person's cognition after perceiving the information would be that peaceful protesting is the most effective way to make a change, and that it is important to be mindful of the impact of protests on vulnerable populations, such as children.",
    "action": "Agreed! We must always strive to make our voices heard without causing harm to those around us. #LegalizeAbortion #SemST"
  },
  {
    "ID": 1186,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @Paul71: Who's yer man in the #dail talking about bullying? The only bullying was Fine Gael bullying their own members! #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of Fine Gael and their members, and that it is likely in support of the issue of bullying.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing Fine Gael for bullying their own members, and that the speaker is likely advocating for action to be taken against bullying.",
    "action": "Agreed! Bullying of any kind should not be tolerated. #SemST #AbortionRights"
  },
  {
    "ID": 1249,
    "Target": "Legalization of Abortion",
    "Tweet": "You were alive for up to 9 months before you were bornKills #SemST",
    "perception": "The person's initial perception of the tweet would be one of shock and disapproval, as it implies that abortion is equivalent to killing a living being. They may also feel a sense of anger towards the tweet's author for their insensitive language.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on the pro-choice movement and an attempt to equate abortion with murder. They may also recognize the tweet as an attempt to shame those who support the legalization of abortion.",
    "action": "Abortion is a complex issue and should be treated with respect. #ProChoice"
  },
  {
    "ID": 1065,
    "Target": "Legalization of Abortion",
    "Tweet": "Ever notice how ppl like Cruz  who say they love the Constitution  are always the ones who want to change it? #ACA #GayMarriage #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of those who oppose progressive social issues such as the Affordable Care Act, gay marriage, and the Sexuality Education Standards. They may also perceive it as a call to support these issues and to stand up for the Constitution.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that those who oppose progressive social issues are not true supporters of the Constitution, and that they should be held accountable for their actions. They may also interpret the tweet as a call to action to support these issues and to protect the Constitution.",
    "action": "We must stand up for our Constitution and support progressive social issues like #ACA #GayMarriage #SemST. We must hold those who oppose these issues accountable for their actions!"
  },
  {
    "ID": 888,
    "Target": "Legalization of Abortion",
    "Tweet": "#ProLifeYouth know that human life = human life, inside the womb or out. #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the pro-life movement and is against the legalization of abortion. They may also perceive the sentiment of the tweet to be strongly against abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the pro-life movement and is against the legalization of abortion. They may also interpret the tweet to mean that all human life is equal, regardless of whether it is inside or outside the womb.",
    "action": "Abortion should be a decision made between a woman and her doctor, not the government. #MyBodyMyChoice #ReproRights"
  },
  {
    "ID": 1064,
    "Target": "Legalization of Abortion",
    "Tweet": "I'm so glad this is Not My Home! #NMH #SCOTUSMarriage #ACA #SemST",
    "perception": "The person's perception of the tweet would be one of approval and support, as it mentions topics such as the Affordable Care Act, same-sex marriage, and Not My Home, which could be interpreted as a stance against restrictive abortion laws.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing support for progressive causes such as same-sex marriage and the Affordable Care Act, and is likely also expressing opposition to restrictive abortion laws. This could be interpreted as a sign of approval for the legalization of abortion.",
    "action": "Agreed! #LegalizeAbortion #NMH #SCOTUSMarriage #ACA #SemST"
  },
  {
    "ID": 779,
    "Target": "Legalization of Abortion",
    "Tweet": "What is the difference between a baby and a onion? No one cries when you chop up the baby.   Hahahahaha! Love dead babies! #Babies #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disgust, as it is making light of a serious issue and is insensitive to those who have experienced abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a joke out of a serious issue and is insensitive to those who have experienced abortion. They would also likely feel that the tweet is inappropriate and offensive.",
    "action": "This tweet is inappropriate and offensive. Making light of a serious issue is insensitive to those who have experienced abortion. #Respect #AbortionRights"
  },
  {
    "ID": 1057,
    "Target": "Legalization of Abortion",
    "Tweet": "We're at a moment where we need the kind of intergenerational dialogue that RBG brings @irin  @AspenInstitute Spotlight:Health #SemST",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as it mentions the intergenerational dialogue that Ruth Bader Ginsburg brings, which could be interpreted as a reference to the progress made in the fight for abortion rights. Additionally, the hashtag #SemST could be interpreted as a reference to the fight for reproductive justice.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion, and that the hashtag #SemST is a reference to the fight for reproductive justice.",
    "action": "Thank you @irin and @AspenInstitute for highlighting the importance of reproductive justice and the progress made in the fight for abortion rights! #SemST #ReproductiveJustice"
  },
  {
    "ID": 1111,
    "Target": "Legalization of Abortion",
    "Tweet": "@PnkGlitterChemE @SayNoToSuicide4 Being #Gay is a #Choice Just like #SemST",
    "perception": "The person's perception of this tweet might be that it is supportive of the LGBTQ+ community and that it is advocating for the right to choose.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the right to choose, regardless of sexual orientation, and that it is suggesting that being gay is a choice, just like the choice to have an abortion.",
    "action": "Agreed! Everyone should have the right to choose what is best for them, regardless of sexual orientation. #RightToChoose #LegalizeAbortion"
  },
  {
    "ID": 1134,
    "Target": "Legalization of Abortion",
    "Tweet": "Bernadette Smyth is an ignorant thunder cunt.  Not her life. Not her body. Not her business.  #ItsABallOfCellsNotABaby  #NewsNI #SemST",
    "perception": "The person's perception of the tweet might be that it is a strong statement in support of the legalization of abortion, with a negative sentiment towards those who oppose it.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is criticizing those who oppose the legalization of abortion, and that it is advocating for the right to choose.",
    "action": "I stand with Bernadette Smyth and support the right to choose! #ItsABallOfCellsNotABaby #NewsNI #SemST"
  },
  {
    "ID": 1198,
    "Target": "Legalization of Abortion",
    "Tweet": ".@RebeccahLouise I'm not forcing anyone to do anything. Abortion is not 'medical help' & there are better options. Very proud to be #SemST",
    "perception": "The person's perception of this tweet might be that the author is against the legalization of abortion and is proud to be part of the #SemST movement. They might also perceive the author as being against the idea of abortion being considered a form of medical help.",
    "cognition": "The person's cognition after perceiving the information might be that the author is against the idea of abortion being a form of medical help and is advocating for other options. They might also interpret the tweet as a statement of support for the #SemST movement, which is likely against the legalization of abortion.",
    "action": "@RebeccahLouise I understand your stance on abortion and respect your opinion. However, I still believe that it should be a legal option for those who need it."
  }
]