[
  {
    "ID": 931,
    "Target": "Legalization of Abortion",
    "Tweet": "@k8write95: 1/3 of my generation is missing. And it can't be changed. But we can change the future.   #ProLifeYouth #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the Pro-Life movement and is against the legalization of abortion. They may also perceive the tweet as being emotionally charged and passionate about the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the Pro-Life movement and is against the legalization of abortion. They may also interpret the tweet as being a call to action to protect the unborn and to prevent future generations from suffering the same fate.",
    "action": "We must protect the right to choose and ensure access to safe and legal abortion. #ProChoice #SemST"
  },
  {
    "ID": 729,
    "Target": "Legalization of Abortion",
    "Tweet": "like i really need to walk past a bunch of aborted babies to get into the union. get out of my peripheral #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disgust, as it implies that abortion is a gruesome and inhumane act. They may also feel a sense of anger towards the person who posted the tweet for their insensitive language.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is a terrible and immoral act, and that the person who posted the tweet is against abortion. They may also feel that the tweet is insensitive and offensive.",
    "action": "Abortion is a legal and safe medical procedure. It's wrong to shame and stigmatize those who choose to have one. #MyBodyMyChoice"
  },
  {
    "ID": 953,
    "Target": "Legalization of Abortion",
    "Tweet": "Life Fact: At just 9 weeks into a pregnancy, a baby begins to sigh and yawn. #LifeFact #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and disagreement, as it implies that abortion should not be legalized. They may also feel frustrated that the tweet is attempting to sway public opinion against abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to use an emotional appeal to convince people that abortion should not be legalized. They may also interpret the tweet as an attempt to guilt people into believing that abortion is wrong.",
    "action": "Abortion should be a decision made between a woman and her doctor, not dictated by outdated beliefs. #MyChoice #SemST"
  },
  {
    "ID": 753,
    "Target": "Legalization of Abortion",
    "Tweet": "The people who never spoke up against the Nazis during World War II were likely \"live and let live \" people. #fb #SemST",
    "perception": "The person's perception of this tweet might be that it is criticizing those who do not take a stance on important issues, such as the legalization of abortion. They may also perceive it as a call to action to take a stance on important issues.",
    "cognition": "The person's cognition after perceiving the information might be that it is important to take a stance on important issues, such as the legalization of abortion, and that it is wrong to remain silent on such issues. They may also interpret the tweet as a reminder to speak up and take action on issues that matter.",
    "action": "We must take a stance on important issues like the legalization of abortion. Silence is not an option. #fb #SemST"
  },
  {
    "ID": 980,
    "Target": "Legalization of Abortion",
    "Tweet": "@_hannahwilhoit @paigem32 I'm done with the convo. But before I go. #SemST",
    "perception": "The person's perception of this tweet might be that the conversation is over and that the hashtag #SemST is related to the topic of abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the hashtag #SemST is related to the topic of abortion and that the conversation is over. They may also infer that the tweet is in support of the legalization of abortion.",
    "action": "@_hannahwilhoit @paigem32 I'm in full support of the #SemST movement. Let's keep the conversation going!"
  },
  {
    "ID": 1120,
    "Target": "Legalization of Abortion",
    "Tweet": "@SenTedCruz Great job on @TODAYshow. #Scotus should have been eliminated 41 years ago when they called for the murder of children. #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that the Supreme Court has been responsible for the murder of children.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court has been complicit in the murder of children by allowing abortion to be legal. They would also likely be angry that Senator Ted Cruz is supporting the Supreme Court's decision to legalize abortion.",
    "action": "@SenTedCruz How can you support the Supreme Court's decision to legalize abortion when it has resulted in the murder of children? #SemST"
  },
  {
    "ID": 678,
    "Target": "Legalization of Abortion",
    "Tweet": "Govt cannot force you to get chemo but if you're a fetus, you must live! #JulieBorowski #reproductiverights #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval of the government's stance on reproductive rights, and a sentiment of support for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the government is unfairly restricting reproductive rights by forcing fetuses to live, while not forcing people to get chemo. They would also likely interpret the tweet as a call to action to support the legalization of abortion.",
    "action": "We must fight for reproductive rights and the right to choose! #LegalizeAbortion #ReproductiveRights #SemST"
  },
  {
    "ID": 1022,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @rxchelredekop: Consenting to sex is not consenting to being pregnant!!! Like!!! No!!!! #SemST",
    "perception": "The person's perception of this tweet would be one of agreement and support for the idea that consenting to sex does not mean consenting to being pregnant. They may also feel strongly about the issue, as indicated by the use of multiple exclamation points.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to choose whether or not to become pregnant, and that this right should be respected. They may also feel that this is an important issue that needs to be addressed, as indicated by the hashtag #SemST.",
    "action": "Agreed! Everyone should have the right to choose whether or not to become pregnant. #SemST"
  },
  {
    "ID": 1041,
    "Target": "Legalization of Abortion",
    "Tweet": "I'm gonna fuck @CaitlynGuyerXOX Next weekend  #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disgust. They would likely view the tweet as inappropriate and offensive.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is inappropriate and disrespectful. They would likely interpret the tweet as an example of objectifying and degrading women.",
    "action": "This tweet is unacceptable and disrespectful. We should be advocating for the respect and dignity of all people, not objectifying and degrading women. #RespectWomen #SemST"
  },
  {
    "ID": 843,
    "Target": "Legalization of Abortion",
    "Tweet": "I will believe the narrative that \"black lives matter\" when ALL black lives matter, all the time. #BlackOnBlackViolence #SemST",
    "perception": "The person's perception of the tweet might be that it is a call for the recognition of the importance of all black lives, and a condemnation of violence within the black community.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the recognition of the value of all black lives, and that violence within the black community should be addressed. Additionally, the person might interpret the hashtag as a call for solidarity and support for the Black Lives Matter movement.",
    "action": "Agreed! We must recognize the value of all black lives and work to end #BlackOnBlackViolence. #SemST #AbortionRights"
  },
  {
    "ID": 723,
    "Target": "Legalization of Abortion",
    "Tweet": "@AdamMyerson @quarq - Sent mine two days ago.  Expect it back in two days. Quick turnaround and great customer service! #SemST",
    "perception": "The person's perception of this tweet would be that the customer service provided by Quarq was quick and efficient, and that the customer was satisfied with the service. They may also feel positive about the company for providing such good service.",
    "cognition": "The person's cognition after perceiving the information would be that Quarq is a reliable company that provides good customer service, and that their turnaround time is quick and efficient. They may also feel that the customer was satisfied with the service they received.",
    "action": "@AdamMyerson @quarq Great to hear that you had a positive experience with their customer service! #SemST"
  },
  {
    "ID": 796,
    "Target": "Legalization of Abortion",
    "Tweet": "Dude i won a #freeshirt from @abort73 ! I never win anything lol #Abort73 #SemST",
    "perception": "The person's perception of this tweet would be one of excitement and joy, as it appears to be celebrating the winning of a free shirt from a pro-abortion organization. They may also be pleased to see the hashtag #Abort73, which could indicate support for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is celebrating the winning of a free shirt from a pro-abortion organization, and that the hashtag #Abort73 indicates support for the legalization of abortion. They may also be pleased to see that the organization is actively engaging with its supporters and giving away free items.",
    "action": "Congrats on winning the free shirt from @abort73! It's great to see organizations supporting the legalization of abortion. #Abort73 #SemST"
  },
  {
    "ID": 1236,
    "Target": "Legalization of Abortion",
    "Tweet": "If #BlackLivesMatter why not black babies in the womb? Somehow their lives don't matter.... puzzled with that one. #catholic #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and disagreement, as it implies that the lives of unborn black babies do not matter. They may also feel frustrated that the tweet is attempting to link the Black Lives Matter movement to the issue of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to link the Black Lives Matter movement to the issue of abortion, and that the tweet implies that the lives of unborn black babies do not matter. They may also feel that this is an unfair and inaccurate comparison.",
    "action": "Black Lives Matter is about fighting systemic racism and injustice, not about abortion. All lives, born and unborn, matter and should be respected.\" #BlackLivesMatter #ProChoice"
  },
  {
    "ID": 1170,
    "Target": "Legalization of Abortion",
    "Tweet": "@MarthaPlimpton It's not Monday on Twitter until some right wing troll sends me a video of an abortion #ReproRights #SemST",
    "perception": "The person's perception of this tweet would be one of support for the Reproductive Rights movement and a disdain for the right-wing troll who sent the video of an abortion. They would likely also feel a sense of solidarity with Martha Plimpton for standing up to the troll.",
    "cognition": "The person's cognition after perceiving the information would be that the Reproductive Rights movement is important and should be supported, and that right-wing trolls should not be allowed to spread misinformation about abortion. They would also likely feel a sense of solidarity with Martha Plimpton for standing up to the troll.",
    "action": "@MarthaPlimpton We stand with you in support of #ReproRights and against the right-wing trolls who spread misinformation about abortion. #SemST"
  },
  {
    "ID": 1150,
    "Target": "Legalization of Abortion",
    "Tweet": "Happy to hear the #SCOTUS blocked closing of 10 abortion clinics in TX until an appeal can be heard #safelegalrare #thinkprogress #SemST",
    "perception": "The person's perception of this tweet would be one of relief and approval, as it is advocating for the legalisation of abortion and the Supreme Court's decision to block the closing of 10 abortion clinics in Texas.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court's decision is a step in the right direction towards protecting the right to access safe and legal abortions. They would also likely be encouraged by the hashtag #safelegalrare, which suggests that the goal is to make abortions rare, but still accessible when needed.",
    "action": "Thank you #SCOTUS for protecting the right to access safe and legal abortions! #safelegalrare #thinkprogress #SemST"
  },
  {
    "ID": 1066,
    "Target": "Legalization of Abortion",
    "Tweet": "Great college training in Stevens Point today!gen #WRTLCollege #SemST",
    "perception": "The person's perception of the tweet would be one of positivity and enthusiasm, as it is promoting college training in Stevens Point. They may also be encouraged by the hashtag #WRTLCollege, which suggests a pro-life organization.",
    "cognition": "The person's cognition of the tweet would be that the pro-life organization is promoting college training in Stevens Point, which could be seen as a positive step towards educating people on the issue of abortion. They may also interpret the hashtag #SemST as a sign of support for the legalization of abortion.",
    "action": "Great to see @WRTLCollege supporting college training in Stevens Point! #SemST #LegalizeAbortion"
  },
  {
    "ID": 937,
    "Target": "Legalization of Abortion",
    "Tweet": "#Abstinence proponent #BristolPalin, pregnant with second child, conceives of #humility.  #MirthControl #BirthControl #SemST",
    "perception": "The person's perception of this tweet might be that Bristol Palin is advocating for abstinence, but has become pregnant with her second child, which could be seen as hypocritical. They may also find the hashtag combination humorous.",
    "cognition": "The person's cognition after perceiving the information might be that Bristol Palin is not practicing what she preaches, and that her situation is ironic. They may also think that her situation is a reminder of the importance of birth control and sexual education.",
    "action": "It's important to practice what you preach and to be aware of the importance of birth control and sexual education. #AbortionRights #BirthControl #SemST"
  },
  {
    "ID": 871,
    "Target": "Legalization of Abortion",
    "Tweet": "It's not #yourbody, so it's not your #choice.youthgen #SemST",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that it is not the individual's choice to make. They may also perceive it as a call to action for young people to take a stance against abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the restriction of abortion rights, and that it is encouraging young people to take a stance against abortion.",
    "action": "Abortion should be a decision made by the individual, not the government. #MyBodyMyChoice #ReproRights #SemST"
  },
  {
    "ID": 917,
    "Target": "Legalization of Abortion",
    "Tweet": "The world is waking up to the fact that killing babies is wrong. No matter what. #ProLifeYouth #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval and disagreement, as it implies that abortion is wrong and should not be legalized. They may also feel frustrated that the tweet is promoting a pro-life stance.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting an anti-abortion stance and that it is implying that abortion should not be legalized. They may also feel that the tweet is trying to influence people to adopt a pro-life stance.",
    "action": "Abortion should be a decision made between a woman and her doctor, not dictated by the government. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 1253,
    "Target": "Legalization of Abortion",
    "Tweet": "@toby_dorena Any pregnancy can turn deadly at any time, without warning. I can't force that on someone. #SemST",
    "perception": "The person's perception of this tweet would be that it is in support of the legalization of abortion, as it implies that no one should be forced to go through a potentially dangerous pregnancy. They may also perceive the sentiment of the tweet to be one of compassion and understanding.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to choose whether or not to go through with a pregnancy, and that it is important to respect the autonomy of individuals in this decision. They may also interpret the tweet as a call to support the legalization of abortion.",
    "action": "@toby_dorena I fully support your stance on the right to choose. #SemST"
  },
  {
    "ID": 946,
    "Target": "Legalization of Abortion",
    "Tweet": "@saadoescatholic: #Americans have the right to #life #liberty and the #pursuitofhappiness, so why dont #unborn Americans?   #SemST",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that unborn Americans should have the same rights as those who are born. They may also perceive it as a call to action to protect the rights of unborn Americans.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the rights of unborn Americans and is against the legalization of abortion. They may also interpret the tweet as a call to action to protect the rights of unborn Americans.",
    "action": "We must protect the rights of unborn Americans and ensure that they have the same rights as those who are born. #ProtectUnbornRights #LegalizeAbortion"
  },
  {
    "ID": 862,
    "Target": "Legalization of Abortion",
    "Tweet": "Bodily autonomy is a human right. A person's access to abortion is a human right. #reprojustice #reprorights #SemST",
    "perception": "The person's perception of the tweet would be one of support for the legalization of abortion, as it emphasizes the importance of bodily autonomy and access to abortion as human rights. They would likely also view the hashtags as a sign of solidarity with the reproductive justice movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to access abortion and for reproductive justice. They would likely interpret the tweet as a call to action to support the legalization of abortion and to fight for reproductive rights.",
    "action": "I stand with #reprojustice and #reprorights! Everyone should have the right to make decisions about their own body. #AbortionRights"
  },
  {
    "ID": 1059,
    "Target": "Legalization of Abortion",
    "Tweet": "@KC_Football_Guy I am all for focusing on things that matter. #ISIS #Racism #Immigration #ChiefsKingdom #SemST",
    "perception": "The person's perception of this tweet would be that the author is in favor of focusing on important issues such as ISIS, racism, immigration, and the Chiefs Kingdom. They may also perceive the author as being supportive of the SemST movement.",
    "cognition": "The person's cognition after perceiving the information would be that the author is advocating for social justice and is in favor of addressing important issues that are affecting society. They may also interpret the tweet as a call to action to take action on these issues.",
    "action": "@KC_Football_Guy I fully support your stance on these important issues. Let's work together to make a difference! #SemST #SocialJustice"
  },
  {
    "ID": 778,
    "Target": "Legalization of Abortion",
    "Tweet": ".@giannaberettamo @GiaMolla @sphcs_news Happy feast of St. Gianna Beretta Molla! May she pray for us! #SemST",
    "perception": "The person's perception of this tweet would be one of admiration and respect for St. Gianna Beretta Molla, as well as a sense of appreciation for her prayers.",
    "cognition": "The person's cognition after perceiving the information would be that St. Gianna Beretta Molla is a respected figure in the Catholic Church, and that her prayers are valued and appreciated.",
    "action": "Thank you for honoring St. Gianna Beretta Molla and her prayers. #SemST"
  },
  {
    "ID": 680,
    "Target": "Legalization of Abortion",
    "Tweet": "As long as they are allowed to show medically correct photos of contraception use at the family planning table #StopAbortion #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval towards abortion, as the hashtag #StopAbortion implies. They may also perceive a sentiment of opposition to the use of contraception, as the hashtag #SemST implies.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the prevention of abortion through the use of contraception, and that the use of contraception should be promoted at family planning tables.",
    "action": "We should be promoting access to safe and legal abortion, not trying to stop it. #SupportAbortion #ReproRights"
  }
]