[
  {
    "ID": 212,
    "Target": "Feminist Movement",
    "Tweet": "Eating a bagel by myself rocking out to \"Man! I Feel Like a Woman!\" #ponytail #freedom #SemST",
    "perception": "The person's perception of the tweet would be one of joy and empowerment, as the tweet celebrates the freedom of being a woman and the power of self-expression. They would likely appreciate the reference to the popular feminist anthem, and the hashtag use of #freedom and #SemST, which are associated with the feminist movement.",
    "cognition": "The person's cognition of the tweet would be that it is a celebration of female empowerment and freedom, and that the person is expressing their own individual identity and self-expression. They would likely appreciate the reference to the popular feminist anthem, and the hashtag use of #freedom and #SemST, which are associated with the feminist movement.",
    "action": "Love this! Celebrating female empowerment and freedom is so important. #FeministMovement #Empowerment #Freedom"
  },
  {
    "ID": 472,
    "Target": "Feminist Movement",
    "Tweet": "What the fuck do women even do? I mean seriously they're just useless other than sex.  #womensrights #Feminist #SemST",
    "perception": "The person's perception of the tweet would be one of shock and disbelief, as the tweet is clearly derogatory and dismissive of the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is offensive and disrespectful to the feminist movement, and that the author of the tweet is ignorant and dismissive of the importance of women's rights.",
    "action": "Women are capable of so much more than just sex. #Feminist #WomensRights #RespectWomen"
  },
  {
    "ID": 584,
    "Target": "Feminist Movement",
    "Tweet": "If women do it, it cannot be immoral or evil. Right?  Welcome to feminism defending pedophilia promoter #LenaDunham  #SemST",
    "perception": "The person's perception of the tweet would be one of shock and disbelief, as it appears to be defending a controversial figure who promotes pedophilia. They may also feel a sense of anger and frustration towards the tweet's message.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to defend a controversial figure who promotes pedophilia, and that this is not in line with the values of the Feminist Movement. They may also feel that the tweet is attempting to discredit the movement by associating it with such a figure.",
    "action": "Feminism is about equality and respect for all, not defending those who promote pedophilia. #NoToPedophilia #SemST"
  },
  {
    "ID": 583,
    "Target": "Feminist Movement",
    "Tweet": "The mentality of #GamerGate is,   \"HEY! OUR Feminists are suuuuper stable! BTW don't agitate them with any criticism\"  #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of the #GamerGate movement and its attitude towards feminists, suggesting that they are not open to criticism. They may also perceive the tweet as being supportive of the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the #GamerGate movement is not open to criticism of their views on feminism, and that they are not taking a progressive stance on the issue. They may also interpret the tweet as a call to action to challenge the movement's views on feminism.",
    "action": "We must challenge the #GamerGate movement's views on feminism and demand that they take a progressive stance on the issue. #FeministMovement"
  },
  {
    "ID": 582,
    "Target": "Feminist Movement",
    "Tweet": "When did trivializing the suffering of authentic rape victims become a \"sport\"?  Welcome to feminism.   #GamerGate #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it appears to be criticizing the trivialization of rape victims and linking it to the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the feminist movement is responsible for the trivialization of rape victims, and that this is a problem that needs to be addressed. They may also feel a sense of urgency to take action to address this issue.",
    "action": "We must stand together to ensure that rape victims are never trivialized. #NoMoreVictimBlaming #FeministMovement"
  },
  {
    "ID": 376,
    "Target": "Feminist Movement",
    "Tweet": "I brace myself for the onslaught anytime I walk by any man on the street.  #catcalling #streetharassment #equality #sexism #SemST",
    "perception": "The person's perception of the tweet is likely one of anger and frustration, as it speaks to the issue of street harassment and the unequal treatment of women. They may also feel a sense of solidarity with the hashtag topics, as they relate to the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that street harassment is a serious issue that needs to be addressed, and that the Feminist Movement is an important part of the fight for equality and justice. They may also recognize the need for more education and awareness around the issue of sexism and gender-based violence.",
    "action": "No one should have to fear walking down the street. We must continue to fight for #equality and #justice for all. #catcalling #streetharassment #sexism #SemST"
  },
  {
    "ID": 637,
    "Target": "Feminist Movement",
    "Tweet": "The majority of anti-abortion leaders are men and none of them will ever be pregnant.  #genderequity #SemST",
    "perception": "The person's perception of the tweet would be one of support for gender equality and a criticism of the lack of representation of women in anti-abortion leadership. They may also feel a sense of frustration at the lack of progress in achieving gender equity.",
    "cognition": "The person's cognition after perceiving the information would be that gender inequality is still a major issue in the anti-abortion movement, and that women should be better represented in leadership roles. They may also recognize the importance of the #genderequity and #SemST hashtags in raising awareness of the issue.",
    "action": "It's time for women to be represented in anti-abortion leadership. We need to work together to achieve #genderequity and #SemST!"
  },
  {
    "ID": 236,
    "Target": "Feminist Movement",
    "Tweet": "@Daily_Feminism -- give us a follow back.   #feminist #SemST",
    "perception": "The person's perception of this tweet would be that it is a call to action to support the Feminist Movement, and that the tweet is positive and encouraging.",
    "cognition": "The person's cognition of this tweet would be that the Daily Feminism account is asking for followers to join their cause and spread awareness of the Feminist Movement. They are also using hashtags to reach a wider audience and increase visibility of their message.",
    "action": "@Daily_Feminism I'm here to support the Feminist Movement! #feminist #SemST"
  },
  {
    "ID": 600,
    "Target": "Feminist Movement",
    "Tweet": "Feminism is nothing more than a cult that closes ranks whenever someone dares question them. #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it implies that the Feminist Movement is a closed-minded and exclusive group.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a negative and dismissive view of the Feminist Movement, and that it is an attempt to discredit the movement and its supporters.",
    "action": "Feminism is about equality and justice for all genders. We must continue to fight for these rights and not be discouraged by those who don't understand. #FeminismIsEquality"
  },
  {
    "ID": 431,
    "Target": "Feminist Movement",
    "Tweet": "Someone should do a #Meminist Frequency video response highlighting the violence against men portrayed in video games. #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for a more balanced approach to gender representation in video games, and that it is highlighting the violence against men in video games.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for a more balanced approach to gender representation in video games, and that it is calling attention to the violence against men in video games. They may also recognize that the hashtag #Meminist is a play on the word \"feminist\" and that the hashtag #SemST is likely referring to the term \"sexism\".",
    "action": "I'm in full support of this idea! We need to ensure that all genders are represented fairly in video games and that violence against men is not overlooked. #Meminist #SemST"
  },
  {
    "ID": 146,
    "Target": "Feminist Movement",
    "Tweet": ".@cooImemegirl Feminists reject (or ignore the fight for) equality when it might hurt women. That's not equality, duh. #SemST",
    "perception": "The person's perception of the tweet might be that the author is critical of feminists who do not prioritize equality for all genders, and is emphasizing the importance of true equality.",
    "cognition": "The person's cognition after perceiving the information might be that the author is suggesting that feminists should prioritize true equality for all genders, and that rejecting or ignoring the fight for equality when it might hurt women is not true equality.",
    "action": "Agreed! We must prioritize true equality for all genders, and reject any form of inequality that harms any gender. #Feminism #EqualityForAll"
  },
  {
    "ID": 379,
    "Target": "Feminist Movement",
    "Tweet": "What a great accomplishment #marriageequality , too bad it still sucks to be black or a woman in America. #racism #truthbomb #SemST",
    "perception": "The person's perception of this tweet would be one of admiration for the progress made in marriage equality, but also a recognition of the ongoing issues of racism and sexism in America.",
    "cognition": "The person's cognition after perceiving the information would be that while marriage equality is a step in the right direction, there is still much work to be done to address racism and sexism in America. They would also recognize the importance of continuing to fight for social justice and equality for all.",
    "action": "We must continue to fight for social justice and equality for all. #FeministMovement #MarriageEquality #Racism #Sexism"
  },
  {
    "ID": 17,
    "Target": "Feminist Movement",
    "Tweet": "Why do girls/women spend so much time to be pretty and attractive and then complain if they're reduced to a sex symbol? #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be criticizing the feminist movement for encouraging women to take pride in their appearance.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that women should not take pride in their appearance, and that the feminist movement is somehow responsible for this. They may also feel that the tweet is attempting to undermine the feminist movement by suggesting that it encourages women to be seen as sex symbols.",
    "action": "Women should be able to take pride in their appearance without being reduced to a sex symbol. #FeministMovement"
  },
  {
    "ID": 253,
    "Target": "Feminist Movement",
    "Tweet": "This #MaritalRape law if misused dont give any scope to men to prove their innocence.Even honest men can be trapped & slaughtered. #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that men are being unfairly targeted and punished for something they may not have done. They may also feel a sense of urgency to take action to protect men from this injustice.",
    "cognition": "The person's cognition after perceiving the information would be that the proposed law is unfair and could lead to innocent men being wrongfully accused and punished. They may also feel a sense of urgency to take action to ensure that men are not unfairly targeted and punished for something they may not have done.",
    "action": "We must ensure that #MaritalRape laws are not misused and that innocent men are not wrongfully accused and punished. #FeministMovement #SemST"
  },
  {
    "ID": 592,
    "Target": "Feminist Movement",
    "Tweet": "@kbambi1376 It's not a conscious choice that's made. Betas make women feel unsafe, unprotected, right? #SpankAFeminist #SemST",
    "perception": "The person's initial perception of this tweet would be one of confusion and frustration, as it appears to be mocking the Feminist Movement and its supporters. They may also feel a sense of anger towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a joke out of the Feminist Movement and its supporters, and that it is implying that women are not safe or protected without the support of men.",
    "action": "@kbambi1376 Feminism is about creating a safe and equal world for everyone, regardless of gender. #FeminismIsForEveryone #WomenEmpowerment"
  },
  {
    "ID": 287,
    "Target": "Feminist Movement",
    "Tweet": "@jordanelliott_ Slut is a word made to degrade women, we shouldn't degrade anyone - it's their body's they can do what they like #SemST",
    "perception": "The person's perception of this tweet would be one of support for the Feminist Movement, as it is advocating for the respect of women's bodies and choices. They may also feel a sense of solidarity with the hashtag #SemST, which could indicate a shared sentiment of standing up for women's rights.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the respect of women's bodies and choices, and that the hashtag #SemST is a sign of solidarity for the Feminist Movement. They may also feel empowered by the message, and inspired to continue to fight for women's rights.",
    "action": "Thank you @jordanelliott_ for standing up for women's rights! #SemST #FeministMovement"
  },
  {
    "ID": 457,
    "Target": "Feminist Movement",
    "Tweet": "Women are shamed if they don't want children, but then told if they want to be payed equally they shouldn't have children at all. #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards the double standards placed on women in society. They would likely sympathize with the sentiment of the tweet and agree that women should not be shamed for their choices.",
    "cognition": "The person's cognition after perceiving the information would be that women are unfairly judged and discriminated against for their choices, regardless of whether they choose to have children or not. They would likely recognize that this is a systemic issue that needs to be addressed in order to create a more equitable society.",
    "action": "It's time to end the double standards and unfair judgement of women. We must work together to create a more equitable society. #FeministMovement"
  },
  {
    "ID": 89,
    "Target": "Feminist Movement",
    "Tweet": ".@nycinterlude Don't worry, honey. Intelligence is a roadblock to full, unquestioning faith in feminism. Bleated be! #SemST",
    "perception": "The person's perception of this tweet would be that it is mocking the Feminist Movement and implying that intelligence is a hindrance to fully believing in it. They may also perceive the tweet as being sarcastic and condescending.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a joke at the expense of feminists and implying that intelligence is a barrier to fully believing in the movement. They may also interpret the tweet as being dismissive and belittling of the Feminist Movement.",
    "action": "@nycinterlude Intelligence is not a roadblock to believing in feminism. We should all strive to be informed and educated about the movement and its goals. #Feminism"
  },
  {
    "ID": 68,
    "Target": "Feminist Movement",
    "Tweet": "@amin86660132 @justsoshelby  Very nice work. I'm happy to hear your autistic friend is able to express himself this way #SemST",
    "perception": "The person's perception of this tweet would be one of admiration and support for the work done by the two people mentioned, as well as appreciation for the autistic friend's ability to express himself. They would also likely be pleased to see the hashtag #SemST, which is associated with the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the two people mentioned are doing something positive to support the Feminist Movement, and that they are also helping an autistic person to express themselves. They would also likely be encouraged by the use of the hashtag #SemST, which is associated with the Feminist Movement.",
    "action": "Great work @amin86660132 and @justsoshelby! It's wonderful to see people supporting the Feminist Movement and helping an autistic person express themselves. #SemST"
  },
  {
    "ID": 343,
    "Target": "Feminist Movement",
    "Tweet": "@lucypalmreports I don't need feminism because I am pretty #SemST",
    "perception": "The person's initial perception of this tweet would be one of confusion and disbelief, as the tweet appears to be contradicting the values of the Feminist Movement. They may also feel a sense of disappointment, as the tweet implies that physical appearance is more important than gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting a shallow and misguided view of feminism, and that it is not in line with the values of the Feminist Movement. They may also feel that the tweet is perpetuating gender stereotypes and is not an accurate representation of the movement.",
    "action": "@lucypalmreports Feminism is about more than just physical appearance. It's about gender equality and the empowerment of all people, regardless of gender. #Feminism #GenderEquality"
  },
  {
    "ID": 308,
    "Target": "Feminist Movement",
    "Tweet": "It is not up to you to contemplate getting fired, feminists WILL get you fired @Mercurial891 @MGTOWKnight  #GamerGate  #SemST",
    "perception": "The person's perception of this tweet is likely to be one of anger and frustration towards the anti-feminist movement. They may also feel a sense of solidarity with the feminist movement, as the tweet implies that feminists are actively working to fight against those who oppose them.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the anti-feminist movement is actively working to silence and oppress feminists, and that feminists are fighting back against this oppression. They may also feel a sense of empowerment and hope that the feminist movement will be successful in their efforts.",
    "action": "We stand with feminists in their fight against oppression and injustice. #FeministMovement #Solidarity #Resist"
  },
  {
    "ID": 99,
    "Target": "Feminist Movement",
    "Tweet": "The only reason, I stopped at each entrance in #walkingstreet is to have a #LawOfAttraction #viewpoint #dailydevotional #SemST",
    "perception": "The person's initial perception of the tweet might be that it is a positive message about the Feminist Movement, as it includes hashtags such as #LawOfAttraction and #dailydevotional. They may also interpret the tweet as a call to action, encouraging people to take part in the movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is encouraging people to take part in the Feminist Movement by taking a positive viewpoint and having a daily devotional. They may also interpret the tweet as a reminder to stay focused on the goal of the movement and to keep striving for equality.",
    "action": "Let's keep striving for equality and justice! #FeministMovement #LawOfAttraction #DailyDevotional #SemST"
  },
  {
    "ID": 456,
    "Target": "Feminist Movement",
    "Tweet": "*watching house of cards with my dad* \"I could be First Lady.\" \"Why not president?\" \"YEAH DAD! Next woman president right here!\"  #SemST",
    "perception": "The person's perception of this tweet would be one of enthusiasm and support for the idea of a female president, as well as a positive attitude towards the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing a desire for a female president, and that the speaker is actively advocating for the Feminist Movement.",
    "action": "Yes! Let's make it happen! #FeministMovement #WomenInPower"
  },
  {
    "ID": 258,
    "Target": "Feminist Movement",
    "Tweet": "@Fashionopolis You just gained a new follower! The #misogynist #maritalrapedebate views has got me outraged! #SemST",
    "perception": "The person's perception of the tweet would be one of shock and anger, as the tweet is discussing a misogynistic and potentially triggering topic. They would likely be appalled by the views expressed in the tweet and be motivated to take action against them.",
    "cognition": "The person's cognition after perceiving the information would be to recognize the need to take a stand against the views expressed in the tweet. They would likely be motivated to use their platform to speak out against the views and to support the Feminist Movement.",
    "action": "@Fashionopolis I'm appalled by the #misogynist #maritalrapedebate views expressed in this tweet. We must take a stand against these views and support the Feminist Movement! #SemST"
  },
  {
    "ID": 555,
    "Target": "Feminist Movement",
    "Tweet": "Storey's Song of the Day: To love somebody (BeeGees); topic of the day: Feminism in cultural theory. I love this class. #BeeGees #SemST",
    "perception": "The person's perception of this tweet would be one of admiration and appreciation for the topic of the day, as well as a fondness for the song choice. They may also feel a sense of solidarity with the person who posted the tweet, as they share a common interest in the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the person who posted the tweet is likely knowledgeable and passionate about the topic of feminism in cultural theory, and that they are likely to be a fan of the BeeGees.",
    "action": "@username I'm so glad you're learning about feminism in cultural theory! The BeeGees are one of my favorite bands too. #Feminism #BeeGees"
  }
]