[
  {
    "ID": 74,
    "Target": "Feminist Movement",
    "Tweet": "so i guess the new definition of ugly is believing in equal rights... LET ME BE UGLY THEN #SemST",
    "perception": "The person's perception of the tweet would be one of surprise and indignation, as it implies that believing in equal rights is considered ugly. They may also feel a sense of solidarity with the hashtag, as it is a call to action for the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a criticism of the idea that believing in equal rights is seen as unattractive or undesirable. They may also recognize the hashtag as a call to action for the feminist movement, and feel empowered to join in the fight for equal rights.",
    "action": "No one should be judged for believing in equal rights! #SemST #FeministMovement"
  },
  {
    "ID": 13,
    "Target": "Feminist Movement",
    "Tweet": "If you're a feminist AND you hate men, please kill yourself. #SemST",
    "perception": "The person's initial perception of this tweet would be one of shock and anger, as it is clearly an offensive and misogynistic statement. They would likely feel that the tweet is an attack on the feminist movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of sexism and hatred towards feminists and the feminist movement. They would likely recognize that the tweet is an attempt to discredit and undermine the feminist movement and its supporters.",
    "action": "This tweet is unacceptable and offensive. We must stand together to fight against sexism and misogyny. #Feminism #Equality"
  },
  {
    "ID": 439,
    "Target": "Feminist Movement",
    "Tweet": "Staying well informed on sexual violence in the news is important yet often leaves me ranting at screen. #rapeculture #SemST",
    "perception": "The person's perception of the tweet would be one of anger and frustration at the prevalence of sexual violence in the news, and a desire to take action against it. They would likely be in agreement with the hashtag topics of #rapeculture and #SemST.",
    "cognition": "The person's cognition after perceiving the information would be that sexual violence is a serious issue that needs to be addressed, and that the Feminist Movement is an important part of the solution. They would likely feel motivated to take action and spread awareness of the issue.",
    "action": "We must take action to end #rapeculture and #SemST. Let's work together to create a safer world for everyone. #FeministMovement"
  },
  {
    "ID": 484,
    "Target": "Feminist Movement",
    "Tweet": "I am #NotAFeminist b/c human rights are for all humans, not just half of them.   #antifeminism #antifeminist #SemST",
    "perception": "The person's initial perception of this tweet would be one of confusion and disbelief, as the tweet appears to be contradicting the values of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing an anti-feminist sentiment, and that the author believes that human rights should be for all humans, not just women.",
    "action": "Human rights are for everyone, not just half of them. We need to work together to ensure that all humans have equal rights and opportunities. #Feminism #EqualRights #HumanRights"
  },
  {
    "ID": 168,
    "Target": "Feminist Movement",
    "Tweet": "OH NO EQUALITY FOR ALL WHAT SHALL WE DO ?!?!? STOP FEMINIST ASAP #SemST",
    "perception": "The person's initial perception of the tweet would be one of shock and disbelief, as the tweet appears to be advocating against the Feminist Movement. They may also feel a sense of anger and frustration at the sentiment expressed in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on the Feminist Movement and its goals of achieving equality for all. They may also view the hashtag as an attempt to spread misinformation and discredit the movement.",
    "action": "Equality for all is a fundamental right! We must continue to fight for the rights of all genders and stand up for the Feminist Movement #FeminismMatters"
  },
  {
    "ID": 607,
    "Target": "Feminist Movement",
    "Tweet": "The fact that Chris Brown is somehow still famous is why I need #SemST",
    "perception": "The person's perception of this tweet is likely one of frustration and disappointment, as it implies that the success of someone who has been accused of domestic violence is a sign of the need for the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely that the success of someone accused of domestic violence is a sign of the need for the Feminist Movement to continue to fight for gender equality. They may also recognize the need to hold people accountable for their actions and to ensure that those who commit acts of violence are not rewarded with fame and fortune.",
    "action": "We must continue to fight for gender equality and hold people accountable for their actions. #SemST #FeministMovement"
  },
  {
    "ID": 260,
    "Target": "Feminist Movement",
    "Tweet": "@thomas_RAL: Most feminists don't know what they are fighting for?! Most ego maniac's who want they're 15 minutes of fame. #c4news #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it implies that feminists are misguided and only seeking attention.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is dismissive of the feminist movement and its goals, and that it is perpetuating a negative stereotype of feminists.",
    "action": "@thomas_RAL: Feminism is about fighting for gender equality and justice. Dismissing it as a quest for fame is wrong and damaging. #c4news #SemST"
  },
  {
    "ID": 422,
    "Target": "Feminist Movement",
    "Tweet": "DEAR ANTI-PORN FEMINISTS   If you've never eaten popcorn while watching porn you are missing out in life... #GamerGate #SemST",
    "perception": "The person's initial perception of the tweet might be one of confusion and disbelief, as it appears to be a contradictory statement that combines two seemingly unrelated topics. They may also feel a sense of frustration, as the tweet appears to be mocking the feminist movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is attempting to make a joke at the expense of anti-porn feminists, and that the hashtag is being used to draw attention to the Gamergate controversy.",
    "action": "This tweet is inappropriate and offensive. #Feminism #Respect"
  },
  {
    "ID": 5,
    "Target": "Feminist Movement",
    "Tweet": "Suns out....  Dresses out...  #StreetHarassment out...  This shouldn't be daily life  #YesAllWomen @EverydaySexism #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as it calls for an end to street harassment and acknowledges the struggles of women in everyday life. The person would also likely appreciate the use of hashtags to draw attention to the issues of sexism and street harassment.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for an end to street harassment and sexism, and that it is calling for a society where women can feel safe and respected. The person would likely also recognize the importance of raising awareness of these issues and the need for collective action to bring about change.",
    "action": "Agreed! We must work together to create a world where women can feel safe and respected. #YesAllWomen #SemST #EndStreetHarassment"
  },
  {
    "ID": 401,
    "Target": "Feminist Movement",
    "Tweet": "Old, insecure females forcing hatred of men on a younger generation of women #SemST",
    "perception": "The person's initial perception of this tweet would be one of anger and frustration, as it appears to be criticizing the feminist movement and its supporters. They may also feel a sense of disappointment that someone is attempting to spread negative messages about feminism.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the feminist movement by implying that it is led by old, insecure women who are trying to spread hatred of men. They may also feel that the tweet is attempting to discourage younger generations of women from supporting the feminist movement.",
    "action": "#Feminism is about equality and respect for all genders, not hatred. We must continue to fight for the rights of all people, regardless of age or gender. #FeministMovement"
  },
  {
    "ID": 331,
    "Target": "Feminist Movement",
    "Tweet": "now let's raise the pay for females and make it equal to what men get payed #EAQUALITY #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as it calls for equal pay for women and men. They would also likely view the hashtag #EAQUALITY and #SemST as a sign of solidarity with the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for equal pay for women and men, and that the hashtag is a sign of support for the Feminist Movement. They would likely interpret the tweet as a call to action to help achieve gender equality in the workplace.",
    "action": "I'm in! Let's make sure everyone gets the pay they deserve. #EAQUALITY #SemST #FeministMovement"
  },
  {
    "ID": 167,
    "Target": "Feminist Movement",
    "Tweet": ".@cooImemegirl @TC_Stompa You have no respect for real equality so you lie and claim feminists want it. #SemST",
    "perception": "The person's perception of this tweet would be one of anger and frustration towards those who misrepresent the feminist movement. They may also feel a sense of injustice towards those who are not accurately representing the movement's goals.",
    "cognition": "The person's cognition after perceiving the information would be that those who are misrepresenting the feminist movement are not only doing a disservice to the movement, but also to the cause of true equality. They may also feel that it is important to call out those who are spreading misinformation about the feminist movement in order to ensure that the movement is accurately represented.",
    "action": "Misrepresenting the feminist movement does a disservice to the cause of true equality. We must call out those who are spreading misinformation about the feminist movement #Feminism"
  },
  {
    "ID": 213,
    "Target": "Feminist Movement",
    "Tweet": "Well maybe if more men learned to take \"no\" as an answer, women wouldn't have to say as much #fnm231 #SemST",
    "perception": "The person's perception of the tweet would be that it is a positive statement in support of the Feminist Movement, highlighting the importance of respecting women's decisions. They may also interpret it as a call for men to take responsibility for their actions and be more mindful of the impact of their words and behavior.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for men to be more respectful of women's decisions and to take \"no\" as an answer. They may also interpret it as a call for men to be more aware of the impact of their words and behavior on women.",
    "action": "Agreed! We need to create a culture where men are held accountable for their words and actions, and where women's decisions are respected. #fnm231 #SemST"
  },
  {
    "ID": 594,
    "Target": "Feminist Movement",
    "Tweet": "If Feminism is not hypocritical fake \"equality\" then manure sprayed in pink is not fecal.   #GamerGate #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be mocking the Feminist Movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the Feminist Movement by implying that its supporters are hypocritical and that their beliefs are false. They would also likely feel that the tweet is attempting to delegitimize the movement and its supporters.",
    "action": "Feminism is about equality and respect for all genders, not about painting manure pink. #Feminism #Equality"
  },
  {
    "ID": 188,
    "Target": "Feminist Movement",
    "Tweet": "@carly_senatore Also im assuming you claim to be one...yet you just called me an idiot and you dont even know me. Nice. #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as the tweet implies that the person is being judged without any knowledge of them. They may also feel a sense of anger towards the person who wrote the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of sexism and discrimination, and that the person who wrote the tweet is not supportive of the Feminist Movement.",
    "action": "@carly_senatore Your words are not in line with the values of the Feminist Movement. We should all strive to be respectful and understanding of each other."
  },
  {
    "ID": 47,
    "Target": "Feminist Movement",
    "Tweet": "when they say men look at women like a piece of meat what do they even mean, they want to cook & eat her? #YesAllWomen #SemST",
    "perception": "The person's perception of the tweet would be one of confusion and frustration, as the tweet appears to be making a joke out of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making light of the Feminist Movement and is dismissive of the issues that women face. They would also likely recognize that the hashtag #YesAllWomen is being used to draw attention to the issues that women face.",
    "action": "This tweet is not funny and is dismissive of the issues that women face. #YesAllWomen #FeministMovement"
  },
  {
    "ID": 540,
    "Target": "Feminist Movement",
    "Tweet": "@kimiyyye nah bitch I'm a fucking savage obviously . You just gonna suck dick and make sandwiches for some man who beats you daily #SemST",
    "perception": "The person's initial perception of this tweet would be one of shock and disbelief. They would likely be appalled by the misogynistic language and sentiment expressed in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting a culture of violence and oppression against women. They would likely be angered by the tweet and view it as an example of the kind of attitudes that the Feminist Movement is fighting against.",
    "action": "@kimiyyye Your tweet is unacceptable and promotes a culture of violence and oppression against women. #FeministMovement #EndMisogyny"
  },
  {
    "ID": 577,
    "Target": "Feminist Movement",
    "Tweet": "Amusing how Feminists & Creationists swap their own personal \"I don't like it\" by \"God/Women don't like it\" #GamerGate #SemST",
    "perception": "The person's initial perception of the tweet might be that it is mocking the Feminist Movement and Creationism, and that it is making a comparison between the two. They may also perceive the tweet as being critical of the #GamerGate and #SemST movements.",
    "cognition": "The person may interpret the tweet as implying that the Feminist Movement and Creationism are both based on personal opinions rather than facts, and that the #GamerGate and #SemST movements are being unfairly criticized. They may also conclude that the tweet is attempting to discredit the Feminist Movement and Creationism by equating them.",
    "action": "Feminism and Creationism are based on facts, not personal opinions. #Feminism #Creationism #Respect"
  },
  {
    "ID": 82,
    "Target": "Feminist Movement",
    "Tweet": ".@Awyee707 I respect your truck-suck. Why do you not respect girls' innate or chosen doll-love? #SemST",
    "perception": "The person's perception of this tweet would be that it is a criticism of someone who does not respect girls' interests in dolls, and is advocating for the feminist movement. They may also perceive the tweet as a call to action to support the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the respect of girls' interests, regardless of whether they are innate or chosen, and is calling for support of the feminist movement. They may also interpret the tweet as a criticism of those who do not respect girls' interests in dolls.",
    "action": "I stand with @Awyee707 and the feminist movement! We must respect girls' interests, no matter what they are. #Feminism #RespectGirls"
  },
  {
    "ID": 544,
    "Target": "Feminist Movement",
    "Tweet": "I feel so self-conscious now. THAT'S what catcalls do. Not flattered, not pretty. I feel anxious and wanna go home. #SemST",
    "perception": "The person's perception of the tweet is likely one of empathy and understanding of the negative effects of catcalling. They may also feel a sense of solidarity with the person who posted the tweet, recognizing the shared experience of feeling unsafe and uncomfortable in public spaces.",
    "cognition": "The person's cognition after perceiving the information is likely to be that catcalling is a form of harassment that can have a negative impact on a person's mental health and sense of safety. They may also recognize the need for greater awareness and education around the issue of catcalling and its effects.",
    "action": "No one should have to feel unsafe or uncomfortable in public spaces. We need to work together to raise awareness and end catcalling. #SemST"
  },
  {
    "ID": 77,
    "Target": "Feminist Movement",
    "Tweet": "I can't believe some of the reasons people say they need feminism. I need my dog for half of the same reasons.  #antifeminist #SemST",
    "perception": "The person's perception of this tweet is likely to be one of disbelief and frustration, as it implies that people are using feminism for trivial reasons. They may also feel a sense of anger towards the hashtag #antifeminist and #SemST.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is mocking the feminist movement and that the hashtag #antifeminist and #SemST are being used to express a negative sentiment towards feminism.",
    "action": "Feminism is about more than just trivial reasons. It's about equality and respect for all genders. #feminism #equality"
  },
  {
    "ID": 280,
    "Target": "Feminist Movement",
    "Tweet": "Kwink884 thewtfmagazine gamers are fatophobes. ever notice there are no morbidly obese characters in video games? #GamerGate #Not... #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards the fatphobia in the gaming industry. They would also likely be in support of the hashtag #SemST, which is likely related to the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the gaming industry is perpetuating fatphobia by not including morbidly obese characters in video games. They would also likely be in support of the hashtag #SemST, which is likely related to the Feminist Movement and its goal of creating a more inclusive gaming industry.",
    "action": "#SemST is a powerful movement that is working to create a more inclusive gaming industry. We must stand together to fight fatphobia in the gaming industry! #GamerGate #NotYourShield"
  },
  {
    "ID": 576,
    "Target": "Feminist Movement",
    "Tweet": "Feminists saying they are \"atheists/skeptics\" is quite a contradiction as they worship their own vulva.   #GamerGate #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and confusion, as the tweet implies that feminists are hypocritical in their beliefs. They may also feel anger or frustration at the tweet's negative connotations towards feminists.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on feminists, implying that they are hypocritical in their beliefs. They may also come to the conclusion that the tweet is attempting to discredit the feminist movement by associating it with religious worship.",
    "action": "Feminism is about equality and respect, not worship. #Feminism #Equality #Respect"
  },
  {
    "ID": 233,
    "Target": "Feminist Movement",
    "Tweet": "V! Can't wait to see you! # #SemST",
    "perception": "The person's initial perception of the tweet would be one of enthusiasm and excitement, as indicated by the use of an exclamation mark and the hashtag. They may also interpret the hashtag as a sign of support for the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as a sign of support for the Feminist Movement, as well as an expression of enthusiasm and excitement for the person mentioned in the tweet. They may also make the connection between the hashtag and the Feminist Movement, and interpret the tweet as a sign of solidarity.",
    "action": "@V, so excited to see you too! #FeministMovement #SemST"
  },
  {
    "ID": 100,
    "Target": "Feminist Movement",
    "Tweet": "@rimmedlarry Actually, the tag was made by feminists so they can narcissistically post selfies to prove they're not ugly. #SemST",
    "perception": "The person's initial perception of the tweet might be one of confusion and disbelief, as the tweet appears to be mocking the Feminist Movement. They may also feel a sense of disappointment, as the tweet implies that feminists are self-centered and vain.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is making a negative statement about feminists, implying that they are narcissistic and vain. They may also come to the conclusion that the hashtag was created by feminists to post selfies in order to prove that they are not ugly.",
    "action": "@rimmedlarry This tweet is offensive and does not accurately represent the Feminist Movement. #FeminismIsNotNarcissism"
  }
]