[
  {
    "ID": 746,
    "Target": "Legalization of Abortion",
    "Tweet": "Still waiting for Libs to explain how the premeditated murder of a premature baby is reproductive healthcare. #ccot #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval and opposition to the legalization of abortion. They may also feel frustrated that their views are not being taken seriously or respected.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is the same as murder, and that the person who wrote the tweet is against the legalization of abortion. They may also feel that the tweet is trying to discredit their views on the issue.",
    "action": "Abortion is a complex issue and should be treated with respect. #prochoice #reproductivehealthcare"
  },
  {
    "ID": 832,
    "Target": "Legalization of Abortion",
    "Tweet": "Women's rights are a joke.  Omg I can't even. Lol go thank your mom for keeping you. #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it implies that women's rights are not taken seriously and that the person should be thankful for not being aborted.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that women's rights are not taken seriously and that abortion should not be an option. They would also likely interpret the tweet as being dismissive of the importance of women's rights and the struggles that women face.",
    "action": "Women's rights are not a joke. Abortion should be a safe and legal option for women. #ReproRights"
  },
  {
    "ID": 1146,
    "Target": "Legalization of Abortion",
    "Tweet": "abortion clinics... back alleys with a profit center and air conditioning?  #SemST",
    "perception": "The person's perception of this tweet would be that it is making a sarcastic comment about the current state of abortion access, implying that it should be legalized and made more accessible. They may also perceive it as a criticism of the current system, which does not prioritize the safety of those seeking abortions.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the need for abortion to be legalized and made more accessible, as well as the need for improved safety measures for those seeking abortions. They may also recognize that the tweet is making a statement about the current state of abortion access and the need for change.",
    "action": "Abortion should be safe, legal, and accessible to all. #AbortionRights #SemST"
  },
  {
    "ID": 742,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @NYS4Life: RT if you're ready to help us defeat #AssistedSuicidelike we defeated #AbortionExpansion! #noPASny #SemST",
    "perception": "The person's perception of this tweet would likely be one of opposition to the legalization of abortion, as it references defeating abortion expansion and mentions the hashtag #noPASny. They may also feel a sense of urgency to take action against assisted suicide.",
    "cognition": "The person's cognition after perceiving the information would likely be that they need to take action to oppose assisted suicide, as it is being presented as a threat to the progress made in the fight for abortion rights. They may also feel a sense of urgency to join the fight against assisted suicide, as it is being presented as a pressing issue.",
    "action": "I'm standing with @NYS4Life to oppose #AssistedSuicide and protect the progress we've made in the fight for #AbortionRights! #noPASny #SemST"
  },
  {
    "ID": 769,
    "Target": "Legalization of Abortion",
    "Tweet": "Like the govt. is literally taking away your right to live your own life by defunding right now #SemST",
    "perception": "The person's perception of this tweet would be one of outrage and disbelief, as it appears to be criticizing the government for taking away a person's right to make their own decisions.",
    "cognition": "The person's cognition after perceiving the information would be that the government is taking away a person's right to make decisions about their own life, such as the right to have an abortion. This could be seen as an infringement of a person's autonomy and freedom.",
    "action": "This is unacceptable! Everyone should have the right to make decisions about their own life. #SemST #AbortionRights"
  },
  {
    "ID": 1232,
    "Target": "Legalization of Abortion",
    "Tweet": "PRAYERS FOR BABIES Urgent prayer in Detroit MI ...two in San Diego CA&one in San Antonio  Life begins at conception  #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating against abortion, as it is emphasizing the importance of life beginning at conception and calling for prayers for unborn babies.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the protection of unborn babies and is against the legalization of abortion. They may also interpret the tweet as a call to action to protect the unborn and to oppose abortion.",
    "action": "Abortion should be a choice, not a mandate. We must protect the rights of women to make decisions about their own bodies. #ReproRights"
  },
  {
    "ID": 1192,
    "Target": "Legalization of Abortion",
    "Tweet": "#Prolife laws kill women. Real #feminists are #prochoice. Calling us #feminazi? Because of course you have no arguments. #fem2 #SemST",
    "perception": "The person's perception of this tweet would be that it is strongly in favor of the legalization of abortion and is critical of pro-life laws. They may also perceive it as a criticism of those who label pro-choice advocates as \"feminazis\".",
    "cognition": "The person's cognition after perceiving the information would be that pro-life laws are dangerous and oppressive to women, and that pro-choice advocates should not be labeled as \"feminazis\" as they have valid arguments.",
    "action": "Agreed! #Prochoice is the only way to ensure women's safety and autonomy. #Fem2 #SemST #ProlifeLawsKillWomen"
  },
  {
    "ID": 674,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @GrumpyOldGuy2: #DebbieWashermanSchultz the woman has a voice the doctor has a voice. Who speaks for the baby? I'm just askin. #SemST",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that the baby should have a voice in the decision. They may also perceive it as a criticism of Debbie Wasserman Schultz.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the baby should have a say in the decision to legalize abortion, and that it is a criticism of Debbie Wasserman Schultz. They may also interpret it as a call for greater consideration of the rights of the unborn.",
    "action": "@GrumpyOldGuy2 We should consider the rights of the unborn, but ultimately the decision to legalize abortion should be made by those directly affected by it."
  },
  {
    "ID": 995,
    "Target": "Legalization of Abortion",
    "Tweet": "@SuePalmers @LSDsr Nothing to do with me.  It's not my choice, nor is it yours, to dictate what another woman chooses. #feminism #SemST",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as well as a strong stance for women's rights and feminism. They may also perceive a sentiment of empowerment and solidarity with other women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right of women to make their own decisions about their bodies, and that it is not up to anyone else to dictate what a woman chooses to do. They may also interpret the tweet as a call for solidarity among women and a celebration of feminism.",
    "action": "@SuePalmers @LSDsr Absolutely! Women should have the right to make their own decisions about their bodies. #feminism #SemST"
  },
  {
    "ID": 702,
    "Target": "Legalization of Abortion",
    "Tweet": "God forbid you'd ever have to walk a mile in her shoes. Then you really might know what it's like to have to choose. #SemST",
    "perception": "The person's perception of this tweet would be one of understanding and empathy towards those who have to make the difficult decision to have an abortion. They may also feel a sense of solidarity with the hashtag #SemST, which could indicate support for the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion, and that it is expressing empathy and understanding for those who have to make the difficult decision to have an abortion.",
    "action": "I stand with those who have to make the difficult decision to have an abortion. #SemST #LegalizeAbortion"
  },
  {
    "ID": 886,
    "Target": "Legalization of Abortion",
    "Tweet": "Amen, I say to you, whatever you did for one of these least brothers of mine, you did for Me.'  Mt 25:40  #ProLifeYouth #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the Pro-Life movement and is against the legalization of abortion. They may also perceive it as a religious sentiment, as it references a Bible verse.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the Pro-Life movement and is against the legalization of abortion. They may also interpret the tweet as a religious sentiment, as it references a Bible verse and implies that taking care of the least of us is a moral imperative.",
    "action": "I disagree with this sentiment. Everyone should have the right to make their own decisions about their bodies and their health.\" #ProChoice #AbortionRights"
  },
  {
    "ID": 1212,
    "Target": "Legalization of Abortion",
    "Tweet": "Put into perspective: Est 32,000 rape-caused pregnancies/yr = 22x less than est 730,000 abortions/yr. #StrawMan #WarOnWomen #SemST",
    "perception": "The person's perception of the tweet would be that it is making a comparison between the number of rape-caused pregnancies and abortions, and is likely making a point against the legalization of abortion. They may also perceive the tweet as having a negative sentiment towards those who support the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the number of abortions is much higher than the number of rape-caused pregnancies, and that this is being used to argue against the legalization of abortion. They may also interpret the tweet as being critical of those who support the legalization of abortion.",
    "action": "Abortion should be a choice, not a mandate. We must protect the rights of women to make their own decisions about their bodies. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 1136,
    "Target": "Legalization of Abortion",
    "Tweet": "#Liberals don't realize they conceded the debate. Now - per Shaw - we are just going to haggle over price.   #Idiots #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of those who support the legalization of abortion, and that it is mocking them for not being able to win the debate.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that those who support the legalization of abortion have already lost the debate, and that they are now just trying to negotiate the terms of their defeat. They may also interpret the tweet as implying that those who support the legalization of abortion are foolish and ignorant.",
    "action": "No one has conceded the debate. We are still fighting for the rights of women to make their own decisions about their bodies. #MyBodyMyChoice #AbortionRights"
  },
  {
    "ID": 1233,
    "Target": "Legalization of Abortion",
    "Tweet": "#Florida AttorneyGeneralBondi files appeal after Judge grants ACLU request to temporarily halt new law requiring 24hr wait before #SemST",
    "perception": "The person's perception of this tweet might be that the Attorney General is attempting to restrict access to abortion, which goes against their beliefs. They may also feel frustrated that the ACLU's request to temporarily halt the law was granted.",
    "cognition": "The person's cognition after perceiving the information might be that the Attorney General is trying to limit access to abortion, which is a violation of their beliefs. They may also feel that the law is an unnecessary burden on those seeking abortion services.",
    "action": "It's unacceptable that the Attorney General is trying to restrict access to abortion. We must fight for our right to make our own decisions about our bodies!\" #ProtectAbortionRights #SemST"
  },
  {
    "ID": 813,
    "Target": "Legalization of Abortion",
    "Tweet": "RT alvedaking: The most disturbing thing we to this planet is to flood our streets with the #blood of #children from #HappyEarthD... #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that the legalization of abortion would lead to the death of innocent children.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the legalization of abortion would lead to the death of innocent children, and that this would be a tragedy for the planet.",
    "action": "We must protect the lives of innocent children, not take them away. #ProtectLife #NoAbortion #SemST"
  },
  {
    "ID": 1199,
    "Target": "Legalization of Abortion",
    "Tweet": "All of this has nothing to do w providing medical care - @NARALVirginia on TRAP regulations #scraptrap #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of TRAP regulations and is in support of abortion rights. They would likely agree with the sentiment expressed by NARALVirginia and support the hashtag #scraptrap.",
    "cognition": "The person's cognition after perceiving the information would be that TRAP regulations are an obstacle to providing medical care related to abortion and that NARALVirginia is advocating for their repeal. They would likely agree with this sentiment and support the hashtag #scraptrap.",
    "action": "@NARALVirginia I fully support your stance on TRAP regulations and the hashtag #scraptrap. We must fight for abortion rights and access to medical care!"
  },
  {
    "ID": 725,
    "Target": "Legalization of Abortion",
    "Tweet": "@DWStweets @RepDWStweets is a seven pound baby murderer. Too bad her Mom didn't have the same operation. #Baby #Democrats #Losers #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it is clearly against the legalization of abortion. They may also feel anger towards the person who posted the tweet for their insensitive and offensive language.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and that the person who posted it is against the legalization of abortion. They may also interpret the tweet as an attack on the Democratic party and those who support the legalization of abortion.",
    "action": "@DWStweets @RepDWStweets Abortion is a personal decision and should be respected. #MyBodyMyChoice #ProChoice #AbortionRights"
  },
  {
    "ID": 1164,
    "Target": "Legalization of Abortion",
    "Tweet": "At the Mass. State House again tomorrow for Planned Parenthood's Sexual Health Lobby Day #ReproductiveJustice #Feminism #SemST",
    "perception": "The person's perception of this tweet would be one of support and enthusiasm for the cause of reproductive justice and feminism. They would likely be encouraged by the mention of Planned Parenthood's Sexual Health Lobby Day and the use of hashtags to spread awareness of the issue.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the cause of reproductive justice and feminism, and that Planned Parenthood is taking action to support this cause. They would likely be encouraged by the mention of the lobby day and the use of hashtags to spread awareness of the issue.",
    "action": "I'm so proud to see Planned Parenthood taking action to support reproductive justice and feminism! #ReproductiveJustice #Feminism #SemST"
  },
  {
    "ID": 1036,
    "Target": "Legalization of Abortion",
    "Tweet": "@michaelianblack i don't follow the news, is there a new law that ALL gay people have to get married? I'm against that! #SemST",
    "perception": "The person's perception of the tweet would be that the author is against a law that would require all gay people to get married, and that they are expressing their disapproval of the law.",
    "cognition": "The person's cognition after perceiving the information would be that the author is against a law that would require all gay people to get married, and that they are expressing their disapproval of the law as it would be a violation of the rights of gay people to choose whether or not to get married. They may also interpret the tweet as a sign of support for the LGBTQ+ community and their right to choose.",
    "action": "@michaelianblack I agree with you! Everyone should have the right to choose whether or not to get married, regardless of their sexual orientation. #SemST"
  },
  {
    "ID": 1070,
    "Target": "Legalization of Abortion",
    "Tweet": "Gay Marriage & Murdering the Unborn will always be a SIN in GODS eyes. #ccot #tcot #jesus #bible. #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval and disagreement, as it implies that abortion is a sin in the eyes of God. They may also feel frustrated by the use of hashtags to promote a conservative viewpoint.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting a conservative viewpoint that is against the legalization of abortion. They may also interpret the tweet as an attempt to use religious beliefs to influence public opinion on the issue.",
    "action": "Abortion is a personal decision and should not be dictated by religious beliefs. #prochoice #reproductivefreedom #mybodymychoice"
  },
  {
    "ID": 1051,
    "Target": "Legalization of Abortion",
    "Tweet": "#SoProLife they want to force Texans to carry pregnancies that WON'T EVEN PRODUCE LIFE. #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards those who are against the legalization of abortion. They may also feel a sense of injustice that people are being forced to carry pregnancies that will not result in a live birth.",
    "cognition": "The person's cognition after perceiving the information would be that those who are against the legalization of abortion are not only denying people the right to choose, but are also forcing them to go through a traumatic experience for no reason. They may also feel that this is an example of the unfairness of the current system.",
    "action": "It's outrageous that people are being forced to carry pregnancies that won't even produce life. #AbortionRights #SemST"
  },
  {
    "ID": 1101,
    "Target": "Legalization of Abortion",
    "Tweet": "When Laws are passed by SCOTUS that defy a Gods laws it is always the children who suffer. God bless the children. #promarriage #SemST",
    "perception": "The person's perception of this tweet might be that it is against abortion, as it implies that laws that go against God's laws will cause suffering for children. They may also perceive it as being in favor of marriage, as indicated by the hashtags.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that laws that go against God's laws, such as abortion, will cause suffering for children, and that it is in favor of marriage. They may also interpret it as being against abortion and in favor of traditional marriage.",
    "action": "We must protect the rights of women and children by ensuring access to safe and legal abortion. #prochoice #protectwomen"
  },
  {
    "ID": 1155,
    "Target": "Legalization of Abortion",
    "Tweet": "How can you be \"against abortion\" and also want to take away all the free birth control clinics for the poor? How? #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and confusion, as they cannot understand how someone could be against abortion yet also want to take away free birth control clinics for the poor.",
    "cognition": "The person's cognition after perceiving the information would be that the person who is against abortion is hypocritical, as they are not taking into account the consequences of their actions. They are also not considering the needs of those who are unable to afford birth control.",
    "action": "It's hypocritical to be against abortion and also take away free birth control clinics for the poor. We need to ensure access to affordable birth control for all! #SemST"
  },
  {
    "ID": 893,
    "Target": "Legalization of Abortion",
    "Tweet": "They haven't eliminated #murder. They just call it by a different #name. #prolifeyouth #prolifegen #SemST",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that abortion is a form of murder. They may also perceive the tweet as being anti-choice, as it uses hashtags such as #prolifeyouth and #prolifegen.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is a form of murder and that the person who posted the tweet is against the legalization of abortion. They may also interpret the tweet as being anti-choice, as it uses hashtags such as #prolifeyouth and #prolifegen.",
    "action": "Abortion is a personal decision and should be respected. #prochoice #mybodymychoice #SemST"
  },
  {
    "ID": 1252,
    "Target": "Legalization of Abortion",
    "Tweet": "@notmuchelse And the unborn ARE human lives completely human & alive from conception. Abortion KILLS #SemST",
    "perception": "The person's perception of this tweet would be that it is strongly against the legalization of abortion, as it implies that abortion is the killing of a human life. They may also perceive the sentiment of the tweet to be one of disapproval and disapproval of the act of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is the killing of a human life, and that the person who posted the tweet is strongly against the legalization of abortion. They may also interpret the sentiment of the tweet to be one of disapproval and disapproval of the act of abortion.",
    "action": "@notmuchelse Abortion is a complex issue and should be decided on a case-by-case basis. We should focus on providing support and resources to those who need it, not criminalizing them.\" #SemST"
  }
]