[
  {
    "ID": 181,
    "Target": "Feminist Movement",
    "Tweet": "Just read a rather good article on females and their perceived/imposed limits throughout the education system and the work place #SemST",
    "perception": "The person's perception of the tweet would be one of appreciation and admiration for the article, as well as a sense of solidarity with the feminist movement. They may also feel encouraged by the hashtag, which suggests that the article is part of a larger conversation about gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that the article is discussing the systemic barriers that women face in education and the workplace, and that the hashtag is a sign of support for the feminist movement. They may also recognize the importance of the article in raising awareness of gender inequality and the need for change.",
    "action": "I'm so glad to see this article highlighting the systemic barriers that women face in education and the workplace. #FeministMovement #SemST"
  },
  {
    "ID": 432,
    "Target": "Feminist Movement",
    "Tweet": "Funny how it's not misogyny or objectification when feminists completely erase female agency to make an argument. @IroynA #SemST",
    "perception": "The person's perception of this tweet could be that it is critical of the Feminist Movement, and that it is expressing a negative sentiment towards it.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is criticizing the Feminist Movement for erasing female agency in order to make an argument, and that it is suggesting that this is a form of misogyny or objectification.",
    "action": "We must recognize and respect female agency in order to make meaningful progress in the Feminist Movement. #Feminism #RespectWomen"
  },
  {
    "ID": 429,
    "Target": "Feminist Movement",
    "Tweet": "@PennyRed you realise that you have just painted \"all\" men with the same brush. So \"wilfully ignorant\" could describe you! #fail #SemST",
    "perception": "The person's perception of this tweet could be that it is critical of the Feminist Movement and dismissive of its supporters. They may also perceive it as an attack on their beliefs and values.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is implying that the Feminist Movement is painting all men with the same brush and that its supporters are willfully ignorant. They may also interpret the tweet as an attempt to discredit the movement and its supporters.",
    "action": "@PennyRed Feminism is about equality and respect for all genders, not painting all men with the same brush. #Feminism #Equality"
  },
  {
    "ID": 511,
    "Target": "Feminist Movement",
    "Tweet": "#HowToKeepYourGirlHappy treat her like your partner & not like your superior #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for equal treatment of women in relationships, and that it is promoting a positive sentiment towards the Feminist Movement.",
    "cognition": "The person's cognition of this tweet would be that it is advocating for mutual respect and equality in relationships, and that it is encouraging men to treat their female partners as equals.",
    "action": "Agreed! Equality and respect should be the foundation of any relationship. #FeministMovement #SemST"
  },
  {
    "ID": 392,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS  The evidence of your closeted hate is your refusal to address man-hate in feminism.   #GamerGate #SemST",
    "perception": "The person's initial perception of this tweet would be one of frustration and anger, as it appears to be accusing feminists of harboring hate towards men. They may also feel defensive, as the tweet implies that feminists are not addressing the issue of man-hate.",
    "cognition": "The person's cognition after perceiving the information would be to question the validity of the statement, as well as to consider the implications of the tweet. They may also be motivated to research the hashtag #GamerGate and #SemST to gain a better understanding of the context of the tweet.",
    "action": "Feminism is about equality and respect for all genders. We must work together to end all forms of discrimination and hate. #Feminism #Equality"
  },
  {
    "ID": 226,
    "Target": "Feminist Movement",
    "Tweet": "RT @PatsyMaureen: Females turn into man hating feminists because no man fancy's they're dyke lesbian ass's. #SemST",
    "perception": "The person's initial perception of this tweet would be one of shock and anger, as it is clearly derogatory and offensive towards feminists. They may also feel a sense of disbelief that someone would be so openly hostile towards a movement that they support.",
    "cognition": "The person's cognition after perceiving the information would be to recognize the tweet as an example of sexism and misogyny. They would also recognize the tweet as an example of how some people view feminists in a negative light, and how this can lead to further discrimination and marginalization of women.",
    "action": "This kind of language is unacceptable and perpetuates harmful stereotypes about feminists. We must work together to create a more inclusive and respectful society for all.\" #FeministMovement #RespectWomen"
  },
  {
    "ID": 162,
    "Target": "Feminist Movement",
    "Tweet": "How can you be female and not be a feminist? Like do you not care about your rights as a women or what? #SemST",
    "perception": "The person's perception of this tweet would be one of surprise and confusion, as they are likely to be taken aback by the suggestion that someone could be female and not support the feminist movement. They may also feel a sense of indignation at the implication that someone who does not support the feminist movement does not care about their rights as a woman.",
    "cognition": "The person's cognition after perceiving the information would be to question why someone would not support the feminist movement, and to consider the implications of not supporting the feminist movement for women's rights. They may also feel a sense of urgency to spread awareness of the importance of the feminist movement.",
    "action": "Feminism is about fighting for gender equality and protecting the rights of all women. We must continue to support the feminist movement! #FeminismMatters"
  },
  {
    "ID": 318,
    "Target": "Feminist Movement",
    "Tweet": "I'm glad I was able to raise my kids n a time when my educated mothering decisions for my family were not vilified. #nonvaxxerhere #SemST",
    "perception": "The person's perception of this tweet is likely one of appreciation and support for the non-vaccination movement, as well as a sense of pride in being able to make educated decisions for their family without being vilified.",
    "cognition": "The person's cognition after perceiving the information is likely that the non-vaccination movement is a valid choice for families, and that it should not be vilified or judged. They may also recognize that this is an issue of personal autonomy and choice, and that it is important to respect the decisions of others.",
    "action": "I'm so glad to see that you are standing up for your right to make educated decisions for your family. #FeministMovement #RespectChoice"
  },
  {
    "ID": 91,
    "Target": "Feminist Movement",
    "Tweet": ".@feminismvibes Men don't admit to being raped as readily as women do. So your question is feminist bullshit. #SemST",
    "perception": "The person's perception of the tweet might be that it is critical of the feminist movement and its questioning of gender roles. They may also perceive a negative sentiment towards the movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the feminist movement is not taking into account the fact that men are less likely to report being raped than women. They may also interpret the tweet as suggesting that the feminist movement is not taking into account the experiences of men.",
    "action": "@feminismvibes We need to recognize that men are less likely to report being raped and that their experiences should be taken into account. #SemST"
  },
  {
    "ID": 238,
    "Target": "Feminist Movement",
    "Tweet": "Time to go hashtag crazy, then... #Folklore #UKTourism #Britain #Storytelling #Myth #Legend #Equality #Multicultural #Folk #SemST",
    "perception": "The person's perception of this tweet would be that it is promoting equality and multiculturalism, likely through storytelling and folklore. They may also perceive it as a call to action to support the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the Feminist Movement by highlighting the importance of storytelling, folklore, and multiculturalism. They may also interpret the tweet as a call to action to support the Feminist Movement and its goals of equality.",
    "action": "I'm in! Let's support the Feminist Movement and its goals of equality. #Feminism #Equality #Multicultural #Folk #SemST"
  },
  {
    "ID": 533,
    "Target": "Feminist Movement",
    "Tweet": "The basic principle of the universe is INFORMATION. Literally everything is information in one form or another. #antifeminism #SemST",
    "perception": "The person's initial perception of the tweet might be one of confusion and frustration, as the tweet appears to be advocating against the Feminist Movement. They may also feel a sense of disbelief that someone would be so openly opposed to the cause.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for a different type of feminism, one that is based on the idea that information is the basis of the universe. They may also interpret the tweet as a criticism of traditional feminist ideologies.",
    "action": "Feminism is about more than just information - it's about equality, justice, and respect for all genders. #feminism #SemST"
  },
  {
    "ID": 40,
    "Target": "Feminist Movement",
    "Tweet": "Anyone find it funny that #Feminists use #TakeitLikeAMan when they don't want to understand what it means to be one?  #SemST",
    "perception": "The person's perception of this tweet is likely to be one of confusion and frustration, as the hashtag implies that feminists do not understand what it means to be a man. They may also feel that the tweet is mocking the feminist movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is making a joke at the expense of feminists, and that it is implying that feminists do not understand what it means to be a man. They may also feel that the tweet is belittling the feminist movement.",
    "action": "It's not funny to mock the feminist movement. #FeminismIsForEveryone #RespectWomen"
  },
  {
    "ID": 55,
    "Target": "Feminist Movement",
    "Tweet": "If you wanna stay home and raise a family, that's cool. But that's your choice and nobody else's. #SemST",
    "perception": "The person's perception of this tweet would be that it is supportive of the Feminist Movement, as it promotes the idea of choice and autonomy for women. They may also perceive it as a positive message that encourages women to make their own decisions about their lives.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for women's rights and autonomy, and that it is encouraging women to make their own decisions about their lives without judgement or interference from others. They may also recognize that the hashtag #SemST is related to the Feminist Movement.",
    "action": "Thank you for supporting the Feminist Movement and for recognizing the importance of choice and autonomy for women! #Feminism #SemST"
  },
  {
    "ID": 411,
    "Target": "Feminist Movement",
    "Tweet": "@CosmopolitanUK why does someone not create a female festival celebrating women?! Surely it's a no brainer! #art #music #history #SemST",
    "perception": "The person's perception of this tweet would be one of enthusiasm and support for the idea of creating a female festival to celebrate women. They would likely view the tweet as a positive call to action to create a space to celebrate and honor women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for a female-focused festival that celebrates women in art, music, and history. They would likely interpret the tweet as a call to create a space to recognize and honor the accomplishments of women in these fields.",
    "action": "@CosmopolitanUK Count me in! Let's make this happen! #FeministMovement #WomenEmpowerment"
  },
  {
    "ID": 629,
    "Target": "Feminist Movement",
    "Tweet": "@jaclynf, @JessicaValenti, @AmandaMarcotte and @PennyRed are why feminists don't live on the same planet as us. #SemST",
    "perception": "The person's perception of this tweet would be one of surprise and disappointment, as it implies that feminists are not part of the same world as the person tweeting.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing a negative sentiment towards feminists and their beliefs. They may also interpret the tweet as implying that feminists are not part of the same world as the person tweeting.",
    "action": "@jaclynf, @JessicaValenti, @AmandaMarcotte and @PennyRed are an integral part of our world and should be respected. #FeministPower"
  },
  {
    "ID": 191,
    "Target": "Feminist Movement",
    "Tweet": "@Mike_Charmander @MsLatina a right doesn't have to come from a law. They're called equal rights not equal laws #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it speaks of equal rights regardless of laws. They may also perceive a sentiment of empowerment and strength in the hashtag #SemST.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for equal rights for all genders, regardless of laws. They may also interpret the hashtag #SemST to mean that the speaker is standing up for their rights and is determined to fight for equality.",
    "action": "@Mike_Charmander @MsLatina Absolutely! We must continue to fight for equal rights for all genders #FeministMovement #SemST"
  },
  {
    "ID": 164,
    "Target": "Feminist Movement",
    "Tweet": "RT @WeNeedFeminism: 'BAD BITCH' is not a compliment #SemST",
    "perception": "The person's perception of the tweet would be that it is a strong statement against the objectification of women and a call to end the use of derogatory language. They would also likely recognize the hashtag as a sign of solidarity with the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for respect and equality for women, and that the use of language that objectifies women should not be tolerated. They would also likely recognize the hashtag as a sign of solidarity with the feminist movement.",
    "action": "Agreed! We need to end the use of language that objectifies women and promote respect and equality for all genders #WeNeedFeminism"
  },
  {
    "ID": 448,
    "Target": "Feminist Movement",
    "Tweet": "Just heard the most inspiring interview w one of my heroines @monaeltahawy on @bbcworldservice #women #islam  #revolution #SemST",
    "perception": "The person's perception of this tweet would be one of admiration and inspiration, as it celebrates a heroine and references a revolution for women and Islam.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is celebrating a heroine who is advocating for women's rights and equality in the Islamic world. They would also recognize that the hashtag #revolution implies a call to action for furthering the feminist movement.",
    "action": "I'm so inspired by @monaeltahawy and her work for women's rights and equality in the Islamic world! #FeministMovement #Women #Islam #Revolution #SemST"
  },
  {
    "ID": 96,
    "Target": "Feminist Movement",
    "Tweet": "@rsiereilly I've been pretty well. Enjoyed your response to #SemST",
    "perception": "The person's perception of the tweet would be that it is a positive and supportive message, likely in response to the Feminist Movement. They may also perceive that the tweet is from someone who is supportive of the movement and is engaging in a meaningful conversation.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a positive and supportive message, likely in response to the Feminist Movement. They may also interpret that the tweet is from someone who is engaging in a meaningful conversation and is supportive of the movement.",
    "action": "@rsiereilly Thanks for your support of the #FeministMovement! It's great to see people engaging in meaningful conversations about this important issue."
  },
  {
    "ID": 508,
    "Target": "Feminist Movement",
    "Tweet": "@deanesmay The Command-and-control mentality runs deep with #feminists. The Swedish Feminist Initiative is open with it #SemST",
    "perception": "The person's initial perception of the tweet might be that it is critical of the feminist movement and its tactics, and that it is suggesting that the Swedish Feminist Initiative is particularly open to this type of mentality.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the feminist movement is too focused on command-and-control tactics, and that the Swedish Feminist Initiative is particularly open to this type of mentality. They might also infer that the tweet is suggesting that this type of mentality is not beneficial for the feminist movement.",
    "action": "#Feminists are working hard to create a better world for everyone. We should focus on collaboration and cooperation, not command-and-control tactics. #SemST"
  },
  {
    "ID": 500,
    "Target": "Feminist Movement",
    "Tweet": "@LaNaria_Athalia Are you using women as sex objects to sell your sexist hate movement, yes you are. #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it appears to be criticizing the Feminist Movement in a negative light. They may also feel offended by the suggestion that the movement is sexist and hateful.",
    "cognition": "The person's cognition after perceiving the information would be to try to understand the context of the tweet and the intent of the person who wrote it. They may also try to determine if the tweet is accurate and if it is representative of the Feminist Movement as a whole.",
    "action": "@LaNaria_Athalia We don't use women as sex objects to sell our movement. We stand for equality and respect for all genders. #FeministMovement"
  },
  {
    "ID": 626,
    "Target": "Feminist Movement",
    "Tweet": "#LikeAFeminist I think any woman who doesn't identify as a feminist has \"internalised misogyny #SemST",
    "perception": "The person's perception of this tweet would be that it is supportive of the Feminist Movement and is critical of those who do not identify as feminists, suggesting that they have internalised misogyny.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is suggesting that those who do not identify as feminists have internalised the oppressive and patriarchal values of society, and that the Feminist Movement is a way to combat this. They may also interpret the tweet as a call to action to support the Feminist Movement and to challenge oppressive values.",
    "action": "#YesToFeminism! We must challenge oppressive values and support the Feminist Movement to create a more equitable society for all. #SemST"
  },
  {
    "ID": 386,
    "Target": "Feminist Movement",
    "Tweet": "I do not wish for #Women to have power over #Men but over themselves. #Milan #KnockKnock #PAK_Army #PTIFamily #SemST",
    "perception": "The person's perception of the tweet is likely to be positive, as it promotes the idea of women having power over themselves rather than over men. They may also be encouraged by the hashtag use, which suggests that the tweet is part of a larger movement.",
    "cognition": "The person's cognition of the tweet is likely to be that it is advocating for women's empowerment and autonomy. They may also interpret the hashtag use as a sign of solidarity with other feminists and a commitment to the feminist movement.",
    "action": "I'm so glad to see this message of empowerment and solidarity! #FeministMovement #WomenEmpowerment #WomenRights"
  },
  {
    "ID": 321,
    "Target": "Feminist Movement",
    "Tweet": "The meaning of peace is the absence of opposition to socialism. #GamerGate #SemST",
    "perception": "The person's initial perception of the tweet would be one of confusion and frustration, as the tweet appears to be equating peace with socialism and using the hashtag #GamerGate, which is associated with anti-feminist sentiment.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to link the idea of peace with socialism, and that the hashtag #GamerGate is being used to spread anti-feminist sentiment. They may also interpret the tweet as an attempt to discredit the Feminist Movement.",
    "action": "Peace is not synonymous with socialism. #Feminism #Equality"
  },
  {
    "ID": 129,
    "Target": "Feminist Movement",
    "Tweet": "people actually brag about how dank their shatter wax shit is on instagram pls kill me #lol #dabs #wax #420 #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and disbelief, as it appears to be celebrating a substance that is not in line with the values of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting the use of a substance that is not in line with the values of the Feminist Movement, and that the person finds this behavior to be unacceptable.",
    "action": "Substance use is not something to be celebrated. Let's focus on creating a more equitable society instead #FeministMovement"
  }
]