[
  {
    "ID": 663,
    "Target": "Feminist Movement",
    "Tweet": "It's hard being a woman, constantly annoyed by things that don't really matter on the grand scheme of things. Wish I was a man #SemST",
    "perception": "The person's perception of this tweet is likely to be one of understanding and empathy, recognizing the struggles of being a woman in a patriarchal society. They may also feel a sense of solidarity with the person who posted the tweet, as they share the same sentiment of wishing they were a man.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is highlighting the difficulties of being a woman in a patriarchal society, and that the person who posted the tweet is expressing a desire to be a man in order to escape these difficulties. They may also recognize the need for greater gender equality and the importance of the Feminist Movement.",
    "action": "We hear you! We stand with you in the fight for gender equality. #FeministMovement"
  },
  {
    "ID": 483,
    "Target": "Feminist Movement",
    "Tweet": "Feminism then: Fight for women's rights  Feminism now: Find the most petty first world problem to whine about.  #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger, as it implies that the Feminist Movement has become trivialized and reduced to complaining about minor issues.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is dismissive of the Feminist Movement and its goals, and that it is perpetuating a negative stereotype of feminists as people who complain about minor issues.",
    "action": "Feminism is about fighting for equality and justice, not finding petty problems to complain about. #FeminismMatters"
  },
  {
    "ID": 242,
    "Target": "Feminist Movement",
    "Tweet": "Feminism is not just about women; it's about letting all people lead fuller lives ~ @JaneFonda #life #SemST",
    "perception": "The person's perception of the tweet would be one of positivity and support for the Feminist Movement. They would likely appreciate the sentiment that feminism is about allowing everyone to lead fuller lives.",
    "cognition": "The person's cognition after perceiving the information would be that feminism is a movement that is beneficial to all genders, not just women. They would also likely appreciate the idea that feminism is about allowing everyone to lead more fulfilling lives.",
    "action": "Thank you @JaneFonda for your inspiring words! #Feminism #EqualityForAll"
  },
  {
    "ID": 315,
    "Target": "Feminist Movement",
    "Tweet": "Hate when girls turn into bitches because a guy tells them they look good without make up... THATS A COMPLIMENT ?!!??!???? #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be criticizing girls for responding positively to a compliment.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing girls for responding positively to a compliment, and that this is an example of how society often shames women for embracing their own beauty.",
    "action": "Compliments should be celebrated, not shamed! #FeministMovement"
  },
  {
    "ID": 136,
    "Target": "Feminist Movement",
    "Tweet": "@EverydaySexism .@Rod_McCallum you are a dinosaur and a fool.  Not rising to your antiquated rhetoric.  Bye #SemST",
    "perception": "The person's perception of this tweet would be that it is expressing a strong sentiment of disapproval towards Rod McCallum, and is advocating for the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing Rod McCallum for his outdated views on gender equality, and is advocating for the Feminist Movement. The hashtag #SemST implies that the tweet is in support of the Semantic Structural Theory, which is a theory of gender equality.",
    "action": "@EverydaySexism We stand with you in support of the Feminist Movement and the Semantic Structural Theory! #Feminism #SemST"
  },
  {
    "ID": 596,
    "Target": "Feminist Movement",
    "Tweet": "@TarheelKrystle @primatemachine Bowing down but not in a threatening way. B/c even bowing down can be triggering. #SemST",
    "perception": "The person's perception of the tweet is likely to be one of support for the Feminist Movement, as it acknowledges the potential for bowing down to be triggering. They may also perceive the tweet as a reminder to be mindful of the potential for certain actions to be triggering.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for respectful behavior towards those who identify as feminists, and that it is important to be aware of the potential for certain actions to be triggering.",
    "action": "Thank you for this reminder! We must always be mindful of the potential for certain actions to be triggering. #FeministMovement"
  },
  {
    "ID": 304,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS  The problem with abortion is not \" too many rapes\" it is too much fucking WITHOUT condoms   #GamerGate #SemST",
    "perception": "The person's initial perception of this tweet would be one of anger and frustration, as it appears to be criticizing feminists for not addressing the issue of unprotected sex. They may also feel that the tweet is attempting to discredit the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to draw attention to the issue of unprotected sex, and that the feminist movement should be addressing this issue in addition to other issues such as rape. They may also feel that the tweet is attempting to discredit the feminist movement by implying that they are not doing enough to address this issue.",
    "action": "Unprotected sex is a serious issue that needs to be addressed, but it should not be used to discredit the feminist movement. #Feminism #SemST #GamerGate"
  },
  {
    "ID": 169,
    "Target": "Feminist Movement",
    "Tweet": ".@TheActualSarah The UK is considering abolishing prisons for women completely because crime is a man's fault. #SemST",
    "perception": "The person's perception of the tweet would be one of support for the idea that crime is a man's fault and that the UK is considering abolishing prisons for women. They may also feel encouraged by the hashtag #SemST, which could indicate that the tweet is part of a larger feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the UK is taking a progressive step towards gender equality by recognizing that crime is a man's fault and considering abolishing prisons for women. They may also feel that the hashtag #SemST is a sign of solidarity with the feminist movement and that the tweet is part of a larger effort to promote gender equality.",
    "action": "This is a great step towards gender equality! #SemST #FeministMovement"
  },
  {
    "ID": 395,
    "Target": "Feminist Movement",
    "Tweet": "The responsibilities Feminism admits are as ornamental as the intelligence of the average feminist. #OnlyRights #SemST",
    "perception": "The person's initial perception of the tweet might be one of anger and frustration, as it appears to be mocking the Feminist Movement and its supporters. They may also feel that the tweet is dismissive of the important work that feminists do.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is attempting to discredit the Feminist Movement by implying that feminists are not intelligent and that their efforts are not meaningful. They may also feel that the tweet is attempting to undermine the importance of the rights that feminists are fighting for.",
    "action": "Feminism is about more than just rights - it's about creating a world where everyone is respected and valued. #FeminismMatters #SemST"
  },
  {
    "ID": 631,
    "Target": "Feminist Movement",
    "Tweet": "Why is it bad for the Garrick Club to be men only but not bad for my gym to have a women only room? #Hypocrites #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger towards the double standard of gender-exclusive spaces. They may also feel that the tweet is highlighting the hypocrisy of the Garrick Club's policy.",
    "cognition": "The person's cognition after perceiving the information would be that the Garrick Club's policy is unfair and discriminatory, and that it is hypocritical for them to allow men-only spaces while not allowing women-only spaces. They may also feel that this is an example of gender inequality that needs to be addressed.",
    "action": "It's unacceptable that the Garrick Club has a men-only policy while not allowing women-only spaces. We need to fight for gender equality and end this double standard!\" #Feminism #Equality"
  },
  {
    "ID": 176,
    "Target": "Feminist Movement",
    "Tweet": ".@brigadam @KlaraJoelsson Abortion is NOT suffering to women - why do you think it is? Do you hate abortion, feminist? #SemST",
    "perception": "The person's perception of the tweet would be that the author is expressing disbelief that abortion is seen as suffering to women and is questioning the motives of those who think so, potentially implying that they are anti-feminist.",
    "cognition": "The person's cognition after perceiving the information would be that the author is challenging the idea that abortion is a form of suffering for women and is questioning the motives of those who think so, potentially implying that they are anti-feminist. They may also be suggesting that the anti-abortion stance is not in line with feminist values.",
    "action": "No, abortion is not suffering to women! We must stand together to protect women's rights and fight for reproductive justice. #Feminist #SemST"
  },
  {
    "ID": 625,
    "Target": "Feminist Movement",
    "Tweet": "Patriarchy Theory - designed to project the prejudice and insecurity of feminists onto men #SemST",
    "perception": "The person's initial perception of the tweet would be one of confusion and frustration, as the tweet appears to be critical of the Feminist Movement. They may also feel a sense of disbelief that someone would be so dismissive of the movement's goals.",
    "cognition": "The person's cognition after perceiving the information would be to question the validity of the tweet, as it appears to be dismissive of the Feminist Movement. They may also feel a sense of anger and disbelief that someone would be so critical of the movement's goals.",
    "action": "Feminism is about equality and justice for all genders, not about projecting prejudice and insecurity onto men. #FeminismMatters"
  },
  {
    "ID": 3,
    "Target": "Feminist Movement",
    "Tweet": "Stupid Feminists, the civilization you take for granted was built with the labour, blood sweat and tears of men. #SemST",
    "perception": "The person's perception of the tweet could be one of anger and frustration towards the speaker, as the tweet implies that feminists are ungrateful for the work of men. They may also feel that the speaker is attempting to discredit the feminist movement.",
    "cognition": "The person's cognition after perceiving the information could be that the speaker is attempting to discredit the feminist movement by implying that feminists are ungrateful for the work of men. They may also feel that the speaker is attempting to downplay the importance of the feminist movement and its contributions to society.",
    "action": "Feminists have been integral to the progress of civilization and have made countless contributions to society. #FeminismMatters"
  },
  {
    "ID": 151,
    "Target": "Feminist Movement",
    "Tweet": "This feminist supports gender equality because some people believe a woman's value lies in her physical beauty. #SemST",
    "perception": "The person's perception of this tweet is likely to be one of agreement and support for the feminist movement, as it promotes the idea that a woman's value should not be based on her physical beauty.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for gender equality and that physical beauty should not be the basis for a woman's value. They may also recognize the hashtag as a sign of solidarity with the feminist movement.",
    "action": "I fully support this message! #Feminism #GenderEquality"
  },
  {
    "ID": 192,
    "Target": "Feminist Movement",
    "Tweet": "Today we watch the United States Supreme Court. #SemST",
    "perception": "The person's perception of this tweet would be one of support for the Feminist Movement, as the hashtag #SemST implies a connection to the movement. They may also feel encouraged by the mention of the Supreme Court, as it suggests progress is being made.",
    "cognition": "The person's cognition after perceiving the information would be that the Supreme Court is taking action to support the Feminist Movement, and that progress is being made in the fight for gender equality.",
    "action": "We are watching and supporting the Supreme Court as they take action for the Feminist Movement! #SemST #FeministMovement"
  },
  {
    "ID": 58,
    "Target": "Feminist Movement",
    "Tweet": "@BruiseAurora i'm advocating men to stop loving women. Just have sex with them . #everydaysexism #SemST",
    "perception": "The person's initial perception of the tweet would be one of shock and disbelief, as it appears to be advocating for a disrespectful and objectifying attitude towards women. They may also feel anger and frustration at the perpetuation of sexism and gender inequality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting a dangerous and damaging attitude towards women, and that it is perpetuating sexism and gender inequality. They may also recognize that the hashtag is being used to draw attention to the issue of everyday sexism and the need for gender equality.",
    "action": "@BruiseAurora This kind of attitude towards women is unacceptable and damaging. We must work together to end sexism and gender inequality #everydaysexism #SemST"
  },
  {
    "ID": 337,
    "Target": "Feminist Movement",
    "Tweet": "After a gr8 day for US equality, I think of the girls who pose with @DanBilzerian; setting female equality back 40yr #gaymarriage #SemST",
    "perception": "The person's perception of this tweet is likely to be one of disappointment and frustration, as it highlights the negative impact of objectifying women on the progress of the feminist movement. They may also feel a sense of hope, however, as the tweet also mentions the progress of the gay marriage movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that objectifying women is a major obstacle to achieving gender equality, and that progress in other areas of the feminist movement should not be taken for granted.",
    "action": "We must continue to fight for gender equality and not let objectification of women set us back. #Feminism #Equality"
  },
  {
    "ID": 566,
    "Target": "Feminist Movement",
    "Tweet": "DEAR FEMINISTS  Start asking for accountability from man-haters instead of shielding them for convenient concealment.  #SemST",
    "perception": "The person's initial perception of the tweet might be one of confusion and frustration, as it appears to be critical of the Feminist Movement. They may also feel a sense of anger towards the person who posted the tweet.",
    "cognition": "After perceiving the information, the person may interpret the tweet as a call for feminists to hold other feminists accountable for their actions, rather than blindly supporting them. They may also view the tweet as a reminder to be mindful of the language used when discussing gender issues, and to be respectful of all genders.",
    "action": "We should all strive to be accountable and respectful when discussing gender issues. Let's work together to create a more inclusive and equitable society! #Feminism"
  },
  {
    "ID": 165,
    "Target": "Feminist Movement",
    "Tweet": ".@cooImemegirl @TC_Stompa Women don't understand men's plight and so shouldn't force men into fatherhood w/o consent. #SemST",
    "perception": "The person's perception of this tweet would be that it is critical of the feminist movement, suggesting that women do not understand men's struggles and should not force men into fatherhood without their consent.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the feminist movement is not taking into account the struggles of men, and is not respecting their right to choose whether or not to become fathers. Furthermore, the tweet implies that the feminist movement is not considering the implications of forcing men into fatherhood without their consent.",
    "action": "@cooImemegirl @TC_Stompa We must recognize the struggles of both men and women and respect the right of men to choose fatherhood. #FeministMovement"
  },
  {
    "ID": 325,
    "Target": "Feminist Movement",
    "Tweet": "@Ricky_Vaughn99  Why is it called HIStory and not HERstory ?!   #SemST",
    "perception": "The person's perception of this tweet would be one of agreement and support for the feminist movement, as it is questioning the lack of recognition of women's history. They may also feel a sense of indignation at the lack of recognition of women's contributions to history.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the lack of recognition of women's contributions to history, and that this is an issue that needs to be addressed. They may also recognize that the hashtag #SemST is being used to draw attention to this issue and to encourage people to take action.",
    "action": "@Ricky_Vaughn99 We need to recognize the contributions of women to history and make sure their stories are heard! #SemST #FeministMovement"
  },
  {
    "ID": 247,
    "Target": "Feminist Movement",
    "Tweet": "@whenindoubtdo the trigger levels are over 9000 #SemST",
    "perception": "The person's initial perception of the tweet might be that it is a humorous comment about the intensity of the Feminist Movement. They may also perceive the sentiment of the tweet to be positive and supportive of the movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is referring to the high levels of energy and enthusiasm of the Feminist Movement, and that the hashtag is a reference to the Semantic Scholar Twitter account.",
    "action": "@whenindoubtdo You're right! The Feminist Movement is strong and growing every day! #FeministPower #SemST"
  },
  {
    "ID": 142,
    "Target": "Feminist Movement",
    "Tweet": "They want equality but what they're doing is overpowering men. #feminazi #SemST",
    "perception": "The person's perception of the tweet might be one of frustration and anger, as it implies that feminists are unfairly overpowering men. They may also feel that the hashtag is derogatory and offensive.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that feminists are unfairly overpowering men, and that the hashtag is derogatory and offensive. They may also feel that the tweet is attempting to discredit the feminist movement by associating it with a negative term.",
    "action": "Feminism is about equality, not overpowering men. Let's focus on the real issues and not resort to name-calling. #Feminism #Equality"
  },
  {
    "ID": 240,
    "Target": "Feminist Movement",
    "Tweet": "M: FEMINISTS NEED TO GROWA SENSE OF HUMOR W: Okay. (sips from \"Male Tears\" mug) M: AAIGH!  MISANDREEEEEEEEEEE  #YesAllWomen #SemST",
    "perception": "The person's perception of the tweet would be that it is mocking the idea of feminism and is making light of the struggles of women. They may also perceive it as being hostile and dismissive of the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is mocking the feminist movement and is dismissive of the struggles of women. They may also interpret it as being hostile and belittling towards the feminist movement.",
    "action": "Feminism is about equality and respect for all genders. Dismissing the struggles of women is not a joke. #YesAllWomen #SemST"
  },
  {
    "ID": 14,
    "Target": "Feminist Movement",
    "Tweet": "Women don't make 75% less than men for the same job. Women, on average, make less then men. Look it up feminazis. #EqualPayDay #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration. They may feel that the tweet is dismissive of the feminist movement and its goals of achieving equal pay for women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the feminist movement by suggesting that women don't make 75% less than men for the same job, and that the movement is exaggerating the wage gap. They may also feel that the tweet is attempting to delegitimize the movement by using the term \"feminazis\".",
    "action": "Women still make less than men for the same job, and the wage gap is still a real issue. #EqualPayDay #SemST #FeministMovement"
  },
  {
    "ID": 305,
    "Target": "Feminist Movement",
    "Tweet": "Multiple abortions means Feminists are not using the contraceptives THEY THEMSELVES demanded.  #GamerGate #SemST",
    "perception": "The person's perception of the tweet would be one of confusion and frustration, as it appears to be making a negative statement about the Feminist Movement. They may also feel a sense of anger towards the person who posted the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists are not taking responsibility for their own demands for contraceptives, and that this is somehow related to the GamerGate and SemST movements. They may also feel that the tweet is attempting to discredit the Feminist Movement.",
    "action": "Feminists are fighting for access to contraceptives and other reproductive rights. This tweet is an attempt to discredit their efforts. #Feminism #ReproductiveRights"
  }
]