[
  {
    "ID": 762,
    "Target": "Legalization of Abortion",
    "Tweet": "@GolfProYYC every time @TaylorMadeGolf pops up I think its you posting. #dyslexic #oneinthesame  #SemST",
    "perception": "The person's perception of this tweet might be that it is a humorous post about someone with dyslexia, and that the person is making light of the situation. They may also perceive the tweet as being supportive of those with dyslexia.",
    "cognition": "The person's cognition of this tweet might be that it is a humorous way of highlighting the similarities between the two names, and that it is a supportive message for those with dyslexia. They may also recognize the hashtag as a way of raising awareness about the condition.",
    "action": "@GolfProYYC Thanks for the supportive message! #SemST #DyslexiaAwareness"
  },
  {
    "ID": 1011,
    "Target": "Legalization of Abortion",
    "Tweet": "@ErikLoomis You're a historian? Of what , malice? Your hatred of her child is astonishing. #palin #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it appears to be criticizing someone for their stance on abortion. They may also feel a sense of anger towards the person who wrote the tweet.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on someone's stance on abortion, and to understand that the tweet is implying that the person being criticized has a malicious attitude towards unborn children.",
    "action": "@ErikLoomis Your views on abortion should be respected, regardless of your opinion. #prochoice #respect"
  },
  {
    "ID": 1260,
    "Target": "Legalization of Abortion",
    "Tweet": "If your agonist abortion get a vasectomy  #SemST",
    "perception": "The person's perception of this tweet might be that it is making a joke about abortion, suggesting that those who are in favor of it should get a vasectomy instead. They may also perceive it as having a negative sentiment towards abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is making a joke about abortion, implying that those who are in favor of it should get a vasectomy instead. They may also interpret the tweet as having a negative attitude towards abortion.",
    "action": "Abortion is a personal decision and should be respected. #SemST"
  },
  {
    "ID": 705,
    "Target": "Legalization of Abortion",
    "Tweet": "RT @pari_passu: Dear Religious Right: I keep my uterus out of your church, so keep your church out my uterus. #SemST",
    "perception": "The person's perception of this tweet would be one of support for the legalization of abortion, as well as a strong stance against the religious right's interference in the matter. They may also perceive a sense of defiance and empowerment in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to make decisions about one's own body without interference from religious institutions. They may also interpret the tweet as a call to action to stand up for reproductive rights and to fight against the religious right's attempts to control women's bodies.",
    "action": "Amen! We must stand together and fight for our right to make decisions about our own bodies. #ReproductiveRights #SemST"
  },
  {
    "ID": 1209,
    "Target": "Legalization of Abortion",
    "Tweet": "If men could get pregnant, abortion clinics would be like Starbucks #SemST",
    "perception": "The person's perception of this tweet would be that it is making a humorous statement about the current state of abortion access, implying that if men could get pregnant, abortion clinics would be more widely available and accessible. They may also perceive the tweet as being in support of the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a statement about the current lack of access to abortion services, and that it is advocating for the legalization of abortion. They may also recognize the humor in the tweet and understand the implications of the hashtag.",
    "action": "I agree! Abortion should be accessible and legal for everyone, regardless of gender #SemST"
  },
  {
    "ID": 1028,
    "Target": "Legalization of Abortion",
    "Tweet": "@BarackObama celebrates \"equality\" while 3000 unborn babies were killed today. Let's talk about a real inequality sir #LifeEquality #SemST",
    "perception": "The person's perception of this tweet would be one of shock and disbelief, as it appears to be criticizing the legalization of abortion. They may also feel a sense of anger towards the tweet's author for their stance on the issue.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on the legalization of abortion, and to view the author as someone who is against the right to choose. They may also feel a sense of injustice towards the unborn babies mentioned in the tweet.",
    "action": "@BarackObama, abortion is a fundamental right and should be respected. We must protect the rights of women to make their own decisions #MyBodyMyChoice #SemST"
  },
  {
    "ID": 749,
    "Target": "Legalization of Abortion",
    "Tweet": "@explicit0ceans But adoption chooses to let them live. Obviously a huge difference. You can see that, right?  #Adoption #SemST",
    "perception": "The person's perception of this tweet might be that it is advocating for adoption as an alternative to abortion, and that it is expressing a positive sentiment towards adoption.",
    "cognition": "The person's cognition of this tweet might be that adoption is a viable alternative to abortion, and that it is a more humane choice than abortion.",
    "action": "@explicit0ceans I agree that adoption is a more humane choice than abortion, and it is a viable alternative. #Adoption #SemST"
  },
  {
    "ID": 1127,
    "Target": "Legalization of Abortion",
    "Tweet": "@LifeNewsHQ I would consider this, to be dispersal of a chemical weapon, one that kills children. #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it implies that abortion is akin to a chemical weapon that kills children. They may also feel that the hashtag is an attempt to spread misinformation about the issue of abortion.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to spread false information about abortion, and that it is an attempt to demonize the practice. They may also feel that the tweet is an attempt to manipulate public opinion on the issue.",
    "action": "@LifeNewsHQ Your tweet is an attempt to spread false information and manipulate public opinion on the issue of abortion. #FactsNotFear"
  },
  {
    "ID": 1030,
    "Target": "Legalization of Abortion",
    "Tweet": "Now that the govt and The Supremes have saved the gays, maybe they will save the babies next. #SemST",
    "perception": "The person's perception of this tweet might be one of frustration and disappointment, as it implies that the government and Supreme Court have prioritized the rights of the LGBTQ+ community over the rights of unborn babies.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the government and Supreme Court are not prioritizing the rights of unborn babies, and that the person disagrees with this sentiment. They may also feel that the tweet is implying that the rights of the LGBTQ+ community are more important than the rights of unborn babies.",
    "action": "No one should be denied basic human rights. We must protect the rights of all, including the unborn. #ProtectTheUnborn"
  },
  {
    "ID": 799,
    "Target": "Legalization of Abortion",
    "Tweet": "@AnneJp1946 I have no problem with birth control but their you go with that free thing again. So your solution is murder good idea #SemST",
    "perception": "The person's perception of this tweet would be that the author is against abortion and is expressing a negative sentiment towards it. They may also perceive the author as being against the idea of free birth control.",
    "cognition": "The person's cognition after perceiving the information would be that the author is against abortion and is implying that it is a form of murder. They may also interpret the tweet as being against the idea of free birth control.",
    "action": "@AnneJp1946 Abortion is a personal decision and should not be judged. Everyone should have access to safe and affordable reproductive health care #SemST"
  },
  {
    "ID": 939,
    "Target": "Legalization of Abortion",
    "Tweet": "@CandiesOrg Oops she did it again Bristol is PREGNANT. Candies is a waste.  U paid her 400,000 for WHAT? PPL Send ur $ to #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval and criticism of the decision to pay a large sum of money to someone who has become pregnant. They may also feel that the money could have been better spent elsewhere.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing the decision to pay a large sum of money to someone who has become pregnant, and that this money could have been better spent elsewhere. They may also view this as an example of why abortion should be legalized, as it would prevent situations like this from occurring.",
    "action": "Legalizing abortion would help prevent situations like this from happening. #LegalizeAbortion #SemST"
  },
  {
    "ID": 947,
    "Target": "Legalization of Abortion",
    "Tweet": "Messed up: Being outraged that it's legal to distribute images of abortion, but being fine with abortion being legal. #No2Trudeau #SemST",
    "perception": "The person's perception of the tweet might be one of confusion and disagreement, as it appears to be criticizing the legality of abortion while also being outraged about the distribution of images related to it.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that it is wrong to be outraged about the distribution of images related to abortion, while still being okay with the legality of abortion itself. They may also interpret the tweet as being critical of the Trudeau government for allowing abortion to be legal.",
    "action": "Abortion should be legal, but it's wrong to distribute images of it. We should be outraged about both. #Yes2Abortion #SemST"
  },
  {
    "ID": 1174,
    "Target": "Legalization of Abortion",
    "Tweet": "During an abortion, something alive must become dead to be considered a successful abortion...  #p2 #tcot #ChooseLife #Choice #SemST",
    "perception": "The person's perception of this tweet would be that it is against the legalization of abortion, as it implies that something alive must die in order for an abortion to be successful. They may also perceive it as a pro-life sentiment, as it includes hashtags such as #ChooseLife and #SemST.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that abortion is wrong and that it is a form of taking a life. They may also interpret the tweet as a call to choose life over abortion and to oppose the legalization of abortion.",
    "action": "Abortion should be a choice, not a requirement. We should be working to make sure that all women have access to safe and legal abortion services. #ProChoice #AbortionRights"
  },
  {
    "ID": 823,
    "Target": "Legalization of Abortion",
    "Tweet": "#BlackLivesMatter unless they are pre born black lives then they don't matter #AbortionIsMurder #LiberalLogic #SemST",
    "perception": "The person's perception of the tweet would likely be one of frustration and anger, as it implies that the lives of unborn black children are not valued and that abortion is equated with murder.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is implying that black lives are not valued unless they are born, and that abortion is wrong and should be illegal. They may also feel that the tweet is attacking their beliefs and values.",
    "action": "Black lives matter, regardless of whether they are born or not. #AbortionIsNotMurder #ProChoice #SemST"
  },
  {
    "ID": 874,
    "Target": "Legalization of Abortion",
    "Tweet": "Even the #smallest #person can change the course of the #future.youthgen #SemST",
    "perception": "The person's perception of this tweet might be that it is encouraging and optimistic, suggesting that even a single individual can make a difference in the world. They may also interpret it as a call to action, particularly in regards to the legalization of abortion.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for the power of individuals to make a difference in the world, and that this could be applied to the issue of abortion. They may also interpret it as a call to action to support the legalization of abortion.",
    "action": "We can all make a difference in the world, and that includes supporting the legalization of abortion. #SemST #YouthGen #SmallestPerson"
  },
  {
    "ID": 1043,
    "Target": "Legalization of Abortion",
    "Tweet": "If you planted a garden you don't pull out the plants before they have a chance to bear fruit. #SemST",
    "perception": "The person's perception of this tweet would be that it is in support of the legalization of abortion, as it implies that it is wrong to end something before it has had a chance to reach its full potential. They may also interpret the hashtag as a reference to the Semantic Satiation Theory, which suggests that repetition of words can lead to a change in meaning.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right to choose, and that it is wrong to end something before it has had a chance to reach its full potential. They may also interpret the hashtag as a reference to the Semantic Satiation Theory, which suggests that repetition of words can lead to a change in meaning.",
    "action": "Agreed! Everyone should have the right to choose and no one should be denied the chance to reach their full potential. #SemST"
  },
  {
    "ID": 1115,
    "Target": "Legalization of Abortion",
    "Tweet": "Parents have left their role to the teachers! Parents need to have skills to reach out to their own children it's important! #SemST",
    "perception": "The person's perception of the tweet might be that it is advocating for parents to take a more active role in their children's education, and that it is emphasizing the importance of parents having the necessary skills to do so.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is suggesting that parents should be more involved in their children's education, and that it is important for parents to have the necessary skills to do so.",
    "action": "Agreed! Parents need to be more involved in their children's education and have the necessary skills to do so. #SemST"
  },
  {
    "ID": 698,
    "Target": "Legalization of Abortion",
    "Tweet": "People who have never had an abortion can be prochoice. People with a uterus can be prochoice. People who never want kids can be #SemST",
    "perception": "The person's perception of the tweet would be that it is supportive of the legalization of abortion, and that it is advocating for the rights of people to make their own decisions about their reproductive health.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the right of people to make their own decisions about their reproductive health, regardless of their gender, reproductive history, or desire to have children. They would also understand that the hashtag #SemST is being used to emphasize the importance of reproductive autonomy and self-determination.",
    "action": "Thank you for supporting reproductive autonomy and self-determination! #SemST #ProChoice"
  },
  {
    "ID": 1245,
    "Target": "Legalization of Abortion",
    "Tweet": "#PeoplesDebate Juvenile hysterics from that woman. Killing babies is bodily autonomy? People dying of neglect but lets have #VinB #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and anger, as it appears to be criticizing the idea of legalizing abortion. They may also feel frustrated that the tweet is attempting to link the issue of abortion to other unrelated issues.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the idea of legalizing abortion by linking it to other unrelated issues and by implying that those who support it are juvenile and hysterical. They may also feel that the tweet is attempting to shame those who support the legalization of abortion.",
    "action": "Abortion is a complex issue and should be discussed with respect. #VinB #SemST #PeoplesDebate"
  },
  {
    "ID": 1000,
    "Target": "Legalization of Abortion",
    "Tweet": "@MeghanMcCain so because #SCOTUS ruled fors you think everyone just threw their hands up and supported #LoveWins #SemST",
    "perception": "The person's perception of this tweet would be that it is expressing support for the legalization of abortion, as well as celebrating the Supreme Court's ruling in favor of it. They may also perceive a sentiment of joy and optimism in the hashtag #LoveWins.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is celebrating the Supreme Court's ruling in favor of the legalization of abortion, and that the hashtag #LoveWins is expressing a sentiment of joy and optimism. They may also interpret the hashtag #SemST as a call to continue to fight for reproductive rights.",
    "action": "@MeghanMcCain We must continue to fight for reproductive rights! #SemST #LoveWins"
  },
  {
    "ID": 920,
    "Target": "Legalization of Abortion",
    "Tweet": "@LogicOfLife7 I don't confuse \"right to life\" with 'right-to-use-someone's-body-without-consent'. Do you? #rapeculture #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for the legalization of abortion and is critical of the idea of \"right to life\" as it implies the use of someone's body without their consent. They may also perceive the tweet as being critical of rape culture and the SemST hashtag.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the legalization of abortion and is critical of the idea of \"right to life\" as it implies the use of someone's body without their consent. They may also interpret the tweet as being critical of rape culture and the SemST hashtag as a way to further the conversation about abortion rights.",
    "action": "@LogicOfLife7 Absolutely! We need to keep fighting for the right to choose and end rape culture. #abortionrights #SemST"
  },
  {
    "ID": 1046,
    "Target": "Legalization of Abortion",
    "Tweet": "@j6fras same but I got hated for it. #progod #progun #SemST",
    "perception": "The person's perception of the tweet might be that the author is expressing a pro-choice stance on abortion, and is facing backlash for their opinion. They may also perceive the author as being pro-God and pro-gun.",
    "cognition": "The person's cognition after perceiving the information might be that the author is expressing a strong opinion on abortion, and is facing criticism for their beliefs. They may also interpret the author as being religious and supportive of gun rights.",
    "action": "@j6fras I'm sorry you're facing backlash for your opinion. I support your right to choose and stand with you. #prochoice #support"
  },
  {
    "ID": 955,
    "Target": "Legalization of Abortion",
    "Tweet": "No ones fenna die from this heat on my watch. #SemST",
    "perception": "The person's perception of this tweet might be that the speaker is determined to protect people from the heat, and is expressing a positive sentiment.",
    "cognition": "The person's cognition of this tweet might be that the speaker is committed to ensuring the safety of people in the face of extreme heat, and is expressing a sense of responsibility and care.",
    "action": "Thanks for looking out for us! #SemST"
  },
  {
    "ID": 798,
    "Target": "Legalization of Abortion",
    "Tweet": "Findin budget compromise a 'process' #Brownback says  #income #thestate #SemST",
    "perception": "The person's perception of this tweet would be that it is discussing a process related to budget compromise, and that it is likely related to income and the state. They may also infer that the hashtag #SemST is related to the topic.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is discussing a process related to budget compromise, and that it is likely related to income and the state. They may also infer that the hashtag #SemST is related to the topic, and that it could be related to the legalization of abortion in some way.",
    "action": "It's important to consider the implications of budget compromise on #income and #thestate. #SemST #LegalizeAbortion"
  },
  {
    "ID": 1161,
    "Target": "Legalization of Abortion",
    "Tweet": "Coming from a female that was taken away the ability to have children. I still believe women should have the ability to choose. #SemST",
    "perception": "The person's perception of the tweet would be one of support for the legalization of abortion, as it is coming from a woman who has been denied the ability to have children and still believes that women should have the right to choose. They would likely also feel a sense of solidarity with the hashtag #SemST.",
    "cognition": "The person's cognition after perceiving the information would be that the woman in the tweet is advocating for the right of women to make their own decisions about their reproductive health, and that the hashtag #SemST is likely a reference to the struggle for reproductive rights.",
    "action": "I stand with you in support of the right of women to make their own decisions about their reproductive health. #SemST"
  }
]