[
  {
    "ID": 646,
    "Target": "Feminist Movement",
    "Tweet": "Shut up and go back to the kitchen bitch #SemST",
    "perception": "The person's initial perception of the tweet would be one of shock and anger, as it is clearly derogatory and dismissive of the Feminist Movement. They may also feel a sense of disbelief that someone would be so openly hostile towards the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of sexism and misogyny, and that it is an attempt to silence and discredit the Feminist Movement. They may also feel a sense of frustration and disappointment that such attitudes still exist in society.",
    "action": "No one should be silenced for speaking up for what they believe in. #FeminismIsForEveryone"
  },
  {
    "ID": 381,
    "Target": "Feminist Movement",
    "Tweet": "I need feminism because broken idealogies need defending just as much as functioning ones. #cryingalready #DeathNote #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as the tweet is advocating for the need of feminism. Additionally, the person may also perceive the tweet to be expressing a sense of sadness or frustration.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for the need of feminism in order to challenge and defend broken ideologies. Additionally, the person may also interpret the tweet to be expressing a sense of sadness or frustration at the current state of affairs.",
    "action": "I stand with you in defending broken idealogies and advocating for the need of feminism. #FeministMovement #EqualityForAll"
  },
  {
    "ID": 389,
    "Target": "Feminist Movement",
    "Tweet": "Staying silent after being raped so as not to get charged with adultery is an expression of my #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it highlights the injustice of the legal system towards victims of sexual assault. They would likely sympathize with the sentiment of the tweet, and feel a strong sense of support for the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the legal system is failing victims of sexual assault, and that the Feminist Movement is necessary to fight for justice and equality. They would likely feel a strong sense of motivation to take action and support the cause.",
    "action": "We must fight for justice and equality for victims of sexual assault. #SemST #FeministMovement"
  },
  {
    "ID": 214,
    "Target": "Feminist Movement",
    "Tweet": "#WeNeedFeminism because #YesAllWomen simply do not get the same level of respect that I get as a man. #HeForShe #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support and solidarity for the Feminist Movement. They may also feel encouraged by the hashtag #HeForShe, which suggests that men are also standing up for gender equality.",
    "cognition": "The person's cognition after perceiving the information is likely to be that gender inequality is still a major issue, and that men and women need to work together to create a more equal society. They may also recognize the importance of men standing up for gender equality and supporting the Feminist Movement.",
    "action": "I stand with #HeForShe and #YesAllWomen in the fight for gender equality. #WeNeedFeminism #SemST"
  },
  {
    "ID": 29,
    "Target": "Feminist Movement",
    "Tweet": "FINALLY A WOMEN RUNNING FOR PRESIDENT #SemST",
    "perception": "The person's perception of this tweet would be one of excitement and enthusiasm, as they recognize the significance of a woman running for president and the potential impact of the feminist movement. They would likely feel encouraged and hopeful for the future of gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that this is a major milestone for the feminist movement and a sign of progress towards gender equality. They would likely feel proud and inspired by the progress being made and hopeful for the future of the feminist movement.",
    "action": "This is amazing news! We are one step closer to achieving gender equality. #FeministMovement #SemST"
  },
  {
    "ID": 595,
    "Target": "Feminist Movement",
    "Tweet": "How to spot a fashion-#Feminist - they claim feminism is about equality. Feminist actions demonstrate otherwise. #SemST",
    "perception": "The person's perception of the tweet might be that it is critical of the feminist movement, suggesting that it is not actually about equality, but rather about something else. They may also perceive the tweet as implying that feminist actions do not reflect the values of equality that they claim to support.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the feminist movement is not actually about equality, but rather about something else. They may also interpret the tweet as suggesting that feminist actions do not reflect the values of equality that they claim to support.",
    "action": "Feminism is about equality and justice for all genders. We must continue to fight for these values and ensure that our actions reflect them.\" #Feminism #Equality #Justice"
  },
  {
    "ID": 466,
    "Target": "Feminist Movement",
    "Tweet": "Here we are fighting for equality when @Wimbledon decide to only allow ladies heat breaks. Do men not get hot too? #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and indignation towards the unequal treatment of men and women at Wimbledon. They would likely feel that the decision to only allow ladies heat breaks is unfair and unjust.",
    "cognition": "The person's cognition after perceiving the information would be that Wimbledon is not treating men and women equally, and that this is an example of gender inequality that needs to be addressed. They would likely feel that this is an example of the systemic sexism that the Feminist Movement is fighting against.",
    "action": "It's unacceptable that @Wimbledon is not treating men and women equally. We must continue to fight for gender equality and justice! #SemST"
  },
  {
    "ID": 636,
    "Target": "Feminist Movement",
    "Tweet": "Why do feminists hate @Lauren_Southern so much? Because she's one thing none of them are:  Beautiful.  #GamerGate #SemST",
    "perception": "The person's perception of this tweet could be that it is mocking feminists and attempting to discredit them by implying that they are not attractive. They may also perceive it as an attack on Lauren Southern, a figure associated with the GamerGate movement.",
    "cognition": "The person's cognition of this tweet could be that it is attempting to discredit feminists by implying that they are not attractive, and that it is also an attack on Lauren Southern. They may also interpret it as an attempt to use beauty as a way to invalidate the opinions of feminists.",
    "action": "Beauty has nothing to do with the validity of someone's opinions. #Feminism #LaurenSouthern"
  },
  {
    "ID": 269,
    "Target": "Feminist Movement",
    "Tweet": "This just in: Pop culture still hates women. #SemST",
    "perception": "The person's perception of this tweet would be one of frustration and anger, as it implies that popular culture continues to be hostile towards women. They may also feel a sense of solidarity with the hashtag #SemST, which could indicate a shared sentiment of support for the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that popular culture is still perpetuating gender inequality and that the Feminist Movement is necessary to combat this. They may also feel a sense of solidarity with the hashtag #SemST, which could indicate a shared sentiment of support for the Feminist Movement.",
    "action": "It's time to stand up and fight for gender equality! #FeministMovement #SemST"
  },
  {
    "ID": 462,
    "Target": "Feminist Movement",
    "Tweet": "Reading a mag that has endless pages about how to look on holiday but holidays are the time not to give a fuck. That's the point! #SemST",
    "perception": "The person's perception of this tweet is likely to be one of agreement and appreciation for the sentiment expressed, that holidays are a time to not worry about appearances. They may also feel encouraged by the hashtag, which suggests that the sentiment is shared by others in the feminist movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for a more relaxed attitude towards appearances during holidays, and that this attitude is shared by others in the feminist movement. They may also feel empowered by the sentiment expressed in the tweet, and encouraged to take a break from worrying about their appearance during holidays.",
    "action": "Agreed! Holidays are the perfect time to take a break from worrying about appearances and just enjoy the moment. #SemST"
  },
  {
    "ID": 309,
    "Target": "Feminist Movement",
    "Tweet": "Gender research helps to develop nursing research  theoretical frameworks, concepts and methodology. @genderanded #research #SemST",
    "perception": "The person's perception of this tweet would be that it is a positive message that promotes gender research and its importance in nursing research. They would also likely appreciate the hashtag usage to draw attention to the topic of gender and research.",
    "cognition": "The person's cognition after perceiving the information would be that gender research is essential for developing nursing research theoretical frameworks, concepts, and methodology. They would also recognize the importance of raising awareness of gender and research through the use of the hashtag.",
    "action": "Thank you for highlighting the importance of gender research in nursing research! #GenderAndResearch #SemST"
  },
  {
    "ID": 346,
    "Target": "Feminist Movement",
    "Tweet": "WOW.  Why is gay marriage legal but LESBIAN marriage isn't?!  WHAT THE FUCK @POTUS FIX THIS NOW #SemST",
    "perception": "The person's perception of this tweet would be one of outrage and frustration, as it calls out the President of the United States for not legalizing lesbian marriage. They would likely be in support of the tweet's message and the hashtag #SemST.",
    "cognition": "The person's cognition after perceiving the information would be that the President of the United States needs to take action to legalize lesbian marriage, and that the Feminist Movement should continue to fight for equal rights for all genders.",
    "action": "We must continue to fight for equal rights for all genders! #FeministMovement #EqualRights #SemST"
  },
  {
    "ID": 195,
    "Target": "Feminist Movement",
    "Tweet": "@spectator exactly women are so weak and incapable the sight of one in a slim skin is giving them an attack of the vapours #SemST",
    "perception": "The person's initial perception of this tweet would be one of anger and frustration, as it implies that women are weak and incapable. They may also feel that the tweet is sexist and demeaning towards women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a mockery of the Feminist Movement and is perpetuating gender stereotypes. They may also feel that the tweet is reinforcing the idea that women are not capable of achieving the same things as men.",
    "action": "@spectator Women are strong and capable, and should be treated with respect. #FeministMovement"
  },
  {
    "ID": 218,
    "Target": "Feminist Movement",
    "Tweet": "Excited to hear author @LeoraTanenbaum  Slut-Shaming in the Age ofthe Internet #slutshaming #SemST",
    "perception": "The person's perception of the tweet would be one of enthusiasm and support for the author and the topic of slut-shaming. They would also likely be in agreement with the hashtag topics of #slutshaming and #SemST.",
    "cognition": "The person's cognition after perceiving the information would be that the author is discussing an important issue that needs to be addressed, and that slut-shaming is a problem that needs to be addressed in the age of the internet.",
    "action": "I'm so glad that @LeoraTanenbaum is discussing this important issue! #slutshaming #SemST #FeministMovement"
  },
  {
    "ID": 506,
    "Target": "Feminist Movement",
    "Tweet": "@azarrax @PennyRed is the UK's answer to @JessicaValenti and @AmandaMarcotte.  #GamerGate #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration for the work of the three feminists mentioned, as well as a recognition of the hashtag #GamerGate and #SemST as related to the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the three feminists mentioned are important figures in the Feminist Movement, and that the hashtag #GamerGate and #SemST are related to the Feminist Movement.",
    "action": "Thanks for the shoutout! @PennyRed, @JessicaValenti, and @AmandaMarcotte are amazing feminists and I'm proud to stand with them in the fight for gender equality. #FeministMovement #GamerGate #SemST"
  },
  {
    "ID": 107,
    "Target": "Feminist Movement",
    "Tweet": "All the feminist block me because I speak true. #SemST",
    "perception": "The person's perception of the tweet might be that the speaker is frustrated and feels that they are being unfairly silenced by feminists. They may also perceive a negative sentiment towards the feminist movement.",
    "cognition": "The person's cognition after perceiving the information might be that the speaker feels that their opinions are being disregarded by feminists, and that they are being unfairly silenced. They may also interpret the tweet as a criticism of the feminist movement.",
    "action": "It's important to listen to all voices in the feminist movement. Everyone should be heard and respected, regardless of their opinion."
  },
  {
    "ID": 232,
    "Target": "Feminist Movement",
    "Tweet": "Thanks for all the laughs tonight, @amyschumer! And the social commentary wasn't bad either ;) #equalpay #girlyoudontneedmakeup #SemST",
    "perception": "The person's perception of this tweet would be one of admiration and support for Amy Schumer's comedic talent and her advocacy for the feminist movement. They would likely appreciate the hashtag references to equal pay and the empowerment of women to be themselves without makeup.",
    "cognition": "The person's cognition of this tweet would be that Amy Schumer is using her platform to advocate for the feminist movement and to promote the idea of equal pay and self-acceptance for women. They would likely appreciate her efforts to spread awareness and to challenge traditional gender roles.",
    "action": "@amyschumer You're an inspiration! Keep up the great work for the feminist movement! #equalpay #girlyoudontneedmakeup #SemST"
  },
  {
    "ID": 57,
    "Target": "Feminist Movement",
    "Tweet": "Women are superior to men in every aspect #feminist #SemST",
    "perception": "The person's perception of the tweet would likely be one of agreement and support for the feminist movement, as it implies that women are superior to men in every aspect. They may also feel encouraged by the hashtag usage, as it shows solidarity with the feminist cause.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is advocating for gender equality and that the hashtag usage is a sign of support for the feminist movement. They may also interpret the tweet as a call to action to support the feminist cause.",
    "action": "I'm with you! #Feminist #SemST"
  },
  {
    "ID": 122,
    "Target": "Feminist Movement",
    "Tweet": "RT @WeNeedFeminism: I don't want to choose between having a family or having a career #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as well as a recognition of the challenges faced by women in balancing family and career.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the need for more support for women in achieving both family and career goals, and that the Feminist Movement is a necessary part of this process. They may also recognize the importance of the hashtag #SemST in raising awareness of the issue.",
    "action": "Agreed! We need to make sure that women have the same opportunities as men to pursue their dreams, no matter what they are. #Feminism #SemST"
  },
  {
    "ID": 174,
    "Target": "Feminist Movement",
    "Tweet": "Full of #narcissism and self-loathing, a lot of women out there like that. Its got sod all to do with #WrightStuff #WolfWhistling #SemST",
    "perception": "The person's perception of the tweet would be one of disappointment and frustration, as it appears to be mocking women who are part of the Feminist Movement. They may also feel that the tweet is perpetuating negative stereotypes about women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a negative statement about women who are part of the Feminist Movement, and that it is perpetuating negative stereotypes about women. They may also feel that the tweet is undermining the progress that has been made in the Feminist Movement.",
    "action": "#WrightStuff #WolfWhistling #SemST are all about empowering women and celebrating their achievements. We should be lifting each other up, not tearing each other down."
  },
  {
    "ID": 132,
    "Target": "Feminist Movement",
    "Tweet": "I guess wanting and trying to make this world a better place for everyone makes me ugly. #feminist #SemST",
    "perception": "The person's perception of the tweet is likely to be one of support and admiration for the feminist movement, as well as a sense of frustration at the idea that wanting to make the world a better place is seen as a negative thing.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is expressing a sense of disappointment that the feminist movement is not seen as a positive thing, and that the speaker is determined to continue advocating for the cause despite the negative perception.",
    "action": "We won't give up! Keep fighting for a better world for everyone. #feminist #SemST"
  },
  {
    "ID": 593,
    "Target": "Feminist Movement",
    "Tweet": "@elllode BUT SHE RUNS IN HIGH HEELS #SemST",
    "perception": "The person's initial perception of the tweet might be that it is a humorous comment about a woman running in high heels, which could be seen as a challenge to traditional gender roles. They may also perceive it as a positive statement about the strength and determination of women.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is a celebration of female empowerment and a challenge to traditional gender roles. They may also interpret it as a statement of support for the Feminist Movement and a recognition of the strength and determination of women.",
    "action": "@elllode We salute you for running in high heels! #FeministMovement #WomenEmpowerment"
  },
  {
    "ID": 541,
    "Target": "Feminist Movement",
    "Tweet": "...OR SLOW DOWN YOUR CALL TO YELL AT ME WHILE I WAIT FOR THE BUS!!! #WHATTHEACTUALFUCK #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it appears to be a call to action against a person who is waiting for the bus. The hashtag #WHATTHEACTUALFUCK further emphasizes the sentiment of anger and frustration.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is calling out a situation of gender-based discrimination, and that the hashtag is a call to action for the Feminist Movement.",
    "action": "We stand with you! #FeministMovement #NoMoreDiscrimination"
  },
  {
    "ID": 373,
    "Target": "Feminist Movement",
    "Tweet": "Communists can relate to how we feel. #communist #faith #karlmarx #SemST",
    "perception": "The person's perception of the tweet would be that it is expressing solidarity with the Feminist Movement, and is likely to be supportive of the cause. They may also infer that the tweet is referencing Karl Marx and his theories of communism.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is suggesting that the principles of communism can be related to the struggles of the Feminist Movement, and that Karl Marx's theories can be used to support the cause. They may also infer that the hashtag #SemST is referencing the Semiotic Square Theory, which is a tool used to analyze the power dynamics between two opposing forces.",
    "action": "Thank you for your support! #FeministMovement #Solidarity"
  },
  {
    "ID": 524,
    "Target": "Feminist Movement",
    "Tweet": "There is one more basic cause [of the abuse of women], and that is that, in general, men don't give a damn. (Jimmy Carter) #SemST",
    "perception": "The person's perception of the tweet is likely to be one of agreement and support for the feminist movement, as it is quoting a former president in support of the cause. They may also feel encouraged by the hashtag, which suggests that the sentiment is shared by many people.",
    "cognition": "The person's cognition after perceiving the information is likely to be that men need to take more responsibility for the abuse of women, and that the sentiment is shared by many people. They may also feel empowered by the fact that a former president is speaking out in support of the feminist movement.",
    "action": "Thank you, Jimmy Carter, for speaking out in support of the feminist movement. We must all take responsibility to end the abuse of women. #SemST"
  }
]