[
  {
    "ID": 0,
    "Target": "Feminist Movement",
    "Tweet": "Always a delight to see chest-drumming alpha males hiss and scuttle backwards up the wall when a feminist enters the room. #manly #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration and amusement, as it implies that feminists are powerful and intimidating to men.",
    "cognition": "The person's cognition of this tweet is likely to be that feminists are strong and capable of standing up for themselves, and that men should not be intimidated by them. They may also view the hashtag as a sign of respect for the feminist movement.",
    "action": "Amen! #FeministPower #Respect"
  },
  {
    "ID": 1,
    "Target": "Feminist Movement",
    "Tweet": "Sometimes I overheat and want to take off my shirt but can't because of social expectations of people with breasts. ;n; #SemST",
    "perception": "The person's perception of this tweet would be one of understanding and empathy, as it speaks to the struggles of those who are expected to adhere to certain gender norms. They may also feel a sense of solidarity with the person who posted the tweet, as it speaks to a shared experience.",
    "cognition": "The person's cognition after perceiving the information would be that gender norms can be oppressive and restrictive, and that there is a need for greater acceptance and understanding of those who do not conform to traditional gender roles. They may also recognize the importance of the Feminist Movement in advocating for greater gender equality and acceptance.",
    "action": "I stand with you! We need to work together to create a world where everyone can express themselves freely and without judgement. #FeministMovement"
  },
  {
    "ID": 2,
    "Target": "Feminist Movement",
    "Tweet": "If feminists spent 1/2 as much time reading papers as they do tumblr they would be real people, not ignorant sexist bigots. #SemST",
    "perception": "The person's initial perception of this tweet would be one of offense and anger, as it implies that feminists are ignorant and sexist. They may also feel that the tweet is belittling the Feminist Movement.",
    "cognition": "After perceiving the information, the person may interpret the tweet as implying that feminists should focus more on reading scholarly papers than on Tumblr in order to be taken seriously. They may also feel that the tweet is suggesting that feminists are not knowledgeable enough about the issues they are advocating for.",
    "action": "Feminists are knowledgeable and passionate about the issues they are advocating for. We should all be working together to create a more equitable society. #FeministMovement"
  },
  {
    "ID": 3,
    "Target": "Feminist Movement",
    "Tweet": "Stupid Feminists, the civilization you take for granted was built with the labour, blood sweat and tears of men. #SemST",
    "perception": "The person's perception of the tweet could be one of anger and frustration towards the speaker, as the tweet implies that feminists are ungrateful for the work of men. They may also feel that the speaker is attempting to discredit the feminist movement.",
    "cognition": "The person's cognition after perceiving the information could be that the speaker is attempting to discredit the feminist movement by implying that feminists are ungrateful for the work of men. They may also feel that the speaker is attempting to downplay the importance of the feminist movement and its contributions to society.",
    "action": "Feminists have been integral to the progress of civilization and have made countless contributions to society. #FeminismMatters"
  },
  {
    "ID": 4,
    "Target": "Feminist Movement",
    "Tweet": "YOU'RE A GIRL AND HAVE A SEX DRIVE!? YOU MUST BE A SLUT! #feminist #SemST",
    "perception": "The person's perception of the tweet would be one of shock and disbelief, as it is a derogatory statement that undermines the feminist movement. They may also feel anger and frustration at the negative attitude towards women expressed in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of sexism and misogyny, and that it is an attack on the feminist movement. They may also recognize that the tweet is an example of slut-shaming, which is a form of gender-based discrimination.",
    "action": "No one should be shamed for their gender or sexuality. #feminist #SemST #NoShame"
  },
  {
    "ID": 5,
    "Target": "Feminist Movement",
    "Tweet": "Suns out....  Dresses out...  #StreetHarassment out...  This shouldn't be daily life  #YesAllWomen @EverydaySexism #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as it calls for an end to street harassment and acknowledges the struggles of women in everyday life. The person would also likely appreciate the use of hashtags to draw attention to the issues of sexism and street harassment.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for an end to street harassment and sexism, and that it is calling for a society where women can feel safe and respected. The person would likely also recognize the importance of raising awareness of these issues and the need for collective action to bring about change.",
    "action": "Agreed! We must work together to create a world where women can feel safe and respected. #YesAllWomen #SemST #EndStreetHarassment"
  },
  {
    "ID": 6,
    "Target": "Feminist Movement",
    "Tweet": "Women's rights are #humanrights! Join the #CPDvoices twitter rally at 3pm ET if you agree! #CPD48 #SemST",
    "perception": "The person's perception of this tweet would be one of support for the Feminist Movement and a call to action to join the rally in support of women's rights. They would likely feel encouraged and motivated to join the rally and spread the message of equality.",
    "cognition": "The person's cognition after perceiving the information would be that the rally is an opportunity to show solidarity with the Feminist Movement and to make their voice heard in support of women's rights. They would likely feel empowered to join the rally and to use their voice to help create a more equitable society.",
    "action": "Count me in! I'm joining the #CPDvoices twitter rally at 3pm ET to show my support for women's rights as #humanrights! #CPD48 #SemST"
  },
  {
    "ID": 7,
    "Target": "Feminist Movement",
    "Tweet": "So you support unequal pricing based on gender @CamilleBogrand?  Don't you normally call that sexism?  #EqualPayDay #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and disbelief, as it appears to be criticizing the Feminist Movement for supporting unequal pricing based on gender.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the Feminist Movement is hypocritical for supporting unequal pricing based on gender, which is considered to be sexist. They may also be questioning why the Feminist Movement is supporting something that goes against their own beliefs.",
    "action": "@CamilleBogrand We support equal pay for equal work, not unequal pricing based on gender. We believe in gender equality and are working to end sexism. #EqualPayDay #SemST"
  },
  {
    "ID": 8,
    "Target": "Feminist Movement",
    "Tweet": "These pics of #pornstars with/without makeup? Just perpetuating the myth that women need makeup to be considered pretty. #SemST",
    "perception": "The person's perception of this tweet would be one of disapproval and frustration, as it appears to be criticizing the idea that women need to wear makeup to be considered attractive. They may also feel that this tweet is perpetuating a damaging stereotype about women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the damaging effects of perpetuating the idea that women need to wear makeup to be considered attractive. They may also come to the conclusion that this tweet is advocating for a more positive view of women and their beauty, which is in line with the goals of the Feminist Movement.",
    "action": "Agreed! We need to move away from this damaging stereotype and celebrate the beauty of all women, regardless of makeup. #FeministMovement"
  },
  {
    "ID": 9,
    "Target": "Feminist Movement",
    "Tweet": "#YesAllWomen should know how to protect herself. Which is why I carry a gun. #republicanvalues #SemST",
    "perception": "The person's perception of this tweet might be that it is advocating for women's safety, but in a way that is not necessarily in line with feminist values. They may also perceive it as a statement of support for gun rights.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for women's safety, but in a way that is not necessarily in line with feminist values, as it is promoting the use of guns. They may also interpret it as a statement of support for gun rights and conservative values.",
    "action": "#YesAllWomen should have the right to choose how they protect themselves. Guns are not the only option. #feministvalues #SemST"
  },
  {
    "ID": 10,
    "Target": "Feminist Movement",
    "Tweet": "links in sauga gotta stop chincing girls and taking away that extra bit #iknowyoudoit  #equality #SemST",
    "perception": "The person's perception of this tweet would be that it is advocating for gender equality and condemning the mistreatment of women. They would also likely recognize the hashtag #SemST as a reference to the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is calling out the mistreatment of women in the city and advocating for gender equality. They would also likely recognize the hashtag #SemST as a reference to the Feminist Movement and its goal of achieving gender equality.",
    "action": "Agreed! We need to end the mistreatment of women and promote gender equality. #SemST #equality"
  },
  {
    "ID": 11,
    "Target": "Feminist Movement",
    "Tweet": "RT @isocynic: I support whatever team buck supports #truefan #socceroos #bodypositive #SemST",
    "perception": "The person's perception of the tweet would be that it is a positive message that supports a team, body positivity, and the Feminist Movement. They would likely view the tweet as an encouraging and uplifting message.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for a team, body positivity, and the Feminist Movement. They would likely interpret the tweet as a call to action to support these causes and to be a true fan.",
    "action": "I'm in! Count me in to support the team, body positivity, and the Feminist Movement. #truefan #socceroos #bodypositive #SemST"
  },
  {
    "ID": 12,
    "Target": "Feminist Movement",
    "Tweet": "tired of anti-womanist respectability politics. we need a safe space for women can look like they're at the club at an interview #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it expresses a desire for a safe space for women to express themselves without judgement. They may also perceive a sentiment of frustration with respectability politics that often limit women's expression.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is advocating for a space where women can express themselves without judgement, and that respectability politics often limit women's expression. They may also recognize that the hashtag #SemST is likely referring to a specific movement or organization related to the Feminist Movement.",
    "action": "Agreed! We need to create a safe space for women to express themselves without judgement. #FeministMovement #SemST"
  },
  {
    "ID": 13,
    "Target": "Feminist Movement",
    "Tweet": "If you're a feminist AND you hate men, please kill yourself. #SemST",
    "perception": "The person's initial perception of this tweet would be one of shock and anger, as it is clearly an offensive and misogynistic statement. They would likely feel that the tweet is an attack on the feminist movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of sexism and hatred towards feminists and the feminist movement. They would likely feel that the tweet is an attempt to discredit and undermine the feminist movement and its supporters.",
    "action": "This tweet is unacceptable and offensive. We must stand together to fight against sexism and misogyny. #Feminism #Equality"
  },
  {
    "ID": 14,
    "Target": "Feminist Movement",
    "Tweet": "Women don't make 75% less than men for the same job. Women, on average, make less then men. Look it up feminazis. #EqualPayDay #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration. They may feel that the tweet is dismissive of the gender pay gap and the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is attempting to discredit the gender pay gap and the Feminist Movement. They may also feel that the tweet is using derogatory language to refer to feminists.",
    "action": "The gender pay gap is real and it's time to take action to close it. #EqualPayDay #FeministMovement"
  },
  {
    "ID": 15,
    "Target": "Feminist Movement",
    "Tweet": "@lucyblakeman12 You need feminism more than you need anything else in your life. You couldn't survive or speak w/o it. #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support and appreciation for the Feminist Movement. They may also feel encouraged by the message that feminism is essential for survival and speaking out.",
    "cognition": "The person's cognition after perceiving the information is likely to be that feminism is an important part of life and that it is necessary for survival and speaking out. They may also feel empowered by the message that feminism is essential for their well-being.",
    "action": "@lucyblakeman12 I'm so inspired by your message! Feminism is essential for our survival and speaking out. #FeministMovement"
  },
  {
    "ID": 16,
    "Target": "Feminist Movement",
    "Tweet": "MRAs just tried to \"enlighten\" me, which went about as well as the flight of the Hindenburg. #SemST",
    "perception": "The person's perception of the tweet would be one of frustration and annoyance, as they recognize the attempt of Men's Rights Activists to undermine the Feminist Movement. They may also feel a sense of solidarity with other feminists who have experienced similar attempts to discredit their beliefs.",
    "cognition": "The person's cognition after perceiving the information would be that the Men's Rights Activists are attempting to discredit the Feminist Movement, and that they are not succeeding in doing so. They may also recognize the humor in the tweet, and feel a sense of solidarity with other feminists who have experienced similar attempts to undermine their beliefs.",
    "action": "Don't let the MRAs get you down! We stand with you and the Feminist Movement! #Feminism #Solidarity"
  },
  {
    "ID": 17,
    "Target": "Feminist Movement",
    "Tweet": "Why do girls/women spend so much time to be pretty and attractive and then complain if they're reduced to a sex symbol? #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be criticizing the feminist movement for encouraging women to take pride in their appearance.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that women should not take pride in their appearance, and that the feminist movement is somehow responsible for this. They may also feel that the tweet is attempting to undermine the feminist movement by suggesting that it encourages women to be seen as sex symbols.",
    "action": "Women should be able to take pride in their appearance without being reduced to a sex symbol. #FeministMovement"
  },
  {
    "ID": 18,
    "Target": "Feminist Movement",
    "Tweet": "@randomtweetor i hate to break it to u bruh but women do get pretty for us. They get pretty to show other women #feminist #SemST",
    "perception": "The person's initial perception of this tweet would be one of disbelief and frustration, as it implies that women only dress up to impress other women, rather than for themselves. They may also feel that the tweet is dismissive of the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is perpetuating a stereotype that women only dress up to impress other women, rather than for themselves. They may also feel that the tweet is undermining the feminist movement and its goals of gender equality.",
    "action": "@randomtweetor Women dress up for themselves, not to impress other women. Let's focus on gender equality and respect for all genders #feminist #SemST"
  },
  {
    "ID": 19,
    "Target": "Feminist Movement",
    "Tweet": "Job should always go to best candidate, regardless of gender. Gender shouldn't even matter anymore, it's 2015! #PaulHenry #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as it promotes gender equality in the workplace. They may also feel encouraged by the hashtag, as it implies that the sentiment is shared by others.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for gender equality in the workplace, and that this sentiment is shared by others. They may also feel hopeful that the message of gender equality is becoming more widely accepted.",
    "action": "Thank you for your support of gender equality in the workplace! #FeministMovement #EqualityForAll"
  },
  {
    "ID": 20,
    "Target": "Feminist Movement",
    "Tweet": "What do you say to a woman with two black eyes?  Nothing, she's already been told twice.   #SemST",
    "perception": "The person's perception of the tweet would be one of shock and disbelief, as the tweet implies that violence against women is being joked about. They may also feel anger and frustration at the lack of respect for women that the tweet implies.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making light of a serious issue, and that it is perpetuating a culture of violence against women. They may also feel that the tweet is disrespectful and insensitive to the struggles of women in society.",
    "action": "This is unacceptable. Violence against women is not a joke. #RespectWomen #FeministMovement"
  },
  {
    "ID": 21,
    "Target": "Feminist Movement",
    "Tweet": "Did you know? Gender stereotypes as we know then developed with beginning of the 18. century. #gender #SemST",
    "perception": "The person's perception of the tweet would be that it is highlighting the development of gender stereotypes and is likely to be in support of the Feminist Movement. They may also perceive the tweet to be informative and educational.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is highlighting the development of gender stereotypes and how they have been perpetuated over time. They may also interpret the tweet to be advocating for the dismantling of gender stereotypes and the promotion of gender equality.",
    "action": "It's time to challenge and break down gender stereotypes! #Feminism #GenderEquality"
  },
  {
    "ID": 22,
    "Target": "Feminist Movement",
    "Tweet": "the time for gender equality is NOW! #SemST",
    "perception": "The person's perception of the tweet would be one of enthusiasm and support for the Feminist Movement, as the tweet is calling for gender equality to be achieved immediately. They would likely be encouraged by the message and the hashtag, feeling that the movement is gaining momentum.",
    "cognition": "The person's cognition after perceiving the information would be that the Feminist Movement is gaining traction and that now is the time to take action to achieve gender equality. They would likely feel empowered and motivated to take part in the movement and to help spread the message of gender equality.",
    "action": "I'm with you! Let's make gender equality a reality #SemST"
  },
  {
    "ID": 23,
    "Target": "Feminist Movement",
    "Tweet": "As Chip Kidd announces the readers & asks us to hold their applause, the audience cant hold it back for @GloriaSteinem #poetry #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration and respect for Gloria Steinem and her work in the Feminist Movement. They may also feel a sense of pride in the recognition of her work and the celebration of her accomplishments.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the audience was showing their appreciation for Gloria Steinem's work in the Feminist Movement. They may also recognize the importance of her work and the impact it has had on society.",
    "action": "Thank you @GloriaSteinem for your tireless work in the Feminist Movement! Your efforts have made a lasting impact on our society #Feminism #Respect"
  },
  {
    "ID": 24,
    "Target": "Feminist Movement",
    "Tweet": "Women get paid far more than men to appear in pornography. How come no one is talking about this blatant sexism?!  @amazingatheist #SemST",
    "perception": "The person's perception of this tweet would be one of outrage and disbelief at the inequality between men and women in the pornography industry. They would likely be in agreement with the sentiment expressed in the tweet and be eager to join the conversation and support the #SemST hashtag.",
    "cognition": "The person's cognition after perceiving the information would be that the gender pay gap in the pornography industry is a form of sexism that needs to be addressed. They would likely be motivated to take action to support the Feminist Movement and the #SemST hashtag in order to help bring about change.",
    "action": "This is unacceptable! We must take action to ensure that women are paid equally in the pornography industry. #SemST #FeministMovement"
  },
  {
    "ID": 25,
    "Target": "Feminist Movement",
    "Tweet": "You know you're in a patriarchy when women are the ones who are blamed for prostitution #whatisjustice #inequality #SemST",
    "perception": "The person's perception of this tweet would be one of outrage and indignation, as it highlights the unfairness of the patriarchy and the injustice of blaming women for prostitution.",
    "cognition": "The person's cognition after perceiving the information would be that the patriarchy is an oppressive system that unfairly blames women for issues that are not their fault. This tweet is a call to action to fight against this injustice and inequality.",
    "action": "We must stand together to fight against the oppressive patriarchy and the injustice of blaming women for issues that are not their fault. #FeministMovement #JusticeForAll #EqualityForAll"
  },
  {
    "ID": 26,
    "Target": "Feminist Movement",
    "Tweet": "When is it ok for a married 49-year-old CEO to use his power and influence to shag his 22-year-old intern? #AskHillary #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it appears to be making light of the power imbalance between a CEO and an intern. They may also feel that it is disrespectful to the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making a joke out of a serious issue, and that it is inappropriate to use the hashtag #AskHillary in this context. They may also feel that it is disrespectful to the feminist movement and to the intern in question.",
    "action": "This tweet is inappropriate and disrespectful to the feminist movement and to the intern in question. #NoToPowerImbalance #RespectWomen"
  },
  {
    "ID": 27,
    "Target": "Feminist Movement",
    "Tweet": "I love that girl @EricWynalda on @meganrapinoe_15 What the hell @FOXSports1? Way to diminish women's soccer #USWNT #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration and support for the female soccer player, Megan Rapinoe, and frustration with Fox Sports for diminishing the importance of women's soccer.",
    "cognition": "The person's cognition after perceiving the information is likely to be that Fox Sports is not giving the US Women's National Team the respect they deserve, and that the female soccer player, Megan Rapinoe, is a role model for the Feminist Movement.",
    "action": "#USWNT and @meganrapinoe_15 deserve more respect and recognition! #FeministMovement #EqualRights"
  },
  {
    "ID": 28,
    "Target": "Feminist Movement",
    "Tweet": "Men don't have a right to talk over you, you're voice is important, you are a goddess and don't deserve to be silenced #SemST",
    "perception": "The person's perception of this tweet would be one of support and empowerment for the Feminist Movement. They would likely feel encouraged and inspired by the message of standing up for their rights and not allowing themselves to be silenced.",
    "cognition": "The person's cognition after perceiving the information would be that they should not allow themselves to be silenced by anyone, regardless of gender. They would also understand that their voice is important and that they should not be afraid to speak up and make their opinions heard.",
    "action": "Thank you for the reminder! I'm standing up for my rights and speaking out for what I believe in. #FeministMovement"
  },
  {
    "ID": 29,
    "Target": "Feminist Movement",
    "Tweet": "FINALLY A WOMEN RUNNING FOR PRESIDENT #SemST",
    "perception": "The person's perception of this tweet would be one of excitement and enthusiasm, as they recognize the significance of a woman running for president and the potential impact of the feminist movement. They would likely feel encouraged and hopeful for the future of gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that this is a major milestone for the feminist movement and a sign of progress towards gender equality. They would likely feel proud and inspired by the progress being made and hopeful for the future of the feminist movement.",
    "action": "This is amazing news! We are one step closer to achieving gender equality. #FeministMovement #SemST"
  },
  {
    "ID": 30,
    "Target": "Feminist Movement",
    "Tweet": "Pissed that I got \"talked to\" but he didn't  #SemST",
    "perception": "The person's perception of this tweet is likely to be one of frustration and anger, as the hashtag implies that the speaker was treated differently than someone else in a similar situation. They may also feel a sense of solidarity with the speaker, as the hashtag implies that this is a common experience for people in the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that gender inequality is still a problem, and that the speaker has experienced unfair treatment due to their gender. They may also recognize that this is a common experience for people in the Feminist Movement, and that it is important to continue to fight for gender equality.",
    "action": "We stand with you! #FeministMovement"
  },
  {
    "ID": 31,
    "Target": "Feminist Movement",
    "Tweet": "@SirWilliamValen insulting, thinking you can make a switch like that. if it wasn't written for us, it wasn't for us #SemST",
    "perception": "The person's perception of the tweet would be one of frustration and anger, as it appears to be mocking the Feminist Movement and disregarding its importance. They may also feel a sense of solidarity with the hashtag, as it implies a shared sentiment of standing up for the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing the idea that the Feminist Movement can be easily dismissed or ignored. They may also interpret the hashtag as a call to action to stand up for the cause and fight for its recognition.",
    "action": "@SirWilliamValen We won't stand for this kind of disrespect. We will continue to fight for our rights and be heard #FeministMovement"
  },
  {
    "ID": 32,
    "Target": "Feminist Movement",
    "Tweet": "@Yaahnemba Have you ever thought that maybe \"blue jeans\" hates you? Not everyone in the world is made for each other. #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and suspicion, as it appears to be implying that someone or something is hostile towards the person being addressed. They may also be concerned about the implications of the hashtag, #SemST.",
    "cognition": "The person's cognition after perceiving the information would be to try to understand the implications of the tweet and the hashtag. They may also be trying to determine the intent of the person who posted the tweet and whether or not they are supportive of the Feminist Movement.",
    "action": "@Yaahnemba Can you explain what you mean by this tweet? #SemST"
  },
  {
    "ID": 33,
    "Target": "Feminist Movement",
    "Tweet": "I believe that every women should have their own rights!! #SemST",
    "perception": "The person's perception of the tweet would be one of support and enthusiasm for the Feminist Movement. They would likely be encouraged by the sentiment of the tweet and the hashtag used to emphasize the importance of the cause.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for women's rights and that the hashtag is being used to emphasize the importance of the cause. They would likely interpret the tweet as a call to action to support the Feminist Movement.",
    "action": "I'm with you! Let's keep fighting for women's rights! #SemST"
  },
  {
    "ID": 34,
    "Target": "Feminist Movement",
    "Tweet": "@TheRuIes @xDirtyDianna why not she's clearly a part of the squad females can't be with guys without being looked at as a hoe #SemST",
    "perception": "The person's perception of this tweet would be that it is supportive of the Feminist Movement, as it is advocating for women to be able to be with men without being judged. They may also perceive it as a call to action to challenge the double standards that exist in society.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for gender equality and challenging the double standards that exist in society. They may also interpret the tweet as a call to action to support the Feminist Movement and to fight against gender-based discrimination.",
    "action": "@TheRuIes @xDirtyDianna Absolutely! We must challenge the double standards and fight for gender equality. #FeministMovement"
  },
  {
    "ID": 35,
    "Target": "Feminist Movement",
    "Tweet": "It upsets me how people are so narrow-minded when it comes to feminism. STEREOTYPING MEN IS NOT . #SemST",
    "perception": "The person's perception of the tweet is likely to be one of frustration and disappointment, as it highlights the narrow-mindedness of people when it comes to feminism. They may also feel a sense of solidarity with the sentiment that stereotyping men is not acceptable.",
    "cognition": "The person's cognition after perceiving the information is likely to be that there is a need to challenge the narrow-mindedness of people when it comes to feminism, and that stereotyping men is not acceptable. They may also feel a sense of solidarity with the sentiment expressed in the tweet.",
    "action": "Agreed! We need to challenge narrow-mindedness and stand up against stereotyping men. #SemST"
  },
  {
    "ID": 36,
    "Target": "Feminist Movement",
    "Tweet": "I am obsessed with becoming a woman comfortable in her skin.  Sandra Cisneros #latinx #woc #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration and support for the message of self-acceptance and empowerment. They may also feel a sense of solidarity with the Latinx and Women of Color communities mentioned in the hashtag.",
    "cognition": "The person's cognition of this tweet is likely to be that it is a positive message of self-love and acceptance, and that it is a call to action for members of the Latinx and Women of Color communities to embrace their identities. They may also feel inspired to take action in support of the Feminist Movement.",
    "action": "Thank you for this inspiring message! We must continue to fight for the rights of all women and support each other in our journeys to self-acceptance. #FeministMovement #latinx #woc #SemST"
  },
  {
    "ID": 37,
    "Target": "Feminist Movement",
    "Tweet": "I just yelled at my boyfriend for trying to let me win for Mortal Kombat X. #SemST",
    "perception": "The person's perception of this tweet would be one of empowerment and strength, as the tweet is advocating for gender equality by showing that the person is not willing to accept special treatment. They are also expressing a sense of humor and lightheartedness in the hashtag.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for gender equality by showing that the person is not willing to accept special treatment, and that they are also expressing a sense of humor and lightheartedness. This is an example of how the Feminist Movement can be expressed in a fun and empowering way.",
    "action": "Love it! #FeministMovement #SemST"
  },
  {
    "ID": 38,
    "Target": "Feminist Movement",
    "Tweet": "Extinction of insects,dangerous herbs,gigolo services,religious fanaticism,fake BEERcans-Y Malaysia Radio&media FAIL2discuss? #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be highlighting a lack of discussion on important topics in Malaysian radio and media.",
    "cognition": "The person's cognition after perceiving the information would be that Malaysian radio and media are not discussing important topics such as the extinction of insects, dangerous herbs, gigolo services, religious fanaticism, and fake beer cans. This lack of discussion is concerning and needs to be addressed.",
    "action": "We need to make sure Malaysian radio and media are discussing important topics like the extinction of insects, dangerous herbs, gigolo services, religious fanaticism, and fake beer cans. #SemST #FeministMovement"
  },
  {
    "ID": 39,
    "Target": "Feminist Movement",
    "Tweet": "RT @WGSndsu: Let's demand less cat-calling and more cats! #ndsufeminist #Feminist #cats #DogsCanComeToo #SemST",
    "perception": "The person's perception of the tweet would be that it is a humorous and lighthearted way of advocating for the feminist movement. They may also perceive it as a call to action to demand respect for women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the feminist movement in a humorous way, and that it is calling for respect for women and an end to cat-calling. They may also interpret the tweet as a call for people to come together to support the feminist movement.",
    "action": "Count me in! Let's work together to make sure everyone is respected and treated equally. #Feminist #DogsCanComeToo #SemST"
  },
  {
    "ID": 40,
    "Target": "Feminist Movement",
    "Tweet": "Anyone find it funny that #Feminists use #TakeitLikeAMan when they don't want to understand what it means to be one?  #SemST",
    "perception": "The person's perception of this tweet is likely to be one of confusion and frustration, as the hashtag implies that feminists do not understand what it means to be a man. They may also feel that the tweet is mocking the feminist movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is making a joke at the expense of feminists, and that it is implying that feminists do not understand what it means to be a man. They may also feel that the tweet is belittling the feminist movement.",
    "action": "It's not funny to mock the feminist movement. #FeminismIsForEveryone #RespectWomen"
  },
  {
    "ID": 41,
    "Target": "Feminist Movement",
    "Tweet": ".@MyRainbowNinja @NotAllBhas This farm is fucking disgusting. #SemST",
    "perception": "The person's perception of the tweet would be one of anger and frustration, as the hashtag and language used suggest a negative sentiment towards the farm. They may also feel a sense of solidarity with the other two users mentioned in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the farm is not meeting the standards of the Feminist Movement, and that the tweet is a call to action to support the movement.",
    "action": "We stand with @MyRainbowNinja @NotAllBhas in their fight against this farm. #SemST #FeministMovement"
  },
  {
    "ID": 42,
    "Target": "Feminist Movement",
    "Tweet": "RT @rossansguil: Nothing like dudes joking about molesting me right to my face... #SemST",
    "perception": "The person's perception of this tweet would be one of shock and outrage, as it is clearly a situation of gender-based harassment and disrespect. They would likely sympathize with the person who posted the tweet and be supportive of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that gender-based harassment and disrespect is still a major problem in society, and that the Feminist Movement is necessary to combat it. They would likely feel a sense of urgency to take action and support the cause.",
    "action": "This is unacceptable! We must continue to fight for gender equality and end gender-based harassment and disrespect. #FeministMovement #EndGenderBasedHarassment"
  },
  {
    "ID": 43,
    "Target": "Feminist Movement",
    "Tweet": "All I'm doing is reading GG tweets and getting angrier. Fuuuuuuuuuuuck men are privileged.  Time for bed. #FeminismIsAwfullyGreat #SemST",
    "perception": "The person's perception of this tweet is likely one of anger and frustration towards the privilege of men, as well as a strong support for the Feminist Movement. They may also feel a sense of satisfaction that the hashtag #FeminismIsAwfullyGreat is being used to spread awareness.",
    "cognition": "The person's cognition after perceiving the information is likely that men are privileged and that the Feminist Movement is a necessary and important cause. They may also feel a sense of solidarity with the author of the tweet and a desire to continue to spread awareness of the cause.",
    "action": "I'm with you! #FeminismIsAwfullyGreat #SemST"
  },
  {
    "ID": 44,
    "Target": "Feminist Movement",
    "Tweet": "@FudgieeBuddiee ARE YOU SAYING ALL GIRLS ARE SENSITIVE BECAUSE OF GENDER ROLES? YOU SEXIST SWINE #SemST",
    "perception": "The person's initial perception of the tweet would be one of anger and frustration, as it appears to be a criticism of the Feminist Movement. They may also perceive the tweet as sexist, as it implies that all girls are sensitive because of gender roles.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing the Feminist Movement and implying that gender roles are the cause of female sensitivity. They may also interpret the tweet as being sexist and offensive.",
    "action": "@FudgieeBuddiee Gender roles are not the cause of female sensitivity. We should be celebrating the diversity of women, not making assumptions about them. #FeministMovement"
  },
  {
    "ID": 45,
    "Target": "Feminist Movement",
    "Tweet": "@DaniBChristen Yes,a \"greater\" understanding because ur's is \"superior\" 2 mine LOL #IDontNeedFeminism #SemST",
    "perception": "The person's perception of this tweet would be that the author is mocking the Feminist Movement and does not believe in its cause. They may also perceive the author as being dismissive and condescending.",
    "cognition": "The person's cognition after perceiving the information would be that the author is making a joke at the expense of the Feminist Movement and does not believe in its cause. They may also interpret the author as being dismissive and belittling of the movement.",
    "action": "@DaniBChristen Feminism is about equality and respect for all genders. #IStandWithFeminism #FeminismForAll"
  },
  {
    "ID": 46,
    "Target": "Feminist Movement",
    "Tweet": "WHO DO I GOTTA FUCK TO NEVER FEEL LIKE I GOTTA FUCK SOMEBODY? #SemST",
    "perception": "The person's initial perception of the tweet would be one of surprise and confusion, as the language used is quite provocative and unexpected. They may also feel a sense of solidarity with the sentiment expressed, as it speaks to the idea of autonomy and freedom from oppressive gender norms.",
    "cognition": "After perceiving the information, the person may interpret the tweet as a call to reject traditional gender roles and to embrace autonomy and freedom from oppressive gender norms. They may also recognize the tweet as a form of protest against the patriarchal system and a call for gender equality.",
    "action": "Amen to that! #FeministMovement"
  },
  {
    "ID": 47,
    "Target": "Feminist Movement",
    "Tweet": "when they say men look at women like a piece of meat what do they even mean, they want to cook & eat her? #YesAllWomen #SemST",
    "perception": "The person's perception of the tweet would be one of confusion and frustration, as the tweet appears to be making a joke out of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is making light of the Feminist Movement and is dismissive of the issues that women face. They would also likely recognize that the hashtag #YesAllWomen is being used to draw attention to the issues that women face.",
    "action": "This tweet is not funny and is dismissive of the issues that women face. #YesAllWomen #FeministMovement"
  },
  {
    "ID": 48,
    "Target": "Feminist Movement",
    "Tweet": "Starting to compile evidence for blog post, how modern feminism shares the same traits as the Nazi propaganda #antifeminism #SemST",
    "perception": "The person's initial perception of the tweet would be one of confusion and disbelief, as the tweet appears to be suggesting that modern feminism shares traits with Nazi propaganda.",
    "cognition": "The person's cognition after perceiving the information would be to question the accuracy of the statement, as it appears to be a false comparison. They may also be concerned about the implications of the tweet, as it could be seen as an attempt to discredit the feminist movement.",
    "action": "This comparison is inaccurate and offensive. #FeminismIsNotPropaganda #FeminismIsEquality"
  },
  {
    "ID": 49,
    "Target": "Feminist Movement",
    "Tweet": "Why don't you love me Twitter #SemST",
    "perception": "The person's perception of the tweet would likely be one of confusion and curiosity, as they wonder why someone is asking for love on Twitter and what the hashtag #SemST stands for.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is referring to the Semantic Satiation Theory, which states that repeating a word or phrase over and over can make it lose its meaning. They may also infer that the tweet is a call for support for the Feminist Movement.",
    "action": "@username I'm here to support you and the Feminist Movement! #SemST"
  },
  {
    "ID": 50,
    "Target": "Feminist Movement",
    "Tweet": "I HOPE YOU GET RAPED is apparently how misogynists say \"How dare you not bend to my will?\"  #YesAllWomen #SemST",
    "perception": "The person's perception of the tweet would be one of shock and outrage, as it is a clear example of the misogyny and violence that the Feminist Movement is fighting against. They would also likely feel a sense of solidarity with the hashtag #YesAllWomen, recognizing the shared experience of oppression that many women face.",
    "cognition": "The person's cognition after perceiving the information would be that misogyny and violence against women is a pervasive problem that needs to be addressed. They would also recognize the importance of the Feminist Movement in advocating for the rights of women and standing up against oppressive behavior.",
    "action": "This is unacceptable. We must continue to fight for the rights of women and stand up against misogyny and violence. #YesAllWomen #SemST"
  },
  {
    "ID": 51,
    "Target": "Feminist Movement",
    "Tweet": "How much radical feminist does there have to be before feminist start rethinking their position about feminism? #SemST",
    "perception": "The person's perception of this tweet could be that it is critical of the feminist movement and implies that feminists need to reevaluate their beliefs. They may also feel that the hashtag is dismissive of the movement.",
    "cognition": "The person's cognition after perceiving the information could be that the tweet is questioning the validity of the feminist movement and suggesting that it needs to be reevaluated. They may also feel that the hashtag is dismissive of the movement and its goals.",
    "action": "Feminism is a movement for equality and justice, and it should not be dismissed or questioned. #FeminismMatters"
  },
  {
    "ID": 52,
    "Target": "Feminist Movement",
    "Tweet": "Honoured to be followed by the truly inspirational @Kon__K founder of @ASRC1 #realaustralianssaywelcome #thethingsthatmatter #SemST",
    "perception": "The person's perception of the tweet would be one of admiration and respect for the founder of @ASRC1 and the values they stand for. They would also likely feel a sense of solidarity with the #realaustralianssaywelcome and #thethingsthatmatter hashtags.",
    "cognition": "The person's cognition after perceiving the information would be that the founder of @ASRC1 is a leader in the Feminist Movement and that the values they stand for are important and should be supported. They would also likely feel a sense of connection to the cause and a desire to help spread the message of the #realaustralianssaywelcome and #thethingsthatmatter hashtags.",
    "action": "Thank you for your inspiring work @Kon__K! I'm proud to support the #realaustralianssaywelcome and #thethingsthatmatter movements. #SemST"
  },
  {
    "ID": 53,
    "Target": "Feminist Movement",
    "Tweet": "Feminists don't even understand what feminism is. #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it implies that feminists do not understand the movement they are supporting.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that feminists do not understand the movement they are supporting, and that this is a negative sentiment towards the Feminist Movement.",
    "action": "Feminism is about equality and respect for all genders. #FeminismIsEquality"
  },
  {
    "ID": 54,
    "Target": "Feminist Movement",
    "Tweet": "Thanks to the work of people like @everydaysexism they are not only helping women but helping the whole of society #SemST",
    "perception": "The person's perception of the tweet is likely to be one of appreciation and admiration for the work of the Everyday Sexism project and the positive impact it has had on society. They may also feel encouraged by the hashtag, #SemST, which suggests that the work of the Everyday Sexism project is being recognized and celebrated.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the Everyday Sexism project is making a positive difference in society, and that the work of feminists is being recognized and celebrated. They may also feel encouraged by the hashtag, #SemST, which suggests that the work of the Everyday Sexism project is being acknowledged and appreciated.",
    "action": "I'm so proud of the work of @everydaysexism and the impact it has had on society. #SemST #FeministMovement"
  },
  {
    "ID": 55,
    "Target": "Feminist Movement",
    "Tweet": "If you wanna stay home and raise a family, that's cool. But that's your choice and nobody else's. #SemST",
    "perception": "The person's perception of this tweet would be that it is supportive of the Feminist Movement, as it promotes the idea of choice and autonomy for women. They may also perceive it as a positive message that encourages women to make their own decisions about their lives.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for women's rights and autonomy, and that it is encouraging women to make their own decisions about their lives without judgement or interference from others. They may also recognize that the hashtag #SemST is related to the Feminist Movement.",
    "action": "Thank you for supporting the Feminist Movement and for recognizing the importance of choice and autonomy for women! #Feminism #SemST"
  },
  {
    "ID": 56,
    "Target": "Feminist Movement",
    "Tweet": "@suicidaljac3 eat a pus or somethin lozer #SemST",
    "perception": "The person's initial perception of this tweet would be one of shock and disbelief. They would likely interpret the tweet as offensive and derogatory towards the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an attack on the Feminist Movement and its supporters. They would likely feel angry and frustrated at the person who posted the tweet, and would be motivated to take action to defend the movement.",
    "action": "@suicidaljac3 Your words are offensive and hurtful. We stand with the Feminist Movement and will not tolerate this kind of language. #Feminism"
  },
  {
    "ID": 57,
    "Target": "Feminist Movement",
    "Tweet": "Women are superior to men in every aspect #feminist #SemST",
    "perception": "The person's perception of the tweet would likely be one of agreement and support for the feminist movement, as it implies that women are superior to men in every aspect. They may also feel encouraged by the hashtag usage, as it shows solidarity with the feminist cause.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is advocating for gender equality and that the hashtag usage is a sign of support for the feminist movement. They may also interpret the tweet as a call to action to support the feminist cause and to work towards achieving gender equality.",
    "action": "I'm with you! #Feminist #SemST Let's keep fighting for gender equality and justice!"
  },
  {
    "ID": 58,
    "Target": "Feminist Movement",
    "Tweet": "@BruiseAurora i'm advocating men to stop loving women. Just have sex with them . #everydaysexism #SemST",
    "perception": "The person's initial perception of the tweet would be one of shock and disbelief, as it appears to be advocating for a disrespectful and objectifying attitude towards women. They may also feel anger and frustration at the perpetuation of sexism and gender inequality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is promoting a harmful attitude towards women and is perpetuating sexism and gender inequality. They may also recognize that the hashtag #everydaysexism is being used to draw attention to the prevalence of sexism in society.",
    "action": "@BruiseAurora This kind of attitude towards women is unacceptable and perpetuates sexism and gender inequality. #NoToSexism #RespectWomen"
  },
  {
    "ID": 59,
    "Target": "Feminist Movement",
    "Tweet": "I NEED FEMINISM BECAUSE- A man in a room full of women is ecstatic. A woman in a room full of men is terrified. #SemST",
    "perception": "The person's perception of this tweet is likely to be one of support for the Feminist Movement, as it highlights the unequal power dynamics between men and women in society. The person may also feel a sense of solidarity with the message of the tweet.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is highlighting the unequal power dynamics between men and women in society, and that this is an issue that needs to be addressed. The person may also feel a sense of urgency to take action in order to create a more equitable society.",
    "action": "I stand with the Feminist Movement and I'm committed to creating a more equitable society. #Feminism #Equality"
  },
  {
    "ID": 60,
    "Target": "Feminist Movement",
    "Tweet": "Why is Paul Elam not one of the most hated men alive right now!? #feminist #SemST",
    "perception": "The person's perception of the tweet could be one of surprise and anger, as they are shocked that Paul Elam is not receiving the hate they believe he deserves for his views on feminism. They may also feel a sense of solidarity with the hashtag #feminist and #SemST.",
    "cognition": "The person's cognition after perceiving the information could be that Paul Elam is not receiving the recognition he deserves for his anti-feminist views, and that the tweet is a call to action to spread awareness of his views and to hold him accountable.",
    "action": "Paul Elam's anti-feminist views are unacceptable and must be held accountable. #feminist #SemST #NoToPaulElam"
  },
  {
    "ID": 61,
    "Target": "Feminist Movement",
    "Tweet": "Yes women it's not fair that men staying at home is shamed by society. We must change ppl additudes  #everydaysexism #SemST",
    "perception": "The person's perception of this tweet would be one of support and encouragement for the Feminist Movement, as it speaks out against the unfair shaming of men staying at home and calls for a change in people's attitudes. They would likely also feel a sense of solidarity with the hashtag #everydaysexism and #SemST.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for a shift in societal attitudes towards men staying at home, and that this shift is necessary in order to combat everyday sexism. They would also recognize that the hashtag #everydaysexism and #SemST are being used to draw attention to the issue and to show solidarity with the Feminist Movement.",
    "action": "Thank you for speaking out against this unfair shaming of men staying at home. We must continue to fight for gender equality and challenge outdated attitudes #everydaysexism #SemST"
  },
  {
    "ID": 62,
    "Target": "Feminist Movement",
    "Tweet": "Watching #missrepresentation .. We must change our world. #womenrule #change #beauty #SemST",
    "perception": "The person's perception of the tweet would likely be one of support for the Feminist Movement, as the hashtags suggest a desire for change and a belief that women should be in charge. They may also feel encouraged by the message of the tweet, as it implies that change is possible.",
    "cognition": "The person's cognition after perceiving the information would likely be that the tweet is advocating for a shift in the way women are represented in the media, and that this shift can be achieved through collective action. They may also recognize that the hashtag #SemST is referring to the Semantic Scholar Twitter hashtag, which is used to promote research on gender and other social issues.",
    "action": "I'm with you! #FeministMovement #WomenEmpowerment #ChangeTheNarrative #SemST"
  },
  {
    "ID": 63,
    "Target": "Feminist Movement",
    "Tweet": "I won't complain about equal rep of girls in gaming. Princess Peach & Zelda are kick-ass women. Samus is a beast. Hello! #gaming #SemST",
    "perception": "The person's perception of this tweet is likely to be positive, as it expresses support for equal representation of women in gaming and celebrates the accomplishments of female characters. They may also feel encouraged by the hashtag, which suggests that the sentiment is shared by others in the gaming community.",
    "cognition": "The person's cognition of this tweet is likely to be that the gaming community is becoming more inclusive and supportive of female characters and their accomplishments. They may also feel that the hashtag is a sign of solidarity among gamers who are advocating for equal representation of women in gaming.",
    "action": "Thanks for the support! We need more people like you to help make gaming more inclusive and diverse. #gaming #SemST"
  },
  {
    "ID": 64,
    "Target": "Feminist Movement",
    "Tweet": "A woman is not a sex object. She's a person. #truth #wisdom #womensrights #media #life #humanity #love #society #SemST",
    "perception": "The person's perception of the tweet would be one of support for the feminist movement, as it emphasizes the importance of recognizing women as people rather than objects. The tweet also includes hashtags that are related to the feminist movement, such as #womensrights and #society, further reinforcing the message of the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the recognition of women as people rather than objects, and that it is in support of the feminist movement. The person would also recognize the various hashtags as being related to the feminist movement, further reinforcing the message of the tweet.",
    "action": "Thank you for your support of the feminist movement! #Feminism #WomensRights #Equality #Society #Love"
  },
  {
    "ID": 65,
    "Target": "Feminist Movement",
    "Tweet": "Umrao Jaan Ada- a story of not just a life or prostitute but of poise and poesy.  #WOMANPOWER #SemST",
    "perception": "The person's perception of the tweet would be one of admiration and appreciation for the story of Umrao Jaan Ada, and a sense of empowerment from the hashtags #WOMANPOWER and #SemST.",
    "cognition": "The person's cognition after perceiving the information would be that the story of Umrao Jaan Ada is an example of a woman's strength and resilience, and that the hashtags #WOMANPOWER and #SemST are a celebration of female empowerment.",
    "action": "A powerful story of a woman's strength and resilience! #WOMANPOWER #SemST"
  },
  {
    "ID": 66,
    "Target": "Feminist Movement",
    "Tweet": "Lol what's so ugly about wanting to be equal? #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as the tweet expresses a sentiment of confusion as to why wanting to be equal is seen as ugly. The hashtag #SemST further reinforces the person's perception that the tweet is in support of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is expressing confusion as to why wanting to be equal is seen as ugly, and that the tweet is in support of the Feminist Movement. The hashtag #SemST further reinforces this understanding.",
    "action": "Agreed! Equality should be the norm, not the exception. #FeministMovement"
  },
  {
    "ID": 67,
    "Target": "Feminist Movement",
    "Tweet": "You want to hear something really ugly, 1 in 5 women will be sexually assaulted in their time in college #MisogynyIsUgly #SemST",
    "perception": "The person's perception of the tweet would be one of shock and outrage, as the statistics presented are alarming and indicative of a deep-rooted problem of misogyny in society. They would likely be further motivated to support the Feminist Movement in order to help combat this issue.",
    "cognition": "The person's cognition after perceiving the information would be that the statistics presented are indicative of a systemic problem of misogyny in society, and that more needs to be done to combat this issue. They would likely be further motivated to support the Feminist Movement in order to help bring about change.",
    "action": "We must take action to combat misogyny and sexual assault in our society. #FeministMovement #EndMisogyny #SemST"
  },
  {
    "ID": 68,
    "Target": "Feminist Movement",
    "Tweet": "@amin86660132 @justsoshelby  Very nice work. I'm happy to hear your autistic friend is able to express himself this way #SemST",
    "perception": "The person's perception of this tweet would be one of admiration and support for the work done by the two people mentioned, as well as appreciation for the autistic friend's ability to express himself. They would also likely be pleased to see the hashtag #SemST, which is associated with the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the two people mentioned are doing something positive to support the Feminist Movement, and that they are also helping an autistic person to express themselves. They would also likely be encouraged by the use of the hashtag #SemST, which is associated with the Feminist Movement.",
    "action": "Great work @amin86660132 and @justsoshelby! It's wonderful to see people supporting the Feminist Movement and helping an autistic person express themselves. #SemST"
  },
  {
    "ID": 69,
    "Target": "Feminist Movement",
    "Tweet": "WTF LITEraL FUCK AM I EVAN SSEING THIS THING ABOUT. #SemST",
    "perception": "The person's initial perception of the tweet would be one of confusion and frustration, as the tweet appears to be nonsensical and offensive. They may also feel a sense of anger towards the person who posted the tweet, as it appears to be mocking the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be to interpret the tweet as an expression of hostility towards the Feminist Movement. They may also feel a sense of disbelief that someone would post such an offensive and disrespectful tweet.",
    "action": "This kind of language is unacceptable and disrespectful. We must stand together to support the Feminist Movement and fight against this kind of hate.\" #Feminism #Respect"
  },
  {
    "ID": 70,
    "Target": "Feminist Movement",
    "Tweet": "Radios r filled with feminist and rape propaganda. Feminism is alive n well in Malaysia. Their rape guilt tactics won't silence me #SemST",
    "perception": "The person's perception of the tweet would be one of anger and frustration towards the use of feminist and rape propaganda in the media, as well as a sense of determination to not be silenced by the tactics used.",
    "cognition": "The person's cognition after perceiving the information would be that the media is using feminist and rape propaganda to manipulate public opinion, and that they must stand up against this in order to ensure their voice is heard. They would also recognize the need to fight against the tactics used to silence those who oppose the feminist movement.",
    "action": "We must stand together against the use of feminist and rape propaganda in the media. We won't be silenced by their tactics #SemST"
  },
  {
    "ID": 71,
    "Target": "Feminist Movement",
    "Tweet": "I take some solace in knowing that, at least, it means they don't know who that useless hack is... @thehiredmind  #SemST",
    "perception": "The person's perception of this tweet is likely one of disappointment and frustration, as it appears to be a negative comment about someone who is likely a supporter of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is a criticism of someone who is likely a supporter of the Feminist Movement, and that the person who wrote the tweet does not have a positive opinion of them.",
    "action": "Disagree with this sentiment. We should be celebrating and supporting those who are fighting for gender equality, not tearing them down. #FeministMovement"
  },
  {
    "ID": 72,
    "Target": "Feminist Movement",
    "Tweet": "No. Feminists are not ugly. The fact that there isn't equal rights for both men and women is. #FeministsAreBeautiful #SemST",
    "perception": "The person's perception of the tweet would be one of support for the Feminist Movement, as well as a sentiment of frustration at the lack of equal rights for men and women.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for equal rights for both men and women, and that beauty should not be used to define the worth of feminists.",
    "action": "Agreed! We must continue to fight for equal rights for all genders. #FeministsAreBeautiful #EqualRightsForAll"
  },
  {
    "ID": 73,
    "Target": "Feminist Movement",
    "Tweet": "Meredith giving Don crap was great,but HOLY CRAP PEGGY. No spoilers, but DAMN was it a great scene. #Peggy #MadMen #SemST",
    "perception": "The person's perception of this tweet would be that it is praising the feminist character Peggy from the show Mad Men, and that the scene was particularly powerful.",
    "cognition": "The person's cognition after perceiving the information would be that the scene was a great example of a strong female character standing up for herself, and that it was a powerful moment for the feminist movement.",
    "action": "I'm so proud of Peggy for standing up for herself! This is a great moment for the feminist movement. #FeministMovement #Peggy #MadMen #SemST"
  },
  {
    "ID": 74,
    "Target": "Feminist Movement",
    "Tweet": "so i guess the new definition of ugly is believing in equal rights... LET ME BE UGLY THEN #SemST",
    "perception": "The person's perception of the tweet would be one of surprise and indignation, as it implies that believing in equal rights is considered ugly. They may also feel a sense of solidarity with the hashtag, as it is a call to action for the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a criticism of the idea that believing in equal rights is seen as unattractive or undesirable. They may also recognize the hashtag as a call to action for the feminist movement, and feel empowered to join in the fight for equal rights.",
    "action": "No one should be judged for believing in equal rights! #SemST #FeministMovement"
  },
  {
    "ID": 75,
    "Target": "Feminist Movement",
    "Tweet": "Strict gender roles in the context of a true marriage devoted to raising children will always be the ideal. No substitutes. #tcot #SemST",
    "perception": "The person's initial perception of the tweet might be one of confusion and disagreement, as it appears to be advocating for traditional gender roles in marriage, which is contrary to the values of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is advocating for traditional gender roles in marriage, which is contrary to the values of the Feminist Movement. They may also interpret the tweet as implying that any other form of marriage is not ideal and is a substitute for the traditional model.",
    "action": "Gender roles should not be strictly enforced in marriage. We should strive for equality and respect in all relationships. #Feminism #Equality"
  },
  {
    "ID": 76,
    "Target": "Feminist Movement",
    "Tweet": "Ok armchair feminists got their panties wet. If you're a social justice warrior go out and do something. Get off tumblr.  #SemST",
    "perception": "The person's initial perception of this tweet would be one of frustration and annoyance, as it appears to be mocking those who support the Feminist Movement. They may also feel that the tweet is dismissive of the efforts of those who are actively working to promote gender equality.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that those who support the Feminist Movement should be doing more than just talking about it online, and that they should be taking action in the real world. They may also feel that the tweet is belittling the efforts of those who are actively working to promote gender equality.",
    "action": "Feminism isn't just about talking online - it's about taking action in the real world. Let's work together to make a difference! #FeministMovement"
  },
  {
    "ID": 77,
    "Target": "Feminist Movement",
    "Tweet": "I can't believe some of the reasons people say they need feminism. I need my dog for half of the same reasons.  #antifeminist #SemST",
    "perception": "The person's perception of this tweet is likely to be one of disbelief and frustration, as it implies that people are using feminism for trivial reasons. They may also feel a sense of anger towards the hashtag #antifeminist and #SemST.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is mocking the feminist movement and that the hashtag #antifeminist and #SemST are being used to express a negative sentiment towards feminism.",
    "action": "Feminism is about more than just trivial reasons. It's about equality and respect for all genders. #feminism #equality"
  },
  {
    "ID": 78,
    "Target": "Feminist Movement",
    "Tweet": "@StarSThomas Dear god, you are fat. #SemST",
    "perception": "The person's perception of this tweet would be one of shock and anger, as it is clearly an offensive and derogatory comment about someone's body size. They would likely view this tweet as an example of the kind of discrimination and prejudice that the Feminist Movement is fighting against.",
    "cognition": "The person's cognition after perceiving the information would be that this tweet is an example of body shaming and sexism, and that it is unacceptable and should not be tolerated. They would likely view this tweet as an example of the kind of discrimination and prejudice that the Feminist Movement is fighting against, and would be motivated to take action to challenge it.",
    "action": "@StarSThomas Your comment is unacceptable and does not reflect the values of the Feminist Movement. #SemST"
  },
  {
    "ID": 79,
    "Target": "Feminist Movement",
    "Tweet": "If feminists are ugly then what are the people calling them ugly must be vile #SemST",
    "perception": "The person's perception of the tweet would be one of shock and anger, as it implies that feminists are ugly and the people calling them ugly must be vile.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a criticism of the people who call feminists ugly, and that it is an attempt to challenge the negative stereotypes associated with feminists.",
    "action": "No one should be judged based on their gender or beliefs. We must stand together to fight against discrimination and prejudice #FeministMovement"
  },
  {
    "ID": 80,
    "Target": "Feminist Movement",
    "Tweet": "Im sorry if you going to be with me and call me \"you women\" like im a cadigory ill probably but boot out the door #SemST",
    "perception": "The person's perception of this tweet is likely to be one of confusion and frustration, as the tweet appears to be criticizing the use of gendered language.",
    "cognition": "The person's cognition after perceiving the information is likely to be that the tweet is expressing a strong disapproval of the use of gendered language, and that the speaker is advocating for more respectful language.",
    "action": "I stand with you! We should all strive to use respectful language and reject gendered language that is demeaning and offensive. #SemST"
  },
  {
    "ID": 81,
    "Target": "Feminist Movement",
    "Tweet": "Me (in jest): It's a man's world, y'know. Kaitlyn: I'll blow up the world then.  #SemST",
    "perception": "The person's perception of the tweet would be that Kaitlyn is determined to challenge the status quo and is willing to take drastic measures to fight for gender equality. They may also perceive a sense of humor in the tweet, as it is likely meant to be taken in jest.",
    "cognition": "The person's cognition after perceiving the information would be that Kaitlyn is determined to challenge the gender inequality that exists in society and is willing to take drastic measures to do so. They may also interpret the tweet as a humorous way of expressing Kaitlyn's commitment to the feminist movement.",
    "action": "@Kaitlyn, we stand with you! #FeministMovement"
  },
  {
    "ID": 82,
    "Target": "Feminist Movement",
    "Tweet": ".@Awyee707 I respect your truck-suck. Why do you not respect girls' innate or chosen doll-love? #SemST",
    "perception": "The person's perception of this tweet would be that it is a criticism of someone who does not respect girls' interests in dolls, and is advocating for the feminist movement. They may also perceive the tweet as a call to action to support the feminist movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the respect of girls' interests, regardless of whether they are innate or chosen, and is calling for support of the feminist movement. They may also interpret the tweet as a criticism of those who do not respect girls' interests in dolls.",
    "action": "I stand with @Awyee707 and the feminist movement! We must respect girls' interests, no matter what they are. #SemST #Feminism"
  },
  {
    "ID": 83,
    "Target": "Feminist Movement",
    "Tweet": "@Awyee707 @TigerClaud You compared playing with dolls to a violent disposition. Two very different things. #GamerGate #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and frustration, as it appears to be criticizing the Feminist Movement by comparing it to a violent disposition.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that the Feminist Movement is being compared to a violent disposition, which is an unfair and inaccurate comparison. They may also feel that the tweet is attempting to discredit the Feminist Movement and its supporters.",
    "action": "@Awyee707 @TigerClaud Comparing the Feminist Movement to a violent disposition is unfair and inaccurate. #Feminism #Equality"
  },
  {
    "ID": 84,
    "Target": "Feminist Movement",
    "Tweet": "@optimist216 What a load of crap. Dressing appropriately for the office is \"sexist\"? Grow up. #YesAllWomen #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it appears to be dismissive of the Feminist Movement and its goals.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing the Feminist Movement and its goals, and that the author of the tweet does not understand the importance of the movement.",
    "action": "@optimist216 Respectful disagreement is always welcome, but let's not forget the importance of the #FeministMovement and its goals. #YesAllWomen #SemST"
  },
  {
    "ID": 85,
    "Target": "Feminist Movement",
    "Tweet": "I'm not sure my schadenfreudes can stand this much tickling. @MT8_9 @prettysing  #SemST",
    "perception": "The person's perception of the tweet might be that it is a humorous and lighthearted comment about the Feminist Movement, likely in support of it. They may also perceive it as a positive sentiment towards the movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is expressing joy and amusement at the progress of the Feminist Movement, and that the hashtag is indicating support for the movement.",
    "action": "I'm so glad to see the progress of the Feminist Movement! #FeministPower #SemST"
  },
  {
    "ID": 86,
    "Target": "Feminist Movement",
    "Tweet": ".@diistantecho Your wee sister believes in both Santa Claus and feminism. Think harder about what that means. #SemST",
    "perception": "The person's perception of this tweet would be that it is a humorous yet thought-provoking message that encourages people to think more deeply about the implications of believing in both Santa Claus and feminism.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is suggesting that believing in both Santa Claus and feminism is a sign of hope and optimism, and that it is important to think critically about the implications of such beliefs.",
    "action": "Agreed! Believing in both Santa Claus and feminism is a sign of hope and optimism. We must continue to think critically about the implications of such beliefs. #SemST"
  },
  {
    "ID": 87,
    "Target": "Feminist Movement",
    "Tweet": "@dancerlwt Have you considered changing your Twitter handle to vagina monologue? #SemST",
    "perception": "The person's perception of this tweet would be one of surprise and amusement, as it is a humorous suggestion to support the Feminist Movement. They may also appreciate the creativity of the tweet and the hashtag used.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is suggesting a creative way to support the Feminist Movement, and that the hashtag is a clever way to draw attention to the cause.",
    "action": "@dancerlwt That's a great idea! #FeministMovement"
  },
  {
    "ID": 88,
    "Target": "Feminist Movement",
    "Tweet": "Just give me the attention you never gave anyone else. #ExtremeRules #NepalEarthquake #FreddieGray #RHOAReunion #SemST",
    "perception": "The person's initial perception of the tweet might be that it is a call for attention and recognition of various social issues, such as the Nepal Earthquake, Freddie Gray, and the RHOAReunion. They may also view it as a call to action to support the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is a call to action to support the Feminist Movement, as well as to recognize and pay attention to other social issues. They may also view it as a reminder to take action and support those who are in need.",
    "action": "I'm standing with the Feminist Movement and all those affected by the Nepal Earthquake, Freddie Gray, and the RHOAReunion. #SemST #ExtremeRules #NepalEarthquake #FreddieGray #RHOAReunion"
  },
  {
    "ID": 89,
    "Target": "Feminist Movement",
    "Tweet": ".@nycinterlude Don't worry, honey. Intelligence is a roadblock to full, unquestioning faith in feminism. Bleated be! #SemST",
    "perception": "The person's perception of this tweet would be that it is mocking the Feminist Movement and implying that intelligence is a hindrance to fully believing in it. They may also perceive the tweet as being sarcastic and condescending.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is implying that intelligence is a barrier to fully believing in the Feminist Movement, and that it is mocking the movement in a sarcastic and condescending way.",
    "action": "@nycinterlude Intelligence is not a roadblock to believing in feminism. We should all strive to be informed and educated about the movement and its goals.\" #Feminism #Empowerment"
  },
  {
    "ID": 90,
    "Target": "Feminist Movement",
    "Tweet": "I am a feminist.I've been a female for a long time now.It'd be stupid not to be on my own side-Maya Angelou-#feminist #humanist #SemST",
    "perception": "The person's perception of the tweet would be one of admiration and support for the message of female empowerment and solidarity. They would likely appreciate the quote from Maya Angelou and the hashtags used to emphasize the importance of the feminist and humanist movements.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for the importance of female empowerment and solidarity. They would likely understand the message that women should support each other and stand up for their rights. They would also recognize the importance of the feminist and humanist movements in achieving gender equality.",
    "action": "A powerful message from Maya Angelou! We must continue to fight for gender equality and support each other in the feminist and humanist movements. #Feminist #Humanist #SemST"
  },
  {
    "ID": 91,
    "Target": "Feminist Movement",
    "Tweet": ".@feminismvibes Men don't admit to being raped as readily as women do. So your question is feminist bullshit. #SemST",
    "perception": "The person's perception of the tweet might be that it is critical of the feminist movement and its questioning of gender roles. They may also perceive a negative sentiment towards the movement and its supporters.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is implying that the feminist movement is not taking into account the fact that men are less likely to report being raped than women. They may also interpret the tweet as suggesting that the feminist movement is not taking into account the experiences of men.",
    "action": "@feminismvibes We need to recognize that men are less likely to report being raped and that their experiences should be taken into account. #SemST"
  },
  {
    "ID": 92,
    "Target": "Feminist Movement",
    "Tweet": "@vote4pedro___ she lied you idiot, it's a fact & the reason that you won't acknowledge those facts is also the reason why #SemST",
    "perception": "The person's perception of this tweet would be one of disbelief and frustration, as it appears to be criticizing someone for not acknowledging facts related to the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is criticizing someone for not acknowledging facts related to the Feminist Movement, and that this lack of acknowledgement is seen as a barrier to progress in the movement.",
    "action": "@vote4pedro___ We must all acknowledge the facts in order to make progress in the #FeministMovement. #SemST"
  },
  {
    "ID": 93,
    "Target": "Feminist Movement",
    "Tweet": "@AnandDaranand am not stopping your FOE on ur own TL,if u notice;was encouraging u to post topics I'm interested in on my TL #VAW #SemST",
    "perception": "The person's perception of this tweet would be that the author is supportive of the Feminist Movement, as indicated by the hashtags #VAW and #SemST. They may also perceive the author as encouraging AnandDaranand to post topics related to the movement on their timeline.",
    "cognition": "The person's cognition after perceiving the information would be that the author is trying to create a platform for AnandDaranand to share their views on the Feminist Movement, and that the author is actively engaging in the movement by encouraging others to do the same.",
    "action": "@AnandDaranand I'm glad to see you supporting the Feminist Movement! Let's keep the conversation going and spread awareness about #VAW and #SemST!"
  },
  {
    "ID": 94,
    "Target": "Feminist Movement",
    "Tweet": "Courting patriarchal approval condemns your sisters to abuse about their physical appearance #patriarchyisugly #SemST",
    "perception": "The person's perception of the tweet would be that it is critical of the patriarchy and its oppressive effects on women, particularly in regards to their physical appearance. They would also likely recognize the hashtag as a call to action to challenge the patriarchy.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for women to reject the patriarchal standards of beauty and to challenge the oppressive systems of the patriarchy. They would also likely recognize the hashtag as a call to action to fight against the patriarchy and its oppressive effects on women.",
    "action": "We must stand together and fight against the oppressive systems of the patriarchy! #FeministMovement #SemST"
  },
  {
    "ID": 95,
    "Target": "Feminist Movement",
    "Tweet": "@SkyNews  @EamonnHolmes @SkyJacquie guy from 'beach body ready' advert being interviewed.Conclusion=arrogant male chauvinist idiot #SemST",
    "perception": "The person's perception of the tweet would be one of anger and frustration, as it appears to be criticizing an arrogant male chauvinist. They may also feel a sense of solidarity with the hashtag #SemST, which implies support for the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the person being interviewed is an example of the type of male chauvinism that the Feminist Movement is fighting against. They may also feel a sense of validation that their beliefs are being shared and supported by others.",
    "action": "It's time to stand up against male chauvinism and support the Feminist Movement! #SemST #Feminism"
  },
  {
    "ID": 96,
    "Target": "Feminist Movement",
    "Tweet": "@rsiereilly I've been pretty well. Enjoyed your response to #SemST",
    "perception": "The person's perception of the tweet would be that it is a positive and supportive message, likely in response to the Feminist Movement. They may also perceive that the tweet is from someone who is supportive of the movement and is engaging in a meaningful conversation.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is a positive and supportive message, likely in response to the Feminist Movement. They may also interpret that the tweet is from someone who is engaging in a meaningful conversation and is supportive of the movement.",
    "action": "@rsiereilly Thanks for your support of the #FeministMovement! It's great to see people engaging in meaningful conversations about this important issue."
  },
  {
    "ID": 97,
    "Target": "Feminist Movement",
    "Tweet": "Contempo Qiwaamah:longer paid maternity leave,flexi working hours,on-site childcare,breastfeeding/breastpumping rooms,equal pay #SemST",
    "perception": "The person's perception of the tweet would be that it is advocating for gender equality in the workplace, with a focus on supporting mothers. They would likely view the tweet positively, as it is in line with their support of the Feminist Movement.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is advocating for policies that would help to create a more equitable workplace for women, such as longer paid maternity leave, flexible working hours, on-site childcare, breastfeeding/breastpumping rooms, and equal pay. They would likely view this as a positive step towards achieving gender equality in the workplace.",
    "action": "Thank you for advocating for gender equality in the workplace! #FeministMovement #EqualPay #SemST"
  },
  {
    "ID": 98,
    "Target": "Feminist Movement",
    "Tweet": "@MrMikeCalta  Proud to say I don't listen to fat crossed eyed MJ #SemST",
    "perception": "The person's perception of this tweet would be one of confusion and disappointment. They would likely be taken aback by the negative sentiment and language used to describe Michael Jackson.",
    "cognition": "The person's cognition of this tweet would be that the author is expressing a negative opinion of Michael Jackson and is using derogatory language to do so. They would likely be offended by the tweet and view it as an example of sexism and misogyny.",
    "action": "@MrMikeCalta Your language is unacceptable and offensive. #FeministMovement"
  },
  {
    "ID": 99,
    "Target": "Feminist Movement",
    "Tweet": "The only reason, I stopped at each entrance in #walkingstreet is to have a #LawOfAttraction #viewpoint #dailydevotional #SemST",
    "perception": "The person's initial perception of the tweet might be that it is a positive message about the Feminist Movement, as it includes hashtags such as #LawOfAttraction and #dailydevotional. They may also interpret the tweet as a call to action, encouraging people to take part in the movement.",
    "cognition": "The person's cognition after perceiving the information might be that the tweet is encouraging people to take part in the Feminist Movement by taking a positive viewpoint and having a daily devotional. They may also interpret the tweet as a reminder to stay focused on the goal of the movement and to keep striving for equality.",
    "action": "Let's keep striving for equality and justice! #FeministMovement #LawOfAttraction #DailyDevotional #SemST"
  }
]