[
  {
    "ID": 0,
    "Target": "Feminist Movement",
    "Tweet": "Always a delight to see chest-drumming alpha males hiss and scuttle backwards up the wall when a feminist enters the room. #manly #SemST",
    "perception": "The person's perception of this tweet is likely to be one of admiration and amusement, as it implies that feminists are powerful and intimidating to men.",
    "cognition": "The person's cognition of this tweet is likely to be that feminists are strong and capable of standing up for themselves, and that men should not be intimidated by them. They may also view the hashtag as a sign of respect for the feminist movement.",
    "action": "Amen! #FeministPower #Respect"
  },
  {
    "ID": 1,
    "Target": "Feminist Movement",
    "Tweet": "Sometimes I overheat and want to take off my shirt but can't because of social expectations of people with breasts. ;n; #SemST",
    "perception": "The person's perception of this tweet would be one of understanding and empathy, as it speaks to the struggles of those who are expected to adhere to certain gender norms. They may also feel a sense of solidarity with the person who posted the tweet, as it speaks to a shared experience.",
    "cognition": "The person's cognition after perceiving the information would be that gender norms can be oppressive and restrictive, and that there is a need for greater acceptance and understanding of those who do not conform to traditional gender roles. They may also recognize the importance of the Feminist Movement in advocating for greater gender equality and acceptance.",
    "action": "I stand with you! We need to work together to create a world where everyone can express themselves freely and without judgement. #FeministMovement"
  },
  {
    "ID": 2,
    "Target": "Feminist Movement",
    "Tweet": "If feminists spent 1/2 as much time reading papers as they do tumblr they would be real people, not ignorant sexist bigots. #SemST",
    "perception": "The person's initial perception of this tweet would be one of offense and anger, as it implies that feminists are ignorant and sexist. They may also feel that the tweet is belittling the Feminist Movement.",
    "cognition": "After perceiving the information, the person may interpret the tweet as implying that feminists should focus more on reading scholarly papers than on Tumblr in order to be taken seriously. They may also feel that the tweet is suggesting that feminists are not knowledgeable enough about the issues they are advocating for.",
    "action": "Feminists are knowledgeable and passionate about the issues they are advocating for. We should all be working together to create a more equitable society. #FeministMovement"
  },
  {
    "ID": 3,
    "Target": "Feminist Movement",
    "Tweet": "Stupid Feminists, the civilization you take for granted was built with the labour, blood sweat and tears of men. #SemST",
    "perception": "The person's perception of the tweet could be one of anger and frustration towards the speaker, as the tweet implies that feminists are ungrateful for the work of men. They may also feel that the speaker is attempting to discredit the feminist movement.",
    "cognition": "The person's cognition after perceiving the information could be that the speaker is attempting to discredit the feminist movement by implying that feminists are ungrateful for the work of men. They may also feel that the speaker is attempting to downplay the importance of the feminist movement and its contributions to society.",
    "action": "Feminists have been integral to the progress of civilization and have made countless contributions to society. #FeminismMatters"
  },
  {
    "ID": 4,
    "Target": "Feminist Movement",
    "Tweet": "YOU'RE A GIRL AND HAVE A SEX DRIVE!? YOU MUST BE A SLUT! #feminist #SemST",
    "perception": "The person's perception of the tweet would be one of shock and disbelief, as it is a derogatory statement that undermines the feminist movement. They may also feel anger and frustration at the negative attitude towards women expressed in the tweet.",
    "cognition": "The person's cognition after perceiving the information would be that the tweet is an example of sexism and misogyny, and that it is an attack on the feminist movement. They may also recognize that the tweet is an example of slut-shaming, which is a form of gender-based discrimination.",
    "action": "No one should be shamed for their gender or sexuality. #feminist #SemST #NoShame"
  }
]